{
  "url": "https://www.acquired.fm/episodes/atari-with-nolan-bushnell",
  "title": "Atari (with Nolan Bushnell)",
  "heading": "Season 5, Episode 5",
  "date": "October 15, 2019",
  "description": "The complete history and strategy of Atari\nWe’re joined by the legendary Nolan Bushnell, founder not only of Atari, but also the only person ever to hire Steve Jobs, the recipient of Sequoia Capital’s first-ever investment, and the creator of Chuck E. Cheese, the canonical GPS navigation arrow, and a little project that would go on to become Pixar. We cover it all in this special episode!‍\n\nLinks:",
  "transcript": "Ben: Welcome to Season 5 Episode 5 of Acquired, the podcast about great technology companies and the stories behind them. I'm Ben Gilbert and I am the co-founder of Pioneer Square Labs, a startup studio and early-stage venture fund in Seattle.\nDavid: I'm David Rosenthal and I am a general partner at Wave Capital, an early-stage venture firm focused on marketplaces based in San Francisco.\nBen: We are your hosts. Today we are talking about the company that invented the home video game industry, Atari. We have someone with us who's got some pretty good stories about it, the founder of Atari, the father of the video game industry, Nolan Bushnell. Hello, Nolan.\nNolan: Great to be here, good fun.\nDavid: Thank you so much for joining us.\nBen: As some of our listeners know, Nolan has started a swath of other businesses, one of which awesomely is Chuck E. Cheese, which we will get much, much deeper into later this episode.\nDavid: We dug up some photos of young Ben last night.\nBen: Nolan, I should let, I'm going to turn my computer around right now, Chuck E. Cheese was by far and away my favorite place in the world growing up.\nDavid: Mine, too.\nNolan: It wasn't designed that way.\nBen: Here are some pictures of my third birthday at Chuck E. Cheese.\nDavid: From your mom, right?\nBen: Yeah, she dug them up last night. There's me with my favorite toy which is a Chuck E. doll.\nNolan: How fun.\nBen: I might be too old for it there.\nNolan: Yeah.\nDavid: You’re never too old for a Chuck E. doll.\nBen: No. Now, Nolan, this is fun timing for us and for our listeners since our last episode covered the early days of Sequoia Capital and Don Valentine's career, which you had a lot to do with.\nNolan: Don was really maybe the best board member I've ever had. He was also the most frustrating and infuriating. He had this ability to ask me a question about my own company that I didn't know, but the minute he asked it, I knew I should have known then. I started to cram for board meetings saying, “Okay, Don's not going to catch me this time,” and he always would. I always believed that a proper insightful question can be very instructive.\nDavid: As we covered in our last episode, Don and the Socratic method that was really the root of what he pioneered at Sequoia.\nNolan: Yeah. Socratic method has a lot going for it.\nBen: Listeners, our last Limited Partner episode was a deep dive into marketplaces from an academic perspective. On this show, we often talk about the levers at play in marketplace businesses, and as you would suspect, there are experts who have spent their careers studying and categorizing things like take rate, search and discovery problem, and when to subsidize. One such expert is Ramesh Johari, a professor at Stanford and advisor to Wave, along with Uber, Airbnb, Stitch Fix, and many other great marketplace businesses.\nIf you want to listen and become an Acquired Limited Partner, you can get started with a seven-day free trial and listen right here in the podcast player of your choice by clicking the link in the show notes or going to glow.fm/acquired. Lastly, before we dive in, I want to thank the sponsors of all of Season 5, Silicon Valley Bank. I caught up with our sponsor so let's dive in for a little Q&A.\nThanks to SVB. Now, on to Atari.\nDavid: Yeah, let's do it. Nolan, you were born in Clearfield, Utah. Is that just outside Salt Lake City?\nNolan: It's about halfway between Salt Lake and Ogden.\nDavid: Okay. We were talking a bit before the show about your reflecting on how you became an entrepreneur. It started pretty early with strawberries. Can you tell us the story about your first business venture in Clearfield?\nNolan: My mother, over the dinner table, said, “We've got too many strawberries,” we always had a truck garden in the back of the house and we'd grow raspberries, strawberries, and all kinds of things, a bunch of trees. She said, “We've got way too many strawberries, we're going to have to give him away.” It so happens the next day, she took me to a grocery store and I noticed in the produce section, they had strawberries in these baskets for fifty cents a basket. I thought to myself, “Hey, there's a market,” and I went home, I picked the strawberries, we had a bunch of baskets sitting on the shelf in the garage, filled them up and marketed them door-to-door. At the end of the day—this was an hour-and-a-half's work—I had $5. This is in a world in which my allowance was fifteen cents a week.\nDavid: Wow.\nNolan: All of a sudden, I said, “Hahaha.”\nDavid: What did your family think of this?\nNolan: My mom, first of all said, “You took that money from our neighbors?” I said, “No, but I provided a service, they didn't have to go all the way to the store.”\nDavid: Yeah, you’re like the Good Eggs. I don't think it exists down in Southern California yet, but it's fresh farm-to-table groceries delivered to your door in San Francisco, and it's wonderful. Jenny loves it, we use it all the time.\nNolan: Now, here's the question, I've often felt that, that changed my brain to say, “Okay, delink pay for hours into getting a good project,” or did I have a brain that was different to begin to see that connection between strawberries and a marketplace?\nBen: Yeah, nurture or nature.\nNolan: Nature or nurture, but I can't answer that.\nDavid: But you saw this yourself, your mom didn't tell you to go start selling strawberries.\nNolan: Yeah.\nDavid: You must have been younger than 10 at this point, right?\nNolan: I was eight.\nDavid: Wow. Then when you were about 10, you started a TV repair business.\nNolan: That’s correct.\nDavid: That would come in quite useful later, I would imagine.\nNolan: I'd always been a techie kid. I was always curious about how things worked and that sort of thing. I watched a TV repairman that came to our house, the TVs were big and bulky, and it was all house calls.\nDavid: This was the 1960s?\nNolan: Oh, no, this was 1953.\nDavid: Wow.  TVs were a piece of furniture.\nNolan: Yeah, and basically cost a month's salary. It was a different ballgame. I noticed that all the guy did was change tubes. Looking at that, I said, “That's not very tricky.” So, the next time our TV failed, I said, “I'm going to give this a go.”\nBen: Sure, it wasn’t great the first time.\nNolan: I got a shock and various things, I learned how to discharge the CRT because it's popped up to 15,000 volts, you don't want to do that.\nDavid: Entrepreneurship comes with risk.\nNolan: Yeah, but in those days, the schematic on the back panel, one tube was the vertical oscillator, another one was the first IF. All of a sudden, I could tell which was. If you had a lot of rolls, that was the vertical oscillator. Just by looking at the screen, it was almost self-diagnostic and I fixed it. In doing so, I'd found a wholesale supplier of tubes, these are all tubes for semiconductors. I'm really old.\nDavid: This is before Fairchild.\nNolan: Yeah. I said, “Hey, maybe there's a business here.” I started marketing my skills. Those days, a house call was $5.\nDavid: Wow. You could spend all day selling strawberries or you could do one house call for the same amount.\nNolan: Well, no, but I didn't believe that they're going to let a 10-year-old kid get into the back of their thing for $5. I decided to charge 50 cents for a house call.\nDavid: Oh, you undercut the market.\nNolan: I undercut the market a long way. My theory was that I would monetize a different way through marking up the tubes. That work swimmingly.\nDavid: It’s almost like a car trip to the consulate business.\nNolan: Yeah. Then a couple of months in, I started getting a reputation. I went up to buckets of house calling, too. It was a thing of market entry price, you give a discount. I made a lot of money just repairing TV sets.\nDavid: This is pretty awesome. You're 10 years old, you have your experience with TVs and the technology going into televisions at the time, then your next job, I believe, you get exposure to the game world. Was your next adventure at Lagoon Amusement Park?\nNolan: Actually not. My TV repair business turned into a full appliance repair business and I became part of Barlow Furniture company. With that, I would go out, I'd repair washers, dryers, and that sort of thing. Basically Barlow would be able to charge a lot more and I'd get half.\nBen: Pretty good for a 10-year-old.\nNolan: Yeah, this was 10, 11, 12, 13, 14, 15, 16, I continued that until I went to college at 18.\nDavid: You started at Utah State, right?\nNolan: Correct.\nDavid: Got it.\nNolan: I was living at the fraternity house. I started doing gigs. I always had money because I saved.\nBen: You’re an entrepreneur.\nNolan: I was an entrepreneur. In those days, there was what they called $25 for $20, and that means that a lot of the kids would get the check from their parents at the end of the month and they'd be out of money by the 15th. I'd lend them $20 but they had to give me $25.\nBen: What’s the APR on $25 for $20? When did you need to collect it by?\nNolan: Oh, the fifth of the month.\nBen: They have five days then.\nNolan: Yeah.\nBen: Wow.\nDavid: That's awesome. I can see how you got into the carnival business.\nNolan: Oh, yeah. I'm a carny, but I made gobsmacks for the money selling phony IDs.\nBen: Yeah, it's an age-old business.\nNolan: This was before computers.\nDavid: You were raised a Mormon, right? And I assume most of your classmates were members of the Mormon Church, right?\nNolan: About half, maybe a third.\nDavid: You had a two-thirds of the student body, you had a market for the fake IDs.\nNolan: What I’d done is I'd went to a war surplus place and they had one of these little printers that was about like this, the plate, and you’d ink the plate. The trick was the driver's licenses in those days had unique fonts and different things that you couldn't do on a typewriter, but I could do on my printing press. I originally did the printing press because I wanted to print out my business cards.\nBen: You need one.\nNolan: Yeah, then I found out that you could do the technology there for driver's license. It was on check paper. I just go down and find counter checks at the bank, I take a bunch of them. If you turn my driver's license over, you'd see, “Paid to the order of…”\nBen: It must not have been that stringent at bars at that point.\nNolan: Not that stringent.\nDavid: They wanted the money from the students. You were loaning the money to the students and then you were selling them fake IDs, that's great.\nNolan: Primarily, to freshmen, but the thing is, I would say, “Hey, I know this guy that will supply things and he's expensive,” but I charge $50 for a fake ID in those days and I'd say, “Hey, I'm taking $5, it's commission to broker this deal but I'll get it to you,” and they’d give the name and what-have-you.\nBen: They never knew the faceless person who is actually doing the ID which is, of course, you.\nNolan: Yeah.\nDavid: You have this, at the time, quite lucrative especially for a college student business is going on.\nNolan: I was driving an MGA sports car and later on I traded in for a Mercedes 190 SL.\nBen: Were you getting any funny looks from people? Are they like, “How are you getting all that money to buy cars like that?”\nNolan: Nobody really thought about it that much, but then I did a really good one and this was called the Campus Company. The Campus Company was a student blotter that had a calendar of events in the center. I’d sell advertising around the side and give it away free to the kids at the beginning of the quarter. I'd sell $5,000 worth of advertising and it cost me $500 to print it and give them away. The part that I didn't know is that once you did that, I'd do it for every quarter, everybody would reup. I only had to sell a couple who would fall out, it was nothing.\nI went from Utah State to the University of Utah, to BYU, to Weaver State, and all of a sudden, I had all the colleges in the area, every time 5000 piece. Since I was doing the sales, when I'd go to a men’s wear place, I'd say, “You can pay me $150 or I'll take a suit.” I got a moped, I got all kinds of great stuff.\nBen: Amazing. That’s like trading the paperclip for the house.\nNolan: Yeah. The reason I bring up Campus Company because that was actually the driver for me to get the job at the amusement park.\nDavid: Okay, I was wondering why you needed the money to work at the amusement park.\nNolan: It was a thing where I was putting myself through college, had a relatively good lifestyle. Let's put it this way, I am an undisciplined disciplined person. That is, when it comes to short-term, I'm somewhat undisciplined, that is a summer night in Utah going out with girls and things—you can spend a lot of money—and I decided that in order to remove harm's way, I get a fun job at the amusement park.\nDavid: To keep you off the streets.\nNolan: Keep me off the streets, and that's why I say I'm disciplined in terms of long-term strategy, but undisciplined when it comes to short-term.\nDavid: You need to remove temptation.\nNolan: Exactly. It violated one of my rules which all of a sudden I was working for a paycheck.\nBen: Yeah, trading time for dollars.\nNolan: Trading time for dollars, but then I discovered that in the games department, they paid a commission when you did above that and all of a sudden I could turn this $1.25 an hour job into $2.50 an hour job.\nDavid: You’re making money that’s worth it.\nNolan: Yeah. Because of the commision thing, I was breaking all the records.\nDavid: The game, is this Skee-Ball?\nNolan: Skee-Ball, guess your weight, knock the milk bottles down, get the ball to stay in the basket.\nBen: Where did you make the most money on? What were people just couldn't keep themselves away from?\nNolan: A game called tip them over. It was a softball and it was a one throw.\nDavid: You always think that you can knock them over.\nNolan: You can but it's really hard. But it's perfect for marketing strategy because the way the games work is you were supposed to give away $1 for every $3 that you made. You are to run your booth that at 33⅓% merchandise percentage. The way the bottles worked, there were two heavies and two lights, and the two heavies were on the bottom and the two lights are on the top, unless you wanted to give an animal away, then you'd put the heavies on the top and the lights on the bottom, and then a small breeze would knock them down.\nWe had a dance hall in a concert venue and people would come down with dates to go see the beach boys or what have you. The high school kids would come in clusters and there'd be the captain of the football team, the head cheerleader, the tight end, and one of the other cheerleaders. Then there'd be Nathan…\nBen: Someone like us in high school?\nNolan: Nathan, the waterboy.\nDavid: I was captain of my high school football team.\nBen: That's great, I was definitely not, I was at Chuck E. Cheese.\nNolan: Anyway, what I did was when it came time for Nathan the waterboy to throw, I'd set a snack and he'd win one for marrying the librarian, his date.\nBen: We are so grateful for you.\nNolan: It would turn the world view of the head of the football team upside down. I could extract all the money he had because he wasn't going to let go of the head cheerleader to go without a stuffed animal.\nBen: That's spectacular.\nNolan: It was diabolical.\nDavid: I'm envisioning the Pong marketing strategy in the future and buyers here, but was it after that summer then that you transferred to the University of Utah?\nNolan: Yeah. What happened was there was actually a gap year when I went to work for Litton industries in aerospace and in a clean room doing guidance systems and things like that.\nDavid: You were studying engineering at Utah State.\nNolan: Correct. Then, when I was in the fraternity house, I decided the engineering took too much homework and I transferred over to philosophy, then to economics, and then mathematics. It was just really about being able to screw around and not do so much homework.\nBen: Yeah, I can imagine. From taking that job over the summer, did you briefly consider having a traditional career path? Were you toying with the idea of, “I'll go do this internship that most of my engineering classmates are doing”? Why would you go spend your time on that?\nNolan: First of all, I got into it. I liked the carny life. It does get into your bloodstream.\nBen: Yeah, I bet.\nNolan: But when they made me the manager of the department because I was good at it and one of the guys who was the manager, quit, I was chosen to be the manager. I had 150 kids working for me and I'm 20 years old. I had to train them and manage the labor percentages, train, and set-up things. I started changing the games to increase revenue. A lot of times, when the park was packed, we were undergamed. The faster you could get a cycle time, the more money you can make. Then like in guess your weight, I get four of the hottest girls I could find to guess your weight and all four of them could be kept totally busy. All of a sudden, the record for guess your weight jumped by a factor of four on that day, stuff like that.\nThe Lagoon had the highest per cap of any amusement park in the nation. When I got ready to graduate from college, I actually had offers from all over. I had from Great America and things like that where I could have stayed in the amusement park game business at significantly more money than I could have gotten as an associate engineer. But I said, “Hey, I've got that legacy that's evergreen. My engineering degree is not going to be that way. I need some experience.”\nDavid: Let's talk about that when you get to the University of Utah. The University of Utah at this time is an amazing place in pioneering computer science, and in particular, computer graphics.\nNolan: Exactly. Four places in the world: Stanford AI project, MIT, Champaign Urbana, and the University of Utah which doesn't belong, but it was really Dr. Evans, the guy who later founded Evans & Sutherland.\nDavid: Yeah, and for listeners too, some of the other people who were there around this time, Alan Kay was there, John Warnock who founded Adobe, Jim Clark who would co-found Netscape with Marc Andreessen, and then of course, Ed Catmull. I have to ask. Was Ed there at the same time that you were?\nNolan: He was. We were called the Utah guys. I always thought that I was the cheap and dirty guy because I was doing games, all these guys were doing great check.\nBen: You say you were called the Utah guys. Did you have a sense at the time that this place and this group of people are a special primordial soup of what would become the foundations of the technology industry or were you like, “Ah, these people seem smart, I feel smart but dirty and this carny.”\nNolan: Not a clue. I had no idea that it was going to be prescient.\nDavid: It's pretty amazing that you spend all this time when you're going up, but it's all three of these things. It's your entrepreneurial instincts, you learn management running the amusement park, and then this incredible engineering and graphics environment that you're in at Utah. All of those. We'll talk in a second about what comes next.\nNolan: I've often said that my life has been a series of happy mistakes or serendipity. To add to that, when I went to California and worked for Ampex, I was in the video file station.\nDavid: Ampex made recording equipment for Hollywood and the music industry.\nNolan: Exactly. What I learned there was really polishing my digital skills and my video skills. We had the big computers, I learned how to program. The computers we were working on had a clock speed of 750 kHz. The screens that were on the computers were all vector graphics because raster scan wants 3.58 MHz of data. If your computers are going at 750 kHz, now they had a wide address space, 64 bits so you could do some serious calculations but they weren't fast at all.\nDavid: Yeah, the ball on the screen or the Space Invaders weren't going to move very fast.\nNolan: What would happen is, remember that the early video games were not Von Neumann architecture, they were basically complex signal generators.\nDavid: You played Spacewar back at Utah, right?\nNolan: Correct.\nDavid: Spacewar was the first game ever built for a computer.\nNolan: Absolutely. I stand on the shoulders of Steve Russell who did that as the MIT hobby railroad division and he did that on a PDP-1.\nDavid: How did it get traded around and end up at Utah and other places around the country? It wasn't like you could just download it off the internet.\nNolan: It was a Digital Equipment, basically thought it was a cool hack and just shipped it with every computer they sold.\nDavid: Oh, wow, cool. Were these mini-computers or were these mainframes?\nNolan: The one that we've used was a PDP-8 and a PDP-10. Utah never had a PDP-1 which is what the original source code was.\nDavid: Wow. They shipped it, it was like the Solitaire.\nNolan: Yeah.\nDavid: Wow, with Spacewar, that's incredible.\nBen: Was it the first time that you saw Spacewar that you really realized what could be possible in creating this next generation of games?\nNolan: Managing the games department, I had a couple of arcades. I knew intimately what a coin-operated game cost and what it had to earn. I said, “If I had this screen with a coin slot, it had earned a lot of money. But then you divide 25 cents for 3 minutes into a half a million dollar or a million-dollar computer, the math didn’t work.\nBen: Right. You're never going to recover the cost of the machine itself.\nNolan: But I went through the math and I said, “Maybe someday.”\nDavid: Yeah, when you arrived at Ampex, this was shortly after Fairchild had gotten set up and National Semiconductor—which we talked about on the Sequoia episode—then pioneered outsourcing fabrication of chips to Asia. That dropped the price of chips hugely, right?\nNolan: Yeah. One day, I can remember seeing my office at Ampex and glue chips, there was a thing called 7400 series from TI in the 9300 series, they were basically glue parts, flip-flops, and or gates, exclusive or, all the boolean constructs, and they went from $2 a chip to 15 cents a chip. It was that precipitous, two orders of magnitude, and I said, “Maybe now this is going to work.”\nBen: Getting close.\nNolan: Yeah. Coincidentally, that Wednesday night, in the Bay Area I became a Go player.\nDavid: I knew we were going to get into Go, Go being the game Go.\nNolan: Yeah, the game Go, and there was a Buddhist church in San Francisco that had a 24/7 Go parlor. I could just go up there.\nDavid: This was 1970?\nNolan: This was 1968. I would go up probably eight o'clock on a Sunday morning and I’d play until 3:00 or 4:00, and every weekend that was my go-to. But I was living in Santa Clara, California at the time and additionally, Stanford had a Go Club that met every Wednesday evening and I'd attend that. I got to play with a couple of the Go players there. One of the guys was named Jim Stein, who was a graduate student working at the Stanford AI Lab. After we played Go one time, he says, “Hey, do you want to play Spacewar?” I said, “Holy [...], I haven't played it since I was in college. Let's do that.” We left the Stanford Go Club, probably, 10 o'clock and we went up to the AI Lab and played Spacewar probably until 3 o’clock or 4 o’clock. My wife was not amused.\nDavid: I’m sure you’ve heard this many times, but when I was in college, Ben, I'm sure when you were in college, this is what you do at night. You get back from dinner at the dining hall and be like, “All right, we're going to play Mario Kart until 4:00 in the morning or we’re going to play Halo.”\nBen: Yeah.\nNolan: Yeah, exactly.\nDavid: You were the first generation that was doing this.\nNolan: Yeah. Those two situations, the drop in the chip price and my reacquaintance with Spacewar were concomitantly the driver that said, “Let's do this now.”\nBen: For folks that know of Atari, they're probably imagining the 2600 or they're imagining, at the very least, something they're playing at their homes, that's not how it started.\nNolan: No, it started as a coin-operated game business.\nDavid: It started as Syzygy, right?\nNolan: Correct.\nBen: You can't correct Nolan, David. He knows how it started.\nDavid: I’m just playing it wasn't Atari yet.\nNolan: The original plan was that we were going to be a studio and we would design games for manufacturers and get a royalty. That was the original plan. We got some things moving around on the screen. I went to the dentist and told him about my project, he says, “How you should call this guy which was the head of marketing for Nutting Associates” I didn't even know they were in town.\nDavid: They were a coin-operated game manufacturer.\nNolan: In Mountain View. I went up and showed them the game and they said, “Yeah, I think we'd be willing to license this, but we don't have a chief engineer now and I don't think that the one we had would understand this technology, are you available?” I said, “I don’t know. I'm pretty expensive.”\nBen: Of course, you did.\nNolan: I sound like such a carny, don't I?\nDavid: This is great. Also, I had in my notes we didn't cover. The people that were starting companies that we talked about on part one of the Sequoia episode, this time like the trader saved, these are hardcore scientist engineering types.\nNolan: Usually in their 40s, none on their 20s.\nDavid: You're the first, I think, real hacker-type entrepreneur.\nNolan: I think so, yeah. I've often said that I blazed the trail for both Gates and Jobs, just proving that it could be done.\nDavid: Yeah, because they didn't look like Gordon Moore or Bob Noyce.\nBen: It's like the five-minute mile problem where people say, “It can't be done,” and then someone does it, then suddenly, there's this massive wave after them of people that are awoken to that the world is accepting of young brilliant 20-something CEOs, and boom, we have this wave of them.\nNolan: No question about it, yeah. But I got to finish my…\nBen: Yeah, please.\nDavid: You had set up Syzygy engineering, right?\nNolan: Yeah, and then I went to Nutting, I said I'm pretty expensive, and they said, “How much?” I was making $850 a month at Ampex, I said, “$1600.” They said yes too quickly. I said, “And a company car.” Now get this. I come home, I said, “I'm quitting the Ampex,” to my wife. She says, “Really? But it's such a good job,” and I said, “Yeah, but I'm making twice as much and I've got a company car.” “Well, I guess that's okay.”\nDavid: How did that turn into what will become Atari then?\nNolan: Silicon Valley has a couple of things going for it that are under-appreciated. One is that almost everybody knows intimately somebody that went off started something and made a gobsmacked full of money and they say, “I know that guy or that girl. I'm smarter than they are and I'm sitting here doing 9–5, and they're out making a lot of money. I can do it.”\nDavid: It's funny, I think I might have referred to this on the show before but I went to business school at Stanford many years after you were there, but I think that was one of the most powerful things is all these entrepreneurs would come talk to us, guests teach classes, be there for cases, do lunchtime events for us, and you just realize that they’re just people, too. There's nothing special about them.\nNolan: Yeah, but then I had a real advantage with Nutting because Nutting put the first Computer Space in. All of a sudden, you start noticing and saying, “These guys are bozos.”\nDavid: “They’re paying me $1600 a month, I have a company car, what do they do then?”\nNolan: They fired the head of sales because he was making too much money on commission.\nDavid: Now that is a real bozo move.\nNolan: That’s a really bozo move. When it came time for the next game, I said, “I really don't want to hang my star with these guys because they will underproduce, they’ll nickel and dime things.” My theory in life has always been, “Go big or go home.” When it came time for that, I said, “I'm going to have to leave and I will design your next game, but we'll do it under a contract.” Little be known to them, I'd already gotten a contract from Midway and Bally. I had two contracts to base on.\nDavid: That's great.\nBen: You were a game designer. Were you also the lead engineer on that first game with them?\nNolan: Yeah.\nBen: Okay.\nNolan: Yeah, I was the lead engineer. I basically did all the digital stuff.\nDavid: That was Computer Space, which was commercialized space war.\nNolan: Precisely. We come to the next chapter of total serendipity. My first engineer, Allan Alcorn was actually my tech and he was in a work-study program at Berkeley. He'd do six months on and then six months at Berkeley, and then six months as my tech. It turns out that Steve Bristow was his alternate. Both those guys, when Atari came along, Bristow became the head of engineering and Alcorn became the head of research.\nDavid: They were brilliant engineers.\nNolan: They were really good, but very different. Al was very much more rigorous. That was his brilliance and his downfall. He would interview 30 people and not find one that was acceptable.\nDavid: Is he the one who brought Steve Jobs to you?\nNolan: Yeah.\nDavid: He found one who was pretty good, although not an engineer, but we'll get there.\nNolan: But Bristow, if you said, “Okay, we need another 20 projects and we need it in the next 15 minutes,” he'd go out, he'd hire a bunch of people, he'd fire some, and what-have-you, he was a scrambler.\nBen: It'd be messy but it'd get done.\nNolan: It'd be messy but it'd get done, exactly. The first day that Al came to work for us and he thought…\nBen: And as being now this new company that was working a contract.\nNolan: With Ted Dabney, yeah. It was the same day that I'd heard about Magnavox showing a video game at a trade show up in Burlingame. I went up and I saw this thing and it was an analog piece of crap and I said, “Jeez, there's no competition here,” but I looked around and they were playing this ping-pong game and they were having fun with it. There were so many things wrong with it, there was no score, there was no sound.\nDavid: There's no score, who's going to play that?\nNolan: Not just that, after you hit the ball, you could change the dynamics of it by twisting a knob. You don't get to change the nature of the game. That’s just wrong on so many levels.\nDavid: It was analog, it was running on vacuum tubes?\nNolan: No, there's RC time constants. Basically, if you have a capacitor and a resistor, it'll change the voltage based on how fast it is and that gives you a delta-v.\nBen: It's incredible that the early video games were actually analog.\nNolan: Yeah. Ralph Baer’s designs were really important. In fact, the very first game that  predated Steve Russell's at MIT was an analog game played on an oscilloscope at the Brookhaven National Labs with a guy named William Higinbotham, in terms of full history disclosure here.\nDavid: Always building on the shoulders of giants.\nBen: You saw the Magnavox, you thought thing’s a piece of crap.\nNolan: Yeah, but I said, “Using our technology, maybe this would be a fun game,” but more than that, I needed a test project for Al because Computer Space was really complex and I thought, as a learning project, what you want to do is bite-size things down to get people to understand the tech. I described the game and I said, “That's your first project.”\nBen: And know design docker spec. It was like, “Here's how it's going to go.”\nNolan: Yeah, “This is the blackboard,” before whiteboards had been invented. I said, “You got to get it done in a few weeks because I think I can sell it to General Electric.” I might have told him I've got a deal with General Electric. I'll be damned if in two weeks he didn't have a working pong machine but it had some problems. For example, once you started playing it, it would go and it had, on the paddles, angle of incidence, angle reflection.\nBen: Yeah. I read something that this was Al's idea after what you drew and described that he thought, “It would be way more fun if we cut the paddle up into eight segments and then each segment, depending on how far away from the middle it was, actually affected the angle that it bounced off of the paddle.”\nNolan: Now that's very interesting because the way I remember it, I came up with that idea. I’m willing to give it to Al.\nDavid: Who came up with speeding the ball up as the play went on?\nNolan: Again, I think I did, but I'm not going to opine to it.\nBen: Which is another great mechanic because it means number one, you don't really get bored of it because you can't just keep it going forever.\nDavid: Yeah, actually ramping up the difficulty.\nBen: And two, if you're collecting coin drop, then that's going to speed up those games and you're getting more people flowing through.\nNolan: Precisely.\nDavid: Okay, before we get into what happened with this prototype, the name of the company, can you tell us how it became Atari?\nNolan: In those days, everything was snail mail. If you wanted to incorporate, the standard way to do it was to put five company names in case the first one wasn't available. Atari was actually number three.\nDavid: Oh, wow. Was one Syzygy?\nNolan: One was Syzygy, which was owned by a candle company in Mendocino.\nBen: This is with the State of California, you mail in and saying, “Hey, if these names are available, I want them.”\nNolan: Yeah, and to this day, I don't remember what number two was. But then number three came back Atari.\nDavid: What an amazing name, by the way, starts with A, which is great.\nNolan: It's funny, when we first got it back, we weren’t sure we liked it.\nDavid: Atari’s like the equivalent of checkmate in Go.\nNolan: Correct, yeah, check is probably a good thing.\nDavid: Close enough. You didn't like it at first or you weren't sure?\nNolan: Weren’t sure, which is really funny. I really believe, like Shakespeare says, “A rose by any other name,” over and over again, I've named a company that has not sounded right, two weeks in, it's the best name in the world.\nBen: Yeah. It's like how Phil Knight hated both calling the Nike Swoosh the Swoosh and the Swoosh itself, and now it's one of the top five most valuable brands in the world.\nNolan: Yeah, exactly.\nDavid: When this comes together with Pong, because the amazing Atari logo, which we’ll link to in the show notes if you don't have it etched into your memory as a child, is wonderful, it’s the A and the Pong paddles.\nBen: How did you come up with the logo? How did that come to be?\nNolan: That was done by George Opperman, who was a brilliant, brilliant graphic designer. I said, “We need a good bug for the company,” he came up with 10 and I said, “That one.”\nBen: Wow, truly today, one of the most iconic brands ever created, t-shirts everywhere and hats and you can't go a week without seeing the Atari somewhere in your life.\nNolan: It’s pretty and it’s optimistic. It's upward driving this.\nDavid: It was the paddles from Pong that inspired it, right?\nNolan: No.\nDavid: Oh, no.\nDavid: Now we have it from the man himself. You had this prototype of Al Alcorn's demo, prove-himself project and it turns out it was pretty fun.\nNolan: I thought to myself, my carnyness.\nDavid: Your carny instincts kicked in.\nBen: Maybe let's rebrand carny as incredibly entrepreneurial. We can keep saying carny on the show but we shouldn't deprecate this, this is a core personality trait of wildly-driven scrappy entrepreneurs.\nNolan: Yeah, I thought to myself, “Maybe I can get Bally to take this game and complete our contract six months in advance.”\nDavid: Because you weren't planning on this being the next game, this was just a test project.\nNolan: No, this was [...].\nBen: But if they're impressed and say, “Here's the game, let's see what they think.”\nNolan: Yeah. We built up two, and these were in wire wraps and they were going to put one on location and I got on the airplane with the other one under my arm with a modulator so I could hook it up to a local TV. I went to Bally and Midway and they were not impressed, because in the coin-op business, there had not been a single successful two-player only game.\nDavid: Yeah, there was no AI driving the other paddle at this point.\nBen: If there was just one person who wanted to play the game at the bar, it was going to be a non-starter.\nNolan: Which, in 20/20 hindsight, turned out to be brilliant because it gave a woman an ability to choose who she played with.\nDavid: The equivalent of, I assume at that time, women weren’t buying drinks for the men, but a woman could buy a game of Pong.\nNolan: Yeah, “I want to play Pong but I need a partner,” so she pulled somebody off a barstool. I've got five sons and I tell them all the time, I said, “Don't even think about this relationship that you can outthink a girl. They've got it all under control so much better than you do. So, just go with it.”\nBen: Wow. It introduced a completely new environment variable into the bar.\nNolan: It was also combinant with the hippie female empowerment, women are as good as men.\nDavid: This is 1972 when this has happened?\nNolan: This is 1972.\nDavid: Which I believe was the first class of women graduating from at least Ivy League colleges that were four full years there, I think it was 1972 was the first class.\nBen: Good timing.\nDavid: Yeah, great timing.\nNolan: But anyway, add to that the fact that women have better small muscle coordination than men do. Men have better large muscles, men can throw a ball better, that sort of thing, but women, they're always on the production line, stuffing boards, things like that because they've got better coordination with their hands. That's a skill that makes some good Pong players. The average woman could beat the average guy playing Pong. That was very enabling, very empowering. There was a five-foot, two blonde cuties that Pong hustled and was making $50,000 a year.\nBen: Like, “I bet I can beat you,” and some dude puffs up and says, “No, you can't,” and then she smokes him.\nNolan: Exactly. But remember, being a good hustler is you do this dance of win and loss and [...] and what have you.\nDavid: You have to let people just, if you're honorable, you have to let some people win or else nobody's going to play.\nNolan: Yeah, but I watched her one night and she was a maestro. She was just cute as a button, very vivacious, and what-have-you. She would come off a little bit as an airhead but not at all. It was not real, I just loved that. She was an entrepreneur in her own right.\nBen: Wow.\nDavid: Bally and Midway rejected this, but you see the potential.\nBen: What do you call it, a wire rig?\nNolan: Wire wrap.\nBen: Wire wrap, I’d imagine that's no cabinet, it's just the electronics, however many boards are in there, wires, and then you hook it up to whatever TV you can.\nNolan: Right. In the early days, when you were prototyping, there was a technology called wire wrap, which you'd had these pins sticking up and you had this machine that would really wrap a copper wire around it very tightly. It was a very good prototyping system. I don't think they use it anymore, I'm not sure.\nBen: Basically, you wouldn't have to solder but you could ensure that the wire is where going to be where you thought they were going to be on the chips?\nNolan: Precisely.\nBen: Got it.\nNolan: But when you look at it, it's like a rat’s nest. What happened is that when I presented it to Bally, they were tepid. They said, “Let me think about it.” When I called back to the plan, they told me about the earnings that it was making at the local bar.\nDavid: You would put a prototype in.\nNolan: Yeah.\nDavid: I heard conflicting sources, do you remember which bar it was?\nNolan: Andy Capp's.\nDavid: It’s Andy Capp's, it’s not the Dutch Goose.\nNolan: No, that was the prototype space for Computer Space, which was a false positive.\nDavid: I got to say about the Dutch Goose because I spent a lot of time there when I was at GSB.\nNolan: The Dutch goose was a hangout for a lot of Stanford students. Computer Space made a lot of money if you were a highly-educated clientele, made nothing in a beer bar with working-class.\nDavid: Probably because everybody at the Dutch Goose had been playing Spacewar back in the Labs.\nNolan: I think it had as much to do as Newton's second law because we did a lot of interviews and in order to stop or change direction, you had to rotate the rocket ship and then you apply thrust.\nBen: It's what would later be asteroids.\nNolan: Exactly.\nDavid: It wasn't intuitive for people that weren't raised on video games.\nNolan: Exactly. It was not intuitive at all. Action and reaction, Newton's second law just wasn't part of the DNA of a lot of the population. But anyway, back to Pong. When I heard how much it was, I called at Bally and I said, “Midway doesn't want it.”\nBen: How much money it was making at that bar?\nDavid: At Andy Capp’s.\nNolan: To put it in context, the game was making over $300 a week.\nDavid: That's like 3X what a normal game would make.\nNolan: Oh, yeah, and the bill of materials on the machine was $325. I said to myself, “There's a business here.”\nBen: There's a six-day payback on this, is it 50/50 with the bar? How does the revenue split?\nNolan: It’s 50/50 in those days.\nDavid: In two weeks, you’re making your money back.\nNolan: Two weeks, you’re making your money back.\nDavid: Did you charge the bars upfront? Did they have to pay for part of the machine upfront or was it just a revenue split?\nNolan: Revenue split, got to put it there. I said to myself, “Hey, if I can't sell these things, I can operate them and be okay.” I took all the money that we had in the bank and it was enough to build a dozen of them. Then from there, we got the money and we sold some because people started hearing that this game was doing well. We went up to the San Francisco distributor and he ordered 10 and the guy from Los Angeles ordered 10.\nBen: I'm curious what would the Bally and Midway deals have given you? Obviously, they take care of manufacturing because they would make the actual cabinets and hook it all up, did they also take care of distribution?\nNolan: Absolutely, they did everything.\nBen: You're then saying, “You know what? We're so confident in this thing, we're going to tell these guys, in a nice way and in a clever way, that we're going to do this ourselves.”\nNolan: No, I didn't say that we're going to do it ourselves, I said, “We'll go ahead and finish the project, the driving game that you wanted.”\nBen: Oh, I see.\nNolan: Which there's another chapter to this. Four months in, Bally came back to me and said, “We'd like to do Pong.”\nDavid: They already knew what a golden goose you had at that time.\nNolan: Yeah, and I said, “Oh, of course,” at this time, there were 20 companies that were copying us because we had a garage shop. Anybody that had a garage shop could knock these puppies out. In those days, it took four years to get a patent. We'd applied for it but we didn't have it, it was the Wild West. Bally was really noble. Instead of just knocking us off, they took a license and paid us a five percent royalty.\nBen: Wow. Stand up business practice right there.\nNolan: Stand up business, and completed our contract.\nDavid: Was it around this time that you started your experimental distribution channel of your own of Pizza Time Theatre within the company?\nNolan: No, you're talking about Kee Games, not Chuck E. Cheese.\nDavid: Either.\nNolan: There was the ball and paddle phase, then we went into what I call the game innovation phase of the company. I realized that in those days, the coin-op distribution network tended to be two, sometimes three in every major city. It was normal to have an exclusive relationship. I could pick all the best distributors. The ones didn't have an Atari deal, they were looking for anybody that they could put into business to compete with us, and I thought, “That's perilous.” I decided to create my own competition. I took the number two marketing guy, the number two engineering guy, and the number two manufacturing guys, and I had them leave en masse, set up a company across the street—it was actually another place—and it was just before a tradeshow. They had a game which was the next in line that we were going to produce, we let them put their name on it, we went to the tradeshow and they assigned their distribution contract with all the guys that we didn't have.\nDavid: That’s great.\nNolan: We had the world nailed.\nDavid: Wow, and that was Kee Games.\nNolan: That was Kee Games. In those days, there wasn't the internet and all that, but we knew that we couldn't keep it a secret forever. We floated the rumor that these guys had stolen trade secrets and that we were suing. Then, a couple of months later, we floated the idea that we settled and that now we owned a piece of Kee Games.\nBen: Did you own the entire thing from the get-go?\nNolan: The entire thing.\nDavid: Oh, that’s great.\nNolan: Then, the next step was we owned a piece and then we floated the thing that we'd actually gotten a control piece. Then we decided that we were going to merge the companies together.\nBen: Take a nice photo, shake hands, welcomed the…\nNolan: Then there was a question, “Distributors, what do you want? Should we take the thing away or should we give you both lines?”\nDavid: You changed the business practices in the industry because they didn't want to give this up.\nNolan: Yeah, now we gave both lines to both distributors.\nBen: Wow, you didn't have to have exclusivity with a distributor anymore?\nNolan: Bingo.\nBen: Amazing.\nDavid: That's so great.\nNolan: It's one of those things that in the coin-op business in 1975, we had an 80% market share, going from nowhere. We were undercapitalized and all that.\nBen: Give us a sense of how many cabinets you'd then manufactured from 1971 to 1975.\nNolan: Probably 300,000.\nDavid: Wow, and each of those earning roughly a couple hundred bucks a week.\nNolan: Correct.\nBen: How did you capitalize that or did you manage to get pre-orders and have a nice working capital cycle?\nNolan: Actually, the business model, I'm more proud of than the technology because I built this company, my partner and I put in $250 each, that's the only capital that went into the company until Don Valentine in 1975. What we did, I figured out just-in-time inventory. All the cost was in the cabinet, the TV set, the coin mech, and the power transformer. The glue parts for the computer and all that, it was a lot of numbers, but not a lot of [...] and value.\nDavid: They were 15 cents then.\nNolan: From the time a cabinet came on the floor, we'd have the TV set and all the other pieces come in all at the same time. We were turning inventory 28 times a year.\nDavid: Oh, wow. That's like Amazon levels.\nNolan: Exactly. We were able to essentially sell a product and have 60 days to pay for the merchandise [...] the company operated in positive cash flow.\nBen: Wow. What were the payment terms when you would deliver one of the units?\nNolan: Thirty days, but we'd give a 10% discount for five days. But then, we found this factoring company that would buy our receivables and I’d get immediate cash.\nDavid: Wow. You grew to millions of dollars a year on no capital.\nNolan: No capital.\nDavid: Wow.\nBen: Had you spoken with Don Valentine or any other investors?\nNolan: Venture capital hadn’t really been invented yet.\nDavid: Yeah, but Don invented it in a lot of ways.\nBen: From what I read, the sentiment around the time associated coin drop with mafia activity and gambling. People didn't want to be involved in investing in this mob-controlled or mob-perception industry.\nNolan: Correct. It was true. During the Prohibition, the mob provided illegal booze, illegal gambling, loan-sharking, and prostitution. When Prohibition was repealed, they still had their three [...]. Then the games modified. In the speakeasies, they had roulette, slot machines, and the whole nine yards, but when all of a sudden, the speakeasies emerged from underground, they could easily identify the slot machines. They started disguising them as a Pinball machines, but they were payout machines, they were gray areas.\nDavid: That's why Pinball had such a negative stigma, not because of Pinball, but because a lot of them were actually slot machines.\nNolan: They were disguised slot machines. The mechanism was these games that are called bingos, and essentially, you would try to get a bingo and if you got three in a row, you got a payout of 16, if you got 4 in a row, you got a payout of 64, and if you get 5 in a row, you got a payout of 100. These are dimes. If you had a great big win, you would go to the bartender and say, “I'd like to cash those out,” and he'd have a thing called a knockoff switch, which would take the credits down to zero and he'd give you money over the bar or in the bathroom if he knew you. But if he didn't know you, he’d just pointed the sign sitting on top of the things as for amusement only.\nBen: Amazing.\nDavid: Wow.\nNolan: It was really hard for the powers that be to enforce what was going on.\nDavid: Wow, the proto venture capital industry that we talked about, Arthur Rock and the folks that were, the Tommy Davis, they weren't going to... Did you even talk to them?\nNolan: I didn't know. I hadn't heard of venture capital. I was just young and dumb.\nDavid: How did you and Don intersect then?\nNolan: He came to visit me. He found me, I didn't find him. At that point in time, we were in 6 buildings and we were up about $30 million in sales.\nBen: This is 1974, early 1975, somewhere in there.\nNolan: Yeah. We were getting to be big [...] in the Valley.\nDavid: Wow, and he had just set up Sequoia Capital, taking it independent from Capital Group.\nNolan: No, get this. He says, “Can I see your business plan?”\nBen: Oh, listeners, I wish you could see the face Nolan just made.\nDavid: Business plan?\nNolan: We had no business plan. I'd been around this thing by the seat of my pants and he says, “I'll set you up with a guy that can write your business plan for you because I need it for an investment because I like your business.” I spent a few hours a day for several days with this guy named Don Yost who wrote the business plan for Atari, the very first one we ever had.\nDavid: When you're already doing $30 million in sales.\nNolan: Yeah, I know.\nBen: Wild, wild.\nNolan: Different world.\nDavid: When Don first approached you, was it called Sequoia Capital at that point yet?\nNolan: Yes.\nDavid: Okay, he had fully spun out from Capital Group. How did a deal get done? How did you broach the conversation between the two of you of accepting capital to a business that had never had capital before?\nNolan: To get the right patina on this, we had the summer of discontent. I told you how we operated in positive cash flow, that's all fine and good, until you fill up your production line with products that you can't sell because there's a part that's missing.\nBen: What happened there?\nNolan: We almost went out of business.\nDavid: Don may or may not have withheld the part, though.\nNolan: There was a chip that we needed to get and it was on backlog for three months. One month in, we were way behind on our payments. We got sued and three months in, all of a sudden, we didn't defend ourselves because we owed them money and we had these judgments against us. There were sheriffs on our front door coming to collect the assets. What they really want to do is collect it from your bank account, they didn't want your chairs, tables, and stuff. What we did is we opened up bank accounts all over the nation. Every week, we’d use a different checking account to pay our people.\nBen: Wow.\nDavid: Wow, oh my goodness.\nBen: Because you're trying to keep the doors open, you're trying to stay in business, you think this will get resolved, and you want to keep your great people.\nDavid: You knew you have a great business too.\nBen: Was it in this really tumultuous time when you did the deal with Don then?\nNolan: Yeah, we were damaged. I did a reorganization with all my creditors and basically, I said, “If you want 100 cents on the dollar, you got to give me 6 months. If you want 50 cents on the dollar, I'll pay you in 2 months. If you want cash right now, I'll give you 10 cents on the dollar.” Then I said, “If you sue me, you'll never get an order from me again in our line.” Then to get the line going again, I went to Jerry Sanders from AMD and I said, “We've just been cut off because of credit hold,” but I laid out what the options and terms was, and I said, “I need a $50,000 credit line for your parts. If you give that to me, you'll be my preferred vendor from now on.”\nDavid: Who were using for chips before?\nNolan: Fairchild and TI. They were just jerks. Jerry said, “Okay.” It probably was worth $50 million to AMD to be the prime supplier for Atari.\nBen: Pretty good okay.\nNolan: Very good okay. We've been good friends since, good guy.\nBen: Oh, that’s great. My understanding from doing a little bit of research before was that you effectively came to terms on what the investment would be from Sequoia during the time of tumult and before the AMD agreement. But, of course, you hadn't closed yet and maybe a month or a few more months go by and you're getting ready to close the deal.\nNolan: We've gotten much healthier, all the things that we've done. We fixed up things that we were shipping, and all of a sudden we weren't under stress again. It became time to close. That night I said to Joe, the president, “I can't do this, this is not the right deal.” Don had champagne iced up in his trunk and he came out and I said, “Sorry, the price isn't right. This is the condition when I agreed to this, this is the condition now, the price is double.”\nBen: Double.\nNolan: Double.\nDavid: Wow. How did he react?\nNolan: Oh, he was pissed, but I was willing to walk away.\nDavid: Because you didn't need the capital anymore.\nNolan: I didn't need the capital anymore. Two days later, he came back and he said, “Okay.”\nBen: Wow.\nDavid: Wow. What a story for the first investment.\nNolan: My relationship with Don was always a little bit love-hate.\nBen: I could see that.\nNolan: You don't dick with Don Valentine that way.\nBen: I've heard then that board meetings could take place in hot tubs. Can you describe the Atari culture at this point? We talked about you as the first hacker archetype as a CEO. I don't know if you call yourself a CEO, president, founder.\nNolan: CEO.\nBen: Okay, what was the company like and how is it different than other companies?\nNolan: I think to understand that clearly, you need to understand what was going on at the time. We all had our hippie costumes that we dress up in our bell-bottoms and our tie-dye shirts and go up to San Francisco and be posers.\nDavid: Because you guys were engineers.\nNolan: We were engineers but sometimes, it was fun to go up there. There was this ethic, the Summer of Love and all that, don't trust anyone over 30, smash the state, and all that, but what really was, it was an idea that you treat everyone fairly not based on history, not based on legacy, not based on who you were, and what you came, but what your soul was, what your capabilities were. We actually created this company manifesto or a constitution and we encapsulated equal pay for equal work, the very first one in Silicon Valley.\nWe had some amazing women that worked for us that just loved the whole idea that we had this manifesto. We had a very, very, I don't want to say libertine, but we would have board meetings in the hot tub and in hot tubs, in the 70s, it was an excuse to get naked at the end of a party. Nobody wore swimsuits in a hot tub and it was just normal. We didn't think anything about it. That's just what it was. In fact, when we did our new headquarters, the engineering building, he had a hot tub that was there.\nOne of the standard interviewing tactics, when you'd get an engineering person to come in, that was really talented and you take them past the receptionist who was always a really hot girl, you'd walk past the hot tub and they'd say, “Oh, you should have seen Jennifer at the Christmas party in the hot tub.”\nDavid: Wow, a different time.\nNolan: A different time. I'd be in jail for 100 years on some of that stuff.\nDavid: Speaking of the culture and the time, this must have been right around the time when this guy shows up at your office.\nNolan: Yeah, Jobs. Unkempt, dirty.\nDavid: Yeah, he just walked in one day.\nNolan: And said he's not going to leave until he has gotten a job.\nDavid: You guys have become pretty big in the Valley or well-known at this point. This is Steve Jobs, of course. Did he want to work at Atari because he'd heard about Atari and heard about the culture?\nNolan: Yeah, absolutely. He liked the idea that we were doing something that wasn't bombs, wasn't military, and by being in the game business, we actually had a real advantage because a lot of the businesses had some military outlook. If you were a foreign national, a lot of times, you couldn't work for those companies. We had our pick of the crop. The Brits at the time had just wonderful engineers, Germans, and what-have-you from all over the world.\nBen: Yeah, and you had that unique recruiting advantage.\nNolan: Precisely.\nDavid: Not to mention, you're in the Bay Area, Vietnam had probably just ended at this point.\nNolan: Yeah, pretty much.\nDavid: I'm sure there are a lot of people in the Bay Area at this moment in history who were none too keen to be working for companies that were selling to militaries.\nNolan: It was very interesting. When we were building the 2600—I'm going forward a little bit—we actually had over 100 Nguyens working for us. They were Vietnamese boat people and they all had the same name. To deal with it, we had Nguyen One, Nguyen Two, Nguyen Three, Nguyen Four.\nDavid: No way.\nNolan: But the thing that was interesting to see is that the Americans that were there, in our cafeteria, we'd have games on the side and what-have-you, all the Nguyens would have a thermos of tea, a bunch of rice, and what-have-you and they'd be studying their English book. A year later, none of them were there.\nBen: Why was that?\nNolan: They've gone to bigger and better things. It’s a minimum wage job.\nBen: Fascinating. I'm sure you've spoken many times about your experience with Steve Jobs and Steve Wozniak. You are one of the very few people in the world that were ever either of their boss. How did that go? How were they as young budding talent? What are some of the things that they did together at Atari?\nNolan: I want to clear up this, Wozniak never worked for me. He was always working at HP. I put Steve Jobs on the night shift because I knew Woz would hang out with him.\nDavid: Ever the entrepreneurial instincts.\nNolan: I called it getting to Steves for the price of one.\nDavid: You got an advisor.\nNolan: Woz is and was a true savant. I think actually Woz doesn't get enough credit for the success of Apple because he could design discrete logic chips. He did the Apple II as a design construct. It was brilliant. It was the most efficient articulation that you could probably have. Before that, there was this company called IMSAI who did a single chip micro thing, twice as many parts as the Apple II. When it came time to connect a disk drive up to the Apple II, it was about the same time that the Atari 800 was on the market and both of us saw that floppy disks were a cool thing, much better than a cassette tape. Woz did an all nighter two nights in a row, developed the drivers and the hardware to interface this floppy disk drive to the Apple II. It took Atari seven months and we had some smart people.\nDavid: Wow.\nBen: Wow.\nNolan: Those sorts of things, for me, just gives me tremendous respect for the man's capability. We had a deal where the engineers at Atari could bid on the projects. We gave him a game list. Since we'd give a little bit of royalty to the engineers, they only wanted to work on ones that they liked. I came up with this game called Breakout and nobody wanted it.\nBen: Quiet success out in the world Breakout.\nNolan: The perception was that ball and paddle games were over, and this was a ball and paddle game with a twist.\nBen: What year was that?\nNolan: 1974.\nBen: Okay, two to three years after the amazing success of Pong?\nNolan: Right.\nBen: Got it.\nNolan: It might have been 1975, I'm not sure.\nDavid: But there’d never been a single-player Pong?\nNolan: No. It turns out that Breakout was actually the game that launched the Japanese market.\nBen: For video games at all.\nNolan: Yeah. Pong didn't go because in Japan, the homes are small. The culture doesn't have kids going home with their friends to play a game, that's why karaoke was important because that was a way to, after school, hang out with your buddies, you'd go and you’d spend a few yen and get a karaoke suite.\nBen: And at this point in 1974–1975, Atari had just started shipping home consoles.\nNolan: 1975–1976.\nBen: Got it.\nDavid: The VCS that became the 2600 that so many of us had.\nBen: My understanding was you were the game designer and visionary behind Breakout, this was a game that you really come up with a concept for and you put it on this list for different people to bid on, how does it go from there?\nNolan: They didn't want to do it. I put Steve on the night shift and assigned it to him.\nBen: This is Jobs because he's the only one that works for you.\nNolan: I knew that he wouldn't do it, but Woz would.\nDavid: Amazing. Woz is not an employee of Atari, he's just hanging out with Jobs at night.\nBen: How's the IP work on that?\nNolan: They were employees, who knew?\nBen: Crazy.\nDavid: Wow. Woz does all the technical design of Breakout.\nNolan: Yeah. Now, I did a deal where they got a bonus based on how fewer chips they could use.\nBen: Yeah, I read something about this, that the cabinet's typically had 75 plus boards in them but it would save Atari $100,000 if he could remove each chip.\nNolan: That's absolutely true. Woz’s design was 40 chips. It was unheard of, but it had feedback systems that made it really hard to test. Once the game was done and everybody could see that it was fun, they did [...], but I paid the bonus based on the number of chips that came back which was $5000. That was a lot of money in those days.\nSubsequently, Woz was over to the house and we were talking about Breakout and what-have-you and I said, “What did you do with your half of the money?” He says, “I went out to dinner.” I said, “That's some dinner.” He said, “What do you mean?” I said, “I figured you probably ended up with $2500.” He said, “Jobs did it to me again. Jobs told me it was $500 and he got $250.”\nBen: Wow, and this is before they started Apple together?\nNolan: Oh, no, no. This is after. This is a long time after. Woz said, “You know? I really don't care. Because of Jobs, I've made a lot of money much more than I ever thought I would at that. He must have had a better need for it than I did.”\nBen: Wow. What a feeling guy.\nDavid: Yeah. Did Jobs come and tell you that he was going to leave Atari and go start Apple? How did that happen?\nNolan: He asked me to be his first investor, $50,000 for a third of Apple and I just said no, which I've regretted.\nDavid: That's okay. Don made a mistake with Apple, too.\nNolan: It was really a thing where I actually think if I said yes, the world may have been a slightly different place because Mike Markkula who did the first investment was also a very hands-on mentor and he basically turned Jobs into a naturally acceptable CEO that I probably wouldn't have done.\nBen: Yeah, I think I've heard you refer to him as a Ho-Chi-Minh-looking guy.\nNolan: Yeah. Remember, Markkula was the first president of Apple, too.\nDavid: Yeah. Markkula has worked for Don Valentine, right?\nNolan: Correct.\nDavid: The story is that Don sent Markkula over to talk to Steve.\nNolan: I sent Steve to Don, Don sent Steve to Markkula.\nDavid: Wow, it's like Pong.\nBen: David, can you just catch us up on the timeline moving through the mid-70s, what happens in 1975, 1976, and let's get to what the next financing would look like for Atari as a company.\nDavid: Sequoia and Don invested in 1975, then in 1976, you ended up selling the company. How did that happen? You sold it to Warner Communications.\nNolan: We were far down the design path of the 2600. We knew that we had to: (1) build a new factory, (2) that it was going to be a highly driven by fourth-quarter sales. We just knew that we didn't have enough capital. We started down the path of taking Atari public. We had an S1 drafted up and everything and then the market did a hiccup, he said, “Maybe not.” We went down, we said, “Okay, we'll see if we can get a corporate partner.”\nWhen we started down that path, Don says, “Hey, why don't you go talk to Warner people?” The Warner people came out and said, “That's interesting, and what have you, and maybe what we can do is we can do a structure where we buy it and you guys make all the money and do all the stuff.” We were young and dumb, I had a lot of hate coming out of my shirt, what have you. They send the Warner corporate jet to pick us up at the San Jose Airport and we climb on board and, of course, just to really do starstruck, they stopped in Sun Valley and picked up Clint Eastwood and Sondra Locke.\nBen: What? On the jet?\nNolan: On the jet. We're flying to New York on the Warner jet with Clint and his girlfriend.\nDavid: Wow.\nBen: That didn't come up in any of the research.\nNolan: Oh, really?\nBen: No.\nNolan: Then, we get picked up at the airport and when a limo drops us off at the Waldorf Astoria side entrance, that's where the VIPs go, we go up and we're in a suite of rooms that has a library, a pool room, and the kitchen. It's basically a 5000 square foot apartment that we're in.\nDavid: It's the Warner corporate apartment.\nNolan: Yeah. All three of us Joe, Gene Lipkin, and myself, we're there. You realize you're being played a little bit, but you don't mind it because it’s cool.\nBen: There is something very nice about getting sold to by someone who is an excellent salesperson.\nNolan: Exactly. Next morning, we meet for breakfast and go into Warner's conference room and we start talking about deals, the deal structures, and what have you.\nBen: Can you give us a sense for the size of Atari's business at this point? Revenue, profit, or anything.\nNolan: Probably close to $40 million, $45.\nBen: In revenue?\nNolan: In revenue.\nDavid: But this is all in the arcade business and you're about to enter…\nNolan: No, we were doing Home Pong.\nDavid: Okay, you’re doing Home Pong but not the 2600 yet?\nNolan: Correct.\nDavid: Got it. I didn't realize actually that you had marketed Home single-game consoles.\nBen: Oh, yeah. There were two big dials that you grab and each player would twist them to move the paddle.\nNolan: Yeah. Anyway, we’ve gotten to a few sticking points, what have you, hadn't quite shaken hands. We were invited over to Steve Ross's for dinner. He has a Fifth Avenue apartment on the top floor, top three floors and, of course, there was a screening of The Outlaw Josey Wales for Clint and Sondra.\nBen: Amazing.\nDavid: Wow. Talk about being sold to.\nNolan: Yeah, exactly. Like this life. At the end of the day, we shook hands on a proposed deal.\nBen: Wow. That, if I read correctly, was a $28 million all-cash offer to the shareholders of Atari.\nNolan: It wasn't all cash, there were some ventures involved. That was done as much for tax reasons as anything, you wouldn't have to pay tax on all at once, it’s cheaper. But in addition to that, there was a huge payout. There was a 10% bonus pool. Personally, we'd get a big taste of the success of Atari.\nDavid: Oh, like an earn out.\nNolan: Correct.\nDavid: Oh, wow, this was before startups learned that big companies always structure the earn-outs in their favor.\nNolan: Oh, yeah, do they ever.\nDavid: You wrote the playbook in so many ways.\nBen: Which of those ended up being more meaningful to you? The bonus pools or the actual one-time transaction?\nNolan: That's actually hard to say because what I ended up doing is I hypothecated the bonus pool to get additional capital for Chuck E. Cheese.\nBen: This is an excellent lead-in. A few of us who had looked into this before knew that you are also the founder of Chuck E. Cheese. The first time you learned that, your mind’s blown and you got Tweety Bird spinning around your head. The thing that I didn't know until really diving in is you started Chuck E. Cheese as a part of Atari and then bought it from Warner to spin it back out.\nNolan: Correct.\nBen: Take us through that.\nNolan: The idea before Warner was there, was I felt we were selling these coin-operated games for $2000 and in their life, they do $30,000 to $50,000 in coin drop. It didn't take rocket science staying on the wrong side of this transaction, but I didn't want to compete with the operators that were putting them in bars and restaurants and I didn't want to compete for locations for arcades, malls, and what-have-you. I said, “I'm going to have to create my own location. If I'm going to be building a big arcade, what's my best draw? We've got to have food and what the food needs to be is pizza because there's a wait time. Ideal time for...”\nDavid: Ideal time to go play the game while you're waiting for the pizza.\nNolan: Yeah. The most successful pizza parlor in the Bay Area was a thing called Pizza and Pipes where they had a deconstructed Wurlitzer theater organ all over the place. There would be an organist and you’d see the drums going, and they put lights on the various things, it was a show. I thought to myself, “Okay, I can do something like this.”\nIt turns out that I was going to take my daughters to Disneyland. I was trying to get some ideas about what I could do that wasn't a Wurlitzer theater organ but had the same marketing. We went to the Tiki Room and I said, “Oh, my engineers can do this and we can replicate it till the cows come home.” That became the working prototype for Chuck E. Cheese in terms of concept. We literally opened the first one three weeks after we closed the Warner deal.\nBen: Wow.\nDavid: Was it in San Jose?\nNolan: It was in San Jose. It was in an old brokerage house, it was 5000 square feet. The day we opened, we knew it was too small. The typical pizza parlor was a 500 square feet, maybe 1000 and this was 5000 and yet it was way too small.\nBen: Wow.\nDavid: My memories of Chuck E. Cheese are the whole elaborate system with the tickets, the prizes.\nBen: All the animatronics, the show as half an hour.\nDavid: Was that all there in the beginning?\nNolan: Most of it. I always felt that the right way to market it was we would survey the cost of a large pizza, we then up that by 15%, and then give tokens that if valued at 25 cents would look we were 15% to 20% cheaper.\nBen: You would just bundle in effectively some starter gameplay with the pizza.\nNolan: Exactly. What that also does is there's this perception of cost, giving stuff away is good, and every restaurant has a problem with Tuesdays. We had 50 token Tuesdays, with the large pizza, you’ll get 50 tokens. All of a sudden, we turn Tuesdays into one of our best nights, and the thing that was crazy about it, we could give away 50 tokens and the game revenue would actually still go up.\nDavid: Because people would just play more games.\nNolan: Yeah.\nBen: Was Atari creating the games that were in Chuck E. Cheese then?\nNolan: Partially. We would buy from anybody, we bought ski balls and things like that from others, but it was off to the races. Do you want me to tell you the deal I got from Warner?\nBen: Desperately, yeah.\nNolan: I was talking about expanding it at a budget meeting and they said, “I don't think we want that.” I said, “Really? It's a really good business, I'll buy it.” They said, “How much do you want to pay?” I said, “I don't know. I really have to work at this.”\nBen: The carny wheels are turning.\nNolan: I got it for $500,000. $100,000 a year for 5 years.\nBen: Oh, they let you pay it over five years, no interest?\nNolan: No interest.\nDavid: Wow, and how many locations did you have at that point?\nNolan: Just one.\nDavid: Oh, just one, okay.\nNolan: But that one threw off $700,000 of cash flow annually.\nDavid: You assume the corporate finance department at Warner didn't give this whatsoever.\nBen: They clearly just didn't believe in it.\nNolan: They didn't believe in it.\nBen: Also, you were just the king of payback periods and cash flows.\nNolan: Exactly. When you don't have cash, you got to think that way.\nBen: Yeah. What year is this that you buy it for a $500,000?\nNolan: 1977.\nBen: 1977, or at least it's the year that you start five payments of $100,000. That's in 1977, over the next, I don't know, decade, decade and a half, Chuck E. Cheese has close to 300 locations that you've opened?\nNolan: 250. 125 company stores, 125 franchises and sold it to Brock Hotel.\nBen: What did that transaction look like?\nNolan: It was a bad deal for me. I'd taken the company public. I made more money on Chuck E. Cheese than I did on Atari, but I did it through selling of stock going on. 1983 was when the video games kind of did and Chuck E. Cheese was hit by that a little bit. I had hired a new president of Chuck E. Cheese and started really seriously campaigning his sailboat, i.e., screwing off. I might add in 1977, I got married again. Once I had sold the company to Atari, it took a little bit of the fire out of my belly.\nBen: Sold Atari to Warner.\nNolan: Yeah. I got married, I'm spending a lot of time wooing and wedding my bride and then we'd hang out, got a big house, and did a remodel, and all the stuff you do when you have a lot of cash. When I was campaigning the sailboat, I won the Transpac Newport to Hawaii in 1983.\nBen: That's a big sailboat race. You're talking to someone who’s not a big...\nNolan: No.\nBen: This is a very well-known...\nNolan: Very well known, it's basically longer running the America's Cup, but it's considered to be not quite America's Cup because it's mostly downhill.\nBen: What is it? The wind is always at your back or something?\nNolan: Yeah, exactly. You want a boat that has a very flat bottom, we can get up and surf, you fly spinnakers all day long but it doesn't point upwind at all. The America's Cup, you have to be in all-around boat instead of what they call, Transpac competitors are called sleds. But anyway, I won it in 1983.\nBen: Congratulations.\nNolan: The minute I hit the land, I get this call, “We're going to miss our projections and lose money in the third quarter.”\nDavid: You're a public company at this point.\nNolan: We’re a public company. What happens is when you lose money, I had a couple of lines of credit out there and that violates covenants. It just starts to create a [...] storm. I had to get out of that, I ended up selling. Not for a lot of money, but it's okay.\nDavid: You've started so many companies in the years since and continue to, but there was one more company we want to talk about before we move on to acquisition category here that came out of Chuck E. Cheese that you ended up selling to George Lucas. Can you tell us a little bit about that?\nNolan: Yeah, I had a project called Kadabrascope. What I wanted to do is create computer-aided animation and I felt that doing tweens and things like that, the technology was good enough. We created some pretty good software, but the computers were so crappy in those days, it was taking 48 hours to render a complete frame, and half the time the computer would bomb before it finished. If you got one frame week, you’re really rocking. This was with a back 780 which was the go-fast scientific computer at the time.\nDavid: These frames are 640x480?\nNolan: They were 640x480.\nDavid: One a week.\nNolan: One a week, and there's not a business there.\nDavid: Imagine Toy Story at one frame a week.\nBen: I'll imagine it in 2065.\nNolan: I ended up selling my software to George Lucas when Chuck E got into trouble. I was scrambling for cash. In some ways, I like to joke and say, “I founded Pixar technically,” but George Lucas took it and did it. While at Kadabrascope…\nDavid: It was the name of the technology that you were using.\nNolan: Yeah, I showed Steve Jobs. He came over and he was very fascinated. I told him about some of the problems we’re having. He came to me when he was offered Pixar.\nBen: From George Lucas.\nNolan: Yeah, and I said, “The big key is render time. If you can solve the render time problem, it's a good deal.” What I hadn't realized is he'd figured out how to do a render farm where you basically atomize the problem and get a whole bunch of different computers to work on it. That was the first render farm that ever existed.\nBen: Wow.\nDavid: Wow, that's so cool.\nBen: There's a fun Acquired history, too, because Pixar was our first episode. I think we dove in the research and we were excited to find out that Steve Jobs, Pixar came from George Lucas at Lucasfilm and what a cool story that was, and here we are 100 episodes later getting the even deeper origin story, it's just really cool.\nDavid: Super cool.\nBen: Let's go into our section, after history and facts. This is an illustrious, amazing history and facts. What we tend to talk about now is what would have happened otherwise? The way that I want to frame this in this episode is, what if Atari was never started? How do you think this crazy enormous video game industry that we have today?\nI'm sure you've thought about this before. There's one view of it that it wouldn't exist at all and probably not true. There's another view that it would be no different than it is today, which is also probably not true. What do you think is the middle there?\nNolan: I think that there's a 90% probability that there would a video game post the 6502 microprocessor. I think that the technology had progressed point where it was pretty simple. The secret sauce that I provided is to figure out how to do it with state machine technology, which wasn't an obvious thing to most engineers. I think that was my unique contribution that is far enough out of the mainstream that it may never have happened, or it may, you just never know.\nI would say that we were running down the hallway of a hotel and you're checking all the doors and sometimes, there's a broom closet. Most of the time it's a regular room, but every once in a while there's a ballroom. You're not there alone. There are many people running down those same streets. I think it's extremely arrogant to think that you were definitive in something.\nDavid: I read somewhere, I don't know if it's true, I think this was after you left Atari after the acquisition that there was potentially a deal on the table for Atari to be the US manufacturer and distributor for the Nintendo Entertainment System for the Famicom.\nNolan: Yeah.\nDavid: Can you say did you know anything about how that…\nNolan: I just know that, that was an opportunity and it was turned down.\nDavid: Wow, that would have been a very different history.\nNolan: I want to add one thing about the Transpac because another important thing happened. Over the chart table, 4:00 in the morning, we did the rough for Etak, which was the foundation for navigation systems. If you have a mapping system in your car or on your iPhone, it's all based on the technology we created.\nBen: Wow.\nDavid: I think I remember reading in the research that Etak was one of the companies that did navigation technologies. You had an arrow based on the Space Invaders for the car.\nNolan: Yes, correct.\nDavid: Still to this day, any navigation, Google Maps, whatever, you're an arrow if you're in the car and it's because of that.\nNolan: Yeah. It's a fun story.\nBen: That's awesome.\nDavid: Pretty cool.\nNolan: Back before GPS, there was a thing called satnav, and you could only get a fix twice a day, at local noon and local midnight, that was because they're in polar orbits and that sort of thing. It was all Doppler based, it was technology that was out of the Stone Age. We were doing the calculations of dead reckoning, because what you wanted to do is know where you were now based on that fix 70 hours ago. If you start taking on water, you can say, “Hey, come pick me up at this lat/longs.” We just got saying, “This would be really easy to do if we didn't have all the squishy stuff under us,” and the more we rift on it, we said, “We can do an automobile navigation system based on dead reckoning. Then we'll be ahead of the game for when GPS comes along gets cost-effective.” Started the company off and running.\nBen: What happened to Etak?\nNolan: Sold it to News Corp who sold it to Sony, who sold it to Tele Atlas.\nBen: How these things find their way through industry.\nDavid: [...] earlier this season, it all comes back around.\nBen: One other question before moving on. Atari pioneered video games in so many senses but is not relevant today, and that's a strong statement. How could Atari have traversed the waves that came over the next few decades and been what Nintendo became, especially in the United States?\nNolan: It all comes down to management. The company never had a strong sense of self. In fact, I think Atari is maybe the only company in the world in which the market leader abandoned its market. Can you imagine that? But it did, and the sale to Jack Tramiel, it was just a total cluster.\nBen: This is Warner sold it off?\nNolan: Yeah. They just didn't have a feeling for it. The executives, they put into Atari were all record guys. They didn't realize they were record player guys as well.\nDavid: We covered in our last episode, it was just Fairchild. An East Coast corporation running a West Coast technology firm in that day and age, it just didn't work.\nNolan: Ray Kassar totally screwed up the corporate culture. We went from not allowing executives to have reserved parking spots because I felt that, “Hey, having the workers pass an empty slot with vice president was just an us-versus-them trope. I want us to be as egalitarian as possible. Yeah, I'm going to make a little bit more money, but I've got more responsibilities. But we all are in the same cafeteria, we're all hanging out together. When we have a beer bust on the back dock, we're all there.” It went from that to a private executive dining room by a four-star chef, to limos, reserved parking spots, and all kinds of us-versus-them tropes that was just not Atari.\nDavid: The irony is, now in Silicon Valley, there's a private dining room with four-star Michelin chefs for everybody and everybody takes Uber Black’s door to work and the company pays for all of it.\nNolan: Yeah, that's as it should be.\nDavid: Yeah.\nBen: Yeah. Our next segment that we typically do is acquisition category. There's very clear-cut in easy episodes where the company bought it either it was a people acquisition, technology, product, business line, it was for an asset. In this case, I think what's coming out is Warner didn't really know why they bought it and then that led to some of the falling apart later. How would you characterize why they bought the company and what it was for?\nNolan: I've often thought that Steve Ross, who was suffering from prostate cancer, a brilliant one, had a very clear idea of what Atari was. When he got sick, I think the record guys didn't in a very significant way and that's where it came off the rails.\nBen: Normally here, after category, we would go into grading. Nolan, we will take your color on everything so far, both on Warner buying Atari and you buying Chuck E. Cheese back from Atari and growing that into what it was. We will take your color there as our grades and finish up here. Nolan, thank you so much.\nNolan: Before we close up, I got to tell you what I'm doing now.\nBen: Yeah.\nDavid: Please.\nNolan: AI-driven board games. I did a deep dive on the Amazon Echo and the Google Home system. The AI under it, the speech recognition, and everything, and became mesmerised. I thought to myself, “This is a game platform that nobody knows about. Let me do some board games that you can talk to and that will answer.” It turns out that the AI is very close to passing a Turing test of believability.\nNow we have St. Noire which you can go into at Amazon right now, buy the board game, then download the St. Noire app from your Amazon Echo—we're not on Google Home, we will be after the first of the year—and you can play a murder mystery in which you're in the creepy town of St. Noire and there are 12 creepy people, one of which is a murderer. The townspeople have to tell the truth.\nBen: Oh, it’s like Mafia or Werewolf.\nNolan: Kind of but the perpetrator lies. The game is interviewing everybody and finding out where they were on the night of the murder, who they saw, what they did, and various things.\nDavid: Is it a multiplayer, a single-player, or both?\nNolan: It's collaborative. I always play with three or four people and we decide and talk about things, but there's the board game and it's gorgeous. I suggest that everybody that's listening to this should buy six or seven particularly for Christmas.\nBen: Absolutely.\nDavid: If only you could figure out how to put a quarter slot on the Echo, then that would be perfect.\nNolan: When you sell a bunch of paper for $40, that’s almost as good.\nDavid: Maybe even better.\nBen: There’s one other trend here that you're on that I think is brilliant, of course, AI driven is interesting, next-generation gaming is interesting, but the most popular emerging podcast category is true crime, and this notion that you could have interactive gamified true-crime is really cool.\nNolan: We're actually working on one of those.\nBen: Oh, awesome.\nDavid: Cool, not to mention board games.\nNolan: When you say true crime, I'm not sure that it's going to be true, I like making stuff up like World Wide Wrestling is a total phony, but it's more fun than real wrestling.\nDavid: Way more fun.\n‍"
}