{
  "url": "https://www.acquired.fm/episodes/book-club-discussion-brotopia-with-emily-chang",
  "title": "Book Club Discussion: Brotopia with Emily Chang",
  "heading": "ACQ2 Episode",
  "date": "October 22, 2020",
  "description": "On our latest Acquired Book Club session, we were joined by Brotopia author and Emmy Award-winning host of Bloomberg Technology Emily Chang to discuss everything that went into writing this important book, and everything that's happened since -- especially now in the age of social distancing. You can listen to the full recording on ACQ2.\n‍\nOur book notes on Brotopia\n\nIn some ways Brotopia feels like it was published just yesterday. The first edition came out in February 2018 when Susan Fowler’s blog post, the Google walkouts, Binary Capital, Gamergate and myriad other scandals were all exploding across tech alongside the broader #MeToo movement. The fallout of those events is still being felt today; tech (and we all) are nowhere near out of the woods re: coming to grips with sex and gender harrasment and discrimination in our industry.\nOf course at the same time, re-reading Brotopia in 2020 feels like opening a time capsule from another age. The days of creepy VC cuddlepuddles, sex in Zenefits’ stairwells, entrepreneurs passing the “hot tub test” to get funded, and the Gold Club (the infamous San Francisco strip club located in the heart of Soma) being such a common startup team lunch spot that it was known as “Conference Room G” have all been washed away by our new Zoom reality -- hopefully permanently. And, while discussion of tech’s racial imbalance does play a big role in the book, we all know now that it deserves much deeper examination.\nBut, the core message of Brotopia still resonates just as strongly: tech didn’t have to be this way in the past, and doesn’t have to be this way going forward. As it continues to reshape more and more of society (especially now post-covid), the industry needs to change or we all risk living in a “utopia” that’s utopian only for a very few.\n‍\nSilicon Valley is *inexcusably* behind on gender equality (and diversity in general)\nTech trails just about every other major American industry on diversity statistics. Even investment banks — long a province of white male dominance — are now 50/50. Tech simply has no excuse.\nWhy did this happen?\n1. The “pipeline problem”: the percentage of computer science degrees awarded to women hit a high in 1984 at 37%, and has declined ever since (until recent years). Why? Computers became a “boy” thing in the 1980’s alongside the rise of video games, and as overtaxed CS departments faced capacity constraints they implemented GPA cutoffs -- which favored students who came in already familiar with computers and knowing how to code.\n2. Chauvinism was baked into much of the industry’s DNA from the very beginning. E.g., the canonical first JPEG image that generations of graphics students used to test their algorithms was a Playboy centerfold.\n3. Startups and tech firms decided to embrace “culture fit” as a primary hiring criteria (see: Atari, Trilogy, etc). In practice this translated to: “blanket justification for blackballing anyone you don’t like”, which especially harmed women applicants.\n4. Women who do manage to enter tech leave the industry at twice the rate of men. Even powerful female executives like Sheryl Sandberg, Marissa Mayer, etc. are subjected to WAY more inappropriate scrutiny of their personal and family lives than male counterparts. Imagine if Elon Musk were a woman… what would the internet have to say about X Æ A-12?\nBeyond blatant sexism, deeper forces have kept tech male (and mostly white) dominated\nSuccess in tech begets more success in tech… which usually looks a lot like said past success.\nTo a much higher degree than other industries, Silicon Valley finances itself from within. Individuals who achieve success as founders or employees at a hot company go on to invest in the next generations, either as angels or by becoming VCs. They tend to fund mostly people who look and think like them -- see e.g., the PayPal mafia. Even as outside capital has flowed into Silicon Valley over the past several years (from banks, hedge funds, etc), allocating early-stage financing is still mostly the domain industry insiders.\nMyth of the Meritocracy\nHow do you define “merit” in an industry governed by power-law outcomes? Hard work? Did Mark Zuckerberg work one million times (the delta in outcomes) harder than the founders of MySpace? Smarts? Was he one million times smarter? Of course not. Clearly other factors impact tech outcomes far more than individual or even company-wide talent. (luck, timing, access, etc) Even beyond these other factors, the idea that a purely-merit based reward system can exist at all is a flawed one. We all know that privilege compounds, so even if someone’s original ticket in was their smarts or hard work, their subsequent accomplishments are attributable to that AND their membership in some new exclusive club — be it an Ivy League school or startup mafia.\nYet the meritocracy mindset pervades successful technology companies and leads to a toxic consequence: those who’ve achieved success start to believe they deserved it. Which — besides just not being a good look in general — makes them think it was due to specific traits in themselves and their companies, traits which they then intentionally select for when financing and mentoring the next generations. (Even if those traits have absolutely nothing to do with building great companies... e.g., being able to last 8 hours in a hot tub.)\nTech’s sex and gender imbalance has far-reaching implications for society as a whole\nMost large tech platforms -- and in particular most large social media platforms -- were designed by men, with little/no input from women (or minority groups) while they were in their infancy. One enormous consequence of that is the epidemic of trolling, hate speech and harassment that happens online… see e.g., Gamergate, etc. While the men who designed platforms like Twitter and Reddit certainly didn’t intend them to become havens for trolls, they also didn’t think about it or take measures to prevent it. Now that these platforms are large, it’s nearly impossible to put the harassment genie back in the bottle, despite companies’ continued moderation efforts costing tens if not hundreds of millions per year. As Emily points out, it’s not hard to imagine that a woman or women might have been more attuned to the potential for harassment, and things may have played out differently if they had an early seat at the table.\nFixing this issue isn’t just about doing what’s “right”, it’s about doing what’s right for business\nThe social media example above raises a critical point: tech is no longer a narrow or insular sector. It impacts every person and every company, in every country in the world. Products that win biggest will be those designed with the widest set of users in mind… which means companies should want teams with the widest set of backgrounds and experiences to build them.\nThe days of the “best” engineers being anti-social nerds who sit alone and create some platonic ideal of code are long over… and were probably never real in the first place. Rather, today’s best engineers are curious, empathetic, work well in teams and seek to understand what users of their product actually want and need. Even if you take James Damore’s infamous Google memo at face-value (which, to be clear, we don’t), his argument boils down to women having a preference for “empathizing over systematizing” as compared to men. Well, empathizing over systematizing is actually an advantage in today’s tech world.\nChange IS happening -- even if still slowly\nNothing has changed about the pattern and structure of power in SIlicon Valley: success still begets success, and the industry still funds its own. However, over the past ~5 years some (but not all) of the people in power have finally started to make efforts to change the makeup of who wields that power.\nMale CEOs of many new and newly public Silicon Valley success stories have instituted explicit gender and diversity targets for hiring and for their executive teams -- to varying degrees of success to be sure, but compared to the past this is progress. In one shining example, the entire named executive team in Zoom’s 2019 IPO S-1 was female (besides CEO Eric Yuan).\nOn the venture side, 5 years ago neither Sequoia nor Benchmark had any women members of their US investing teams; today both have ~20% female partners. Still a long way from 50/50, but alot better than zero. Groups like All Raise, BLCK VC, Latinx VC and others have emerged to support women and minority VCs and founders in entering the industry and achieving success.\nThe industry today is undoubtedly in a better place than in 2016. But, we shouldn’t kid ourselves: there is still a long way to go, and we have much more to improve.\n‍",
  "transcript": "N/A"
}