{
  "url": "https://www.acquired.fm/episodes/building-a-disruptive-payments-company-with-klarna-ceo-sebastian-siemiatkowski",
  "title": "Building a Disruptive Payments Company (with Klarna CEO Sebastian Siemiatkowski)",
  "heading": "ACQ2 Episode",
  "date": "June 24, 2024",
  "description": "The tenacity required to build Klarna over the last 19 years is astonishing. Despite several headwinds and changes in the payments landscape since founding, Klarna is used today by 150 million consumers globally, processing two million payments a day. Founder and CEO Sebastian Siemiatkowski joins us for one of the most honest and thoughtful discussions we’ve ever had on the show. If you’re a business strategy nerd, it’s a great case study in how to leverage the strengths you have as a startup vs. incumbents, and how to compete against other startups in your space. In Klarna's case: the rapid rise of buy-now-pay-later. Sebastian also takes us into the logic of his aggressive AI strategy for cost reduction, product experience, and payments innovation.",
  "transcript": "Ben: Hello, Acquired listeners. Today, we are doing a deeper dive into the payments landscape after our Visa episode late last year. To do that and learn more about his company, Klarna, we are joined by Sebastian Simemiatkowski, the co-founder and CEO of Klarna.\nThat is a name that many of you probably recognize. They are best known as a buy-now-pay-later company with ambition to play a broader role in the payments landscape. They were founded 19 years ago in Stockholm, not too different from our friends of the show at Spotify, and by now have 150 million consumers globally using the service and powering two million payments a day. We will get into Klarna specifically later on. First, welcome Sebastian.\nSebastian: Thank you for having me. It's great to be here.\nBen: I want to ask you in some ways a crazy softball question, and in other ways an impossible question to answer. Starting at the 30,000 foot view, if someone asks you, hey, can I have a high-level overview of how payments works and who are the major players in the value chain in five minutes or so, how would you respond to that?\nSebastian: Considering that I hope there are a lot of geeks on this call or listening to this podcast, I would probably, in this case, start a little bit differently. I think the easiest way to think about it is the issuing and acquiring side and the networks.\nThe issuing side would be the bank giving you your credit card that provides you, and that card has an access to a credit line or a positive balance. Then you have the networks in between Visa and MasterCard that sets the standards. Both the brand, the recognition to us that you know that this card will be accepted in these places, but also the standards for how that exchange of financial information, payments, and the settling of that transaction actually happens.\nFinally, obviously you have the acquirer and the PSPs, which basically are the ones partnering up with immersions and helping them enable the acceptance of payments, providing the terminals if it's a physical store, or providing the checkouts and the cashier experience if it's online.\nThen you have a number of companies that circulate in this industry, whether it's people helping recognizing fraud, helping with underwriting, or different (for example) ecommerce platforms that may also offer. We know Shopify is a fintech company to a large degree as an example, so there will be a lot of people that are a little bit of both. In general, I think that acquiring the network issuing side explains a lot of it.\nBen: You founded Klarna 19 years ago. Wind all the way back. What was the insight that you had where you said, I should attack and start in this very particular corner of payments?\nSebastian: Not to make that too lengthy, but for whatever reason, I've always had this dream of starting a company. I was inspired by the founder of Ikea, that's Swedish Ingvar Kamprad. I read Richard Branson's book about Virgin when I was 14 years old, and I thought it was a fantastic story and stuff. I've had a lot of different business ideas that I obviously myself thought were awesome, each one of them, but most of them stayed as a draft on a piece of paper.\nI happened to spend two years in Stockholm School of Economics, which is a business school. I did a sabbatical year, which took me around the world without flying, which was an exciting adventure. Coming back, I was out of jobs, and I was just desperately looking for a job. This was a low economy because the IT dot-com bubble had just burst. So I tried to go to PWC or these places that somebody with an economical background should work at, but I didn't get a job.\nI found myself getting a job at an account receivables factoring/debt collection company, which was the last place in the world I ever imagined myself working as a sales guy. I had a lot of experience from me being a younger 17–18 years old. I used to work extra as a telemarketing guy who would call you and bother you in the evenings trying to sell a subscription to a magazine or something like that.\nI got this job, and my job was basically to open the, at that point, there were still telephone catalogs of businesses. I would call them and say, hey, when somebody doesn't pay your invoices, or when you need factoring so you want to borrow against your account receivables, who are you using currently? And would you consider using the company that I work for?\nThe funny thing is the company I was working for was called ACME. It was a really stupid idea why they use that name, but they said, that's the dummy company that Microsoft uses in all of their presentations. They said, this is free advertising for us. Every time they use this dummy company, it's like advertising for us. It didn't sound like a great idea.\nBasically, I was just picking up the phone call, and I was calling all these businesses. This happened to be 2003 when it was difficult. You would call this lady in accounting in some mid-sized Swedish company. She would say, look, I've used this other company for 20 years and I don't really care. Maybe you can save me a thousand dollars in fees, but I don't care. I've been using them, I trust them, and so forth, so it was difficult.\nHowever, I happened to call a few ecommerce companies because at that point in time, Amazon didn't exist in Sweden. There were these early entrepreneurs that had found that you could buy Google AdWords really cheaply for cat food, and you could start shipping a lot of cat food. It was actually quite easy back then. You just buy an AdWord that nobody else was buying, and suddenly you'd have all these customers flocking at your website. They were in need of some payment methodology.\nWhat happened there was, the prevalent form of payment online then was just like it is today, it was Visa and Mastercard. There were card payments. However, traditionally in catalog mail order businesses, had provided a bill-me-later option, which is true in the US as well.\nThe catalog companies had already figured out that if you would provide credit when you sold something at a distance, meaning it's different when you go into the store. You see the product, you touch and feel it. It's like, this is what I'm buying, and then you pay for it.\nIn a distance selling, where you would order something from a catalog, the experience of being able to say, please ship this product to me first, allows me to touch and feel it before I pay for it.\nbuy-now-pay-later made a lot of sense. It's not about credit for borrowing money, it was to provide safety and trust to the consumer that I can touch and feel this thing before I part with my money. You have to remember, this is in a country called Sweden where most people had debit cards and not credit cards.\nDavid: I was going to ask, what was the payment landscape in Sweden like at that point?\nSebastian: Actually, a lot of people had credit cards, but they didn't like using them because they thought they were dangerous, and they would get in debt and stuff. People really use them as a lender of last resort.\nBen: Smart.\nSebastian: Yeah, exactly. That's pretty smart. They mostly were using the debit money. To them to go online and buy something in these early days was a risky undertaking. I'm punching in my credit card number or my debit card number, which gives somebody else access to my positive balance on my salary count, and then I'm shipping money to this small ecommerce business I've never heard the name of to get my cat food at potentially cheap price.\nThe ability to be able to say, hey, could I first order that stuff, get the cat food, inspect it, and say, yeah, it's healthy cat food as what it's advertised to be, and then pay for it, it made a lot of sense.\nThat just made me think, wow, why aren't these ecommerce companies doing what the mail order companies used to do? We're still doing it, because there were quite successful mail order companies that were just migrating to the Internet. They were actually doing it. They're offering what we refer to as an open invoice payment method back then, which then merged into buy-now-pay-later. It was basically that ability.\nI had this idea. The company I was working for, considering the name of it, as you heard, ACME, was not the most serious company in the world. I figured out, this was not going to be the place where I was going to be able to develop these ideas. It happened to be, so I went back to school to university. They had an incubator, and I came with the idea there. Hey, maybe this is something that I should start a company doing actually. That was the background.\nBen: It really was the initial founding insight that is the core product today of people for individual purchases will want to pay later, even after they transact.\nSebastian: Correct.\nBen: A lot of companies do a lot of winding around in the woods before figuring out the core product. I'm sure it took some time to get traction, but the initial idea was the thing with market fit.\nSebastian: Actually, I don't want to sound like that, but it didn't take that much time to find traction. Again, you have to remember this is in a small country of Sweden with 10 million inhabitants, but we had this idea.\nWe went to the incubator. I found my two friends that I knew one of them from high school, Nicholas, and the other one I met in university. We decided to go down this route around October–November. We found a business angel investor that invested in December, and she brought some engineers. The engineers built the first MVP of our system to process these transactions, underwrite the transactions, and all of these things.\nFrom about January to April, it took them about four months. They did it in their spare time because they still had full time jobs. We asked our business angel to give us $40,000. She gave us $60,000 for 10% of the company. We said at that point in time, look, we only need $40,000 to come to profitability. She's like, no, no, you're going to need $60,000.\nDavid: Different era.\nBen: How much money have you raised to date just to get back there?\nSebastian: A lot. A little bit more, I think it's $4 billion or something. What's interesting is we spent $30,000 before we became profitable. We were about six months into it, and the transaction started running. We very quickly became profitable actually. It was only many years later that we started raising bigger rounds of investments. We were profitable for the first few years of the business because the business model was very effective. The merchants loved it because they saw an increase in sales.\nDavid: You're enabling transactions.\nSebastian: Exactly. Consumers loved it because they felt much more secure of using this over using the debit card, so it really kicked off. It was in a small market, which is why we didn't become PayPal at that point in time. It would have been very different if you would have stricken gold like that in the US with something. But here in Sweden, it became extremely successful very quickly.\nDavid: To the consumer trust element, were you holding the payment information yourself? Was that part of the value proposition of like, oh, you don't have to give the cat food company your payment information. This is a centralized place where you can trust us and we're the secure platform?\nSebastian: It has become that more and more, but the merchants always wanted to understand who is their customer, what are they buying, and so forth. We made sure to build a system in such a way that the merchant had full access to it as well with the consent of the consumer.\nBen: I'm sure it evolved over time, but obviously if the benefit is pay later, there's a concept of float. You said you quickly got to profitability. Who was floating the money in the meantime?\nSebastian: This is the funny part. I think only truly nerds like yourself will be able to appreciate this fully. The funny thing is that what we're basically describing here is a factoring idea. Basically we are underwriting account receivables, and then we're acquiring those accounting receivables from the merchant.\nEveryone was asking the same question, how are you going to fund this? You need a lot of cash. You need to buy these account receivables, and you need to wait for them to be paid by the consumer.\nWhat we figured out, which is typical to me, entrepreneur conclusion, is that if you worked in the finance industry, you would be like, of course that's necessary. But if you're an entrepreneur and you talk to these online merchants back then, they were like, you know what, I'm not interested in a cash flow solution. They themselves were actually sorry to say so, but many times fairly poor at understanding the importance of cash flow.\nWhat ended up happening is we went to these smaller ecommerce businesses and said, look, the thing you want to avoid is the risk. We'll take on the risk of the customer not paying because that was one thing that they were very worried about.\nThe second thing that the merchant was very worried about was the administration—if I do this myself, because some of them could have done it themselves. They could say, hey, I'm just going to print an invoice and then ask the customer like an electrician would come to your house. It will give you a bill and say, pay me for my work.\nThey could do that, but they were also worried about the administration. What if I need to collect this money, get a collecting agency, and like, oh, my God, customer service, and all these things? Those were the two primary concerns, not the cash flow.\nWe ended up constructing a business model where we say, we'll buy these account receivables from you. We'll take the risk. We'll do all the admin, but we won't pay you until three weeks later. We ended up actually creating a factoring business model that actually had a positive cash flow.\nOur merchants were basically funding us for the first few years. Some merchants obviously recognize and say, look, I need the money instantly, I need it faster. Then we would say, well, then we need to charge you a higher fee.\nWe had enough merchants that accepted to get delayed on their payments in combination with the fact that a lot of consumers paid not at due date, but much earlier. They would just pay instantaneously. Those two cash flows, we managed to balance. It was actually quite some time before we started having cash flow issues.\nBen: You had the golden goose of being able to scale with customer funds without actually going out and raising additional capital, which most people would think is impossible for a factoring business whose theoretically entire value proposition is fronting money, what you need to get from some facility, or maybe you dip into your equity capital to do that. You're right. It's a very entrepreneurial insight of actually the customers are not obsessed with cash flow. They can front the money effectively, and we'll handle the risk and the administration.\nSebastian: Yes. That's exactly right. That was what's funny about it, and it worked. Over the years as we became more hopefully trustable, we started having banks fund this, and we found different ways of solving this. But initially, that's actually how we solved it.\nDavid: It's almost Visa-like in a way. I guess you were taking the risk in a way that Visa wasn't, but you're a network. You're not actually the financial provider in those early days.\nSebastian: Exactly.\nBen: When was the first time you heard the phrase, buy-now-pay-later? I think I heard it in probably 2015 or something. If you had started the company over a decade before that, it had to be one of these scenarios where you thought you were operating in one space, then your space got named by somebody else, and you had a choice whether to adopt the generalized name or not.\nSebastian: For a long period of time, I was very angry with the fact that, in my opinion, what was a clone of Klarna in Australia called Afterpay had also then created the buy-now-pay-later term.\nFortunately for me, I found that Financial Times had written an article about Klarna back in 2013 or 2015 before Afterpay was launched, where they actually titled it Buy Now Pay Later. That made me at ease that I think it was Financial Times that coined the term, so now I feel a bit more happy from a pure prestige perspective.\nBen: Bringing up Afterpay brings up this interesting point that this space lends itself well to companies that serve geographies and their specific needs. You could have, before everyone was at global scale, an Australian provider, a Swedish provider, a US provider. Then I imagine the race was just on to figure out, well, how do we serve the needs of those other markets in addition to our own?\nSebastian: You're totally right. What happened in our case was we launched this in Sweden. It worked. Then as being Swedish, funny enough now, when I look back at it, the first next market was Norway and Finland, which are four million people or whatever. That's partially driven by merchant demand, because a lot of Swedish ecommerce merchants were active in Norway and Finnish markets, the Scandinavian countries.\nThe next big market for us was Germany and the Netherlands. The reason we chose those markets was because there was a strong tradition of what in Germany is referred to as Rechnung, which is basically invoice or buy-now-pay-later in those markets. For a long period of time, we were like, how are we going to break into this US and UK market?\nIn our opinion, we looked at it and we said, credit cards are so prevalent. There's no need for our product in those markets. That was my conclusion. It made us continuously think about, okay, but how are we actually going to do it?\nThe funny thing was that we eventually decided to dip our toes into the UK market. That was basically, I think around maybe it was pretty late like 2014–2015. Most of between 2010 and 2015, we used for two things. We tried to compete with Stripe and Adyen on the acquiring and PSP side, and we can come back to that later. The other part was a payment service provider, one of those.\nThe other part, what we spent 2010–2015 on a lot was to get Germany to work because we had at that point of time, four or five markets. It was really difficult for us to rebuild our systems and rebuild everything that we were doing, so it would actually be able to operate in multiple jurisdictions with different regulatory requirements, et cetera.\nIn 2015, when we had a small team, we put them in the UK and said, hey, let's go and try to get something going in the UK. The team came back and said, you know what? We think there's a huge opportunity for this product, which gives you an opportunity to buy-now-pay-later. I said, no, that's a terrible idea.\nThe only option we have is to go into high ticket financing. More of the approach that a firm has had is basically going at the mattresses, the home electronics, do that and not go for small ticket items, fashion, or whatever. I said to the team, you're not allowed to do that.\nSecondly, the team had an idea that we're going to go to one of the biggest fashion retailers and try to nail a big whale from day one. I was like, we've never done it like that. We always go to the small merchants and then the medium sized merchants, et cetera. I was actually quite tough on the team. I was like, that's a really bad idea, you're not allowed to do it. And they fully ignored me. They just ignored me entirely.\nSix or 12 months later, I had another business review meeting with them. They were like, okay, we're trying to do this buy-now-pay-later to a large fashion retail. I was like, I told you you're not allowed to do that, that's a horrible idea. Then I’m like, please don't do it. Three months later it came, we've signed ASOS, and we're going live with buy-now-pay-later. And it's been a smashing success.\nIt's funny, you always want to attribute. In that case, actually, I was very fortunate. We had a very independent thinking team in the UK, who recognized something that I had not recognized.\nAlso, Afterpay had recognized in Australia, which was that credit cards had been growing 2x between 2007, 2008, and 2018, but debit cards had been growing 10x. There was this new generation of card users that simply did not have access to credit cards or didn't like to use credit cards. To them, the traditional business model of Klarna, the very basic idea that we had when we started in Sweden.\nThe funny thing, it wasn't Klarna that figured the US out, it was the US market that became the Swedish market. That was what opened up the US for Klarna, which is opposite to what you would usually expect to happen.\nIt just happened to be that the demographic and the 2007 financial crisis, the changes to credit cards, promotions in campuses, tougher restrictions on underwriting, and all these things, created this massive boom in debit. That meant that there was suddenly a new online shopper that had a need for our products that didn't exist when we started Klarna in Sweden in 2005.\nBen: It's fascinating. It's not that credit card users switched to become debit card users. It's that the market for unpenetrated digital payments ended up mostly accruing to debit card users, which changed your characterization of, oh, the US market has mostly credit cards too. Well, all these new people that in what was previously a latent unexplored market are now primed to be the type of customer that we have here in Sweden.\nSebastian: Exactly. The thing is that, what I really found interesting in all of this is that we have occasionally worked with McKinsey. They do some things that are very high level and I find of less value, and they sometimes do really great things. I have both fantastic things to say about McKinsey, and sometimes I'm somewhat of a critic.\nWith that said, McKinsey published a report. This was a fantastic report. It was actually published in May 2014, so long before the buy-now-pay-later thing. It's called New frontiers in credit card segmentation: Tapping unmet consumer needs. Remember, this is a few years before buy-now-pay-later, about five years before buy-now-pay-later became a thing in the US.\nIn that report, McKinsey says there is a group that credit cards are not catering to, and they call them self-aware avoiders. This is a group of people in the US who have had poor experience with credit cards. They don't like the practices of credit cards. The way credit cards promote over indebtedness is by giving you a credit limit that's very, very big, and you think you have that money and can spend it. They always ask you every month to pay a smaller amount and pay the lowest possible amount so that you revolve and build up a balance.\nAll these tactics and practices that credit cards have applied that a proportion of the population in the US have simply not like, or they've seen their parents get in financial debt in 2007 and couldn't get out of it, all these things. That was a group.\nThe interesting thing is a group of fairly high median annual household incomes, they are spending quite a lot, but McKinsey estimated that group to be about 20% of the US population. They're called self-aware avoiders. When you look at the features that they promote, what are the features that are most important?\nThe whole credit card industry has been over obsessed with the idea that everyone is a reward seeker. There are reward seekers out there and it matters a lot to them, but it's not the whole population.\nInstead of talking about rewards as the most important benefits, the self-aware avoiders want simple and transparent fees, rates and terms. They want avoidance of mishaps that trigger fees, pay off horizon for each major purchase, and swipe to installment loan. McKinsey is basically describing buy-now-pay-later five years ahead of its time.\nDavid: McKinsey was an entrepreneurial organization. They could have started Klarna in the US.\nSebastian: Yes. Even I read this report, and I didn't fully grasp the potential of it back then. The point is that there were these indications that the markets were changing, the needs of consumers were changing, opening up for a different form of credit that would be more attractive, not to necessarily everyone.\nDavid: I guess this is one of the downsides of the Visa MasterCard system that we explored in that episode. Visa and MasterCard's business model is in many ways very, very similar to yours, but their partners are the banks, and the bank's business model is banking. They lend money, they make money on lending money. That's underlying that whole system.\nSebastian: For sure, and that's the point. If you look at how much money a credit card issuer is making, as much as they may look in the papers and say, oh, there's a new generation of users that won't buy-now-pay-later, is it attractive if I'm doing revolving at 30% interest rate, and I'm running my credit card portfolio at this bank? Is it attractive to offer pay-in for interest-free installments? That doesn't sound attractive. I'm not going to make more money doing that.\nIt is a model that actually makes less money of its users, which means that it's better for consumers. It's a model that means that people borrow less. It has that advantage for the consumer, but that's not necessarily an advantage for the bank itself or the credit card provider today.\nMy point is only to say that you'll still make money with this model, it's just that you make less money. Actually, we have done some revolving as well, but if you take even Afterpay as an example who never had revolving, it's easier because you only have upside, you don't have the downside. If you have this massive portfolio of people that are paying you a tremendous amount of revolving fees and stuff like that, then it's very hard to make a decision that you're going to change into a business model that simply...\nDavid: There's a major innovators dilemma aspect to this.\nSebastian: Yes.\nBen: Is this the Christensen idea of low end disruption? There's a new market that wants a different product. That product is not as financially interesting to incumbents. Therefore, there's this opportunity created to create a lower margin, \"worse in many ways\" product to this new set of consumers?\nSebastian: Yeah, I think that's a big piece of it. If you look at also the criticism and the challenge that a company like Klarna gets, I think part of it is as we provide credit, there's always the discussion of credit and the issues associated with it. But there is definitely a part of that criticism that is pushed by banks and other incumbents that are seeing a major threat to their existing revenue lines.\nIf this model becomes more prevalent and if consumers, I feel very confident that in the coming years, we're going to see that people that use these models are actually better off. They get less in debt. They pay less in fees than people using credit cards. Eventually when that becomes more and more confirmed as the truth, that will create a tremendous pressure on these incumbent’s models.\nDavid: Is it fair to say that using Klarna or a BMPL system, you're essentially signing up to a more structured credit or payment plan versus a credit card, all of the financial responsibility is on the cardholder? The financial responsibility is still on the payer here, but it's like, hey, I know the terms up front. It's structured. I can't get myself into a situation like we've been talking about where my revolver just gets out of control.\nSebastian: Yes. I want to make it clear here as well that when we started Klarna to come back to the early days, the first model that we offered was just the buy-now-pay-later. You would buy something now, and you would pay within 15 to 30 days. Now, after about two years, we did see the opportunity to move into revolving and also financing of higher ticket items, such as a home electronics device or something like that.\nWhen we did that, we looked at the competing banks in Sweden. We looked at their business model and said, how are they actually doing this? How does it work? What fees do they charge? What are the revenue lines? How do they underwrite all these things?\nWe concluded that there were all these great tricks that made the consumer pay much more. A classical trick would be, hey, sign up for 12 months interest free. Then what you would do is you would send the customer a bill for your monthly payments on that 12 months interest free loan where you would either pay a higher amount, which would keep the 0% interest plan, or you would pay a lower amount that actually meant that you move into a 36 months revolving account with 20% interest.\nObviously consumers are going to say, oh, this month was tough, and they're not necessarily going to fully understand the consequences. Someone even by mistake paid a lower amount and would be moved to a higher interest bearing plan. We were like, oh, okay, that's how you make business in the banking world. Awesome, let's do it. Let's copy these things. And we did it. You make a lot of money from doing those things.\nIt took us some years to also start reflecting, but hey, did all of these consumers really understand what they did? Did they want to pay that high interest rate? Is it healthy? It took us some time to start reflecting on this. As we started reflecting these, we started changing our business model and removing some of these tactics that banks have applied to maximize this.\nI think that there's a great episode on Netflix called Credit Cards Explained where there's basically 30 minutes, where you just move through all of these tactics that banks have applied in the last decades. It's a different generation. I think in 2000 and 90s, there wasn't this corporate social responsibility thinking. There wasn't that thing. It was just like, how do I maximize profit? That was the driving force.\nIf somebody came up with a tactic that was legal and made people pay more interest, then you would do it. There wasn't that consideration, is this healthy? does this make sense, et cetera, to the same degree. I think what we've been doing is we've been challenging these things.\nI think a great example of that to answer your questions was when I used to work at Burger King when I was 15, when you swiped your card, the terminal in Burger King would say, press one for debit, press two for credit. That made a lot of sense because when you make your everyday purchases, only a few transactions are relevant to put on credit. Maybe it's a bigger purchase, and I want to put it on credit for that purpose or something, but your everyday spend at Burger King probably is a debit transaction, hopefully.\nMaybe I'm out of salary. I'm getting my salary, my paycheck tomorrow, and I'm okay to take it on credit for 24 hours. These situations may vary in people's lives, but the point is there was an option between one debit and two credit. Everyone's above 40, 30 remembers these things.\nThe banks removed that. They removed it. Today you swipe a credit card, and you get everything on your monthly statement, everything, your Burger King purchase, your Walmart food. Everything is on that. Why? Because obviously, as you had that ability to click per transaction, your monthly statement was before when you had one for debit and two for credit.\nThe monthly statement would only be for the full amount of what you put on credit. If you had the option to put on debit, you would have a lower amount. Let's say if you had that option with one for debit and two for credit, maybe your monthly credit card statement would be $500. How likely are you to revolve then where you're much less likely to revolve because you can actually afford $500?\nIf you put your full consumption of a month, you had maybe a thousand dollars. Now, suddenly you're going to revolve. The banks remove these things, press one for debit and two for credit, because they simply saw that it drove less revolving, and less revolving means less money, and then means less ability to offer cash back and rewards that then is the main feature to drive in new credit card customers. You got this loop, where everything is incentivized to basically get consumers to pay maximum interest and maximum revolving.\nWhat we're doing with our solutions is reintroducing press one for debit, press two for credit. We have both pay now and pay later. We're trying to bring back a lot of these ideas that used to exist, that were simply just more healthy from a spending perspective and a credit perspective.\nBen: How does that manifest in the Klarna product today? What does pay now look like? I think people are quite familiar with the Klarna button to buy-now-pay-later.\nSebastian: Where we're going is that we're not there entirely yet, but within one or two years, we hope that every time you see Klarna on a merchant website, it will mean that you know that you have those two options.\nAlready today, debit for Klarna is about 35% of our volume. Almost not half, but it's a third of our volume is debit. Not in the US obviously where we're predominantly only credit still, but in a lot of European countries, the debit side is quite meaningful.\nOur ambition is for it to be 50/50 online and in-store, probably 80% debit and 20% credit or something, which we think is a long-term healthy proportion.\nDavid: The mall that I usually go to that's just closest to my house in San Francisco is Stonestown mall. The entire mall, and it's huge, is basically covered in Klarna banners. For the last year or so that I've been going there, I've been like, this is so weird. Klarna, I think buy-now-pay-later, I think online, I think ecommerce. What is Klarna doing here? Tell us about in-store.\nSebastian: We've been trying to approach in-store in many different ways. I think to come back to that original thing, we started definitely with the buy-now-pay-later model. I'll actually put it in a different context.\nIn 2009-2010, we had this vitally successful buy-now-pay-later. We had this idea that we were going to, what you refer to in the industry, close the loop, meaning that we would be both the merchant acquirer PSP and the issuer.\nDavid: This was the compete with Stripe in Adyen.\nSebastian: Exactly. We had this idea. I always laugh about the fact that we had this presentation. I had this presentation for my board back then. I said, look, we're going to launch a new product called Klarna Checkout. The idea is that Checkout will allow online merchants to offer all the local payment methods, Visa, Mastercard, local payment methods, buy-now-pay-later methods, et cetera.\nWe will do all the acquisition, all the processing, and everything for these merchants. Then I said, look, I think we have a few competitors that look scary. There are these Collison brothers in Ireland who figured out the importance of great APIs and that actually most of the people integrating payments are engineers, so let's build a great product for engineers. Then there are these guys who've done it before, the Dutch guys who really know this industry.\nThe funny thing with Peter at Adyen was that at that point in time, Klarna was a bigger company than Adyen in all aspects, organization, revenue, and so forth. I went down to Peter and said, look, Peter, you have to sell your business to me because I'm going to run you over. Peter just looked at me and was like, who's this brat kid coming in? I was probably 30, and he was 40. He's like, who is this guy coming in and threatening me? It took me a few years to fix my relationships with Peter after that. Now we're good friends at least, so that's good.\nWe had an idea that we were going to compete in this. I always laughed that if my investors were listening to me in that board call, they would have said, oh, I need to go and make an investment in Stripe and Adyen, which Sequoia actually did.\nDavid: Many of them did, right?\nSebastian: Exactly. I was very right. The only problem was that Klarna I did not deliver on our thing. We checked it out. It became actually a very successful product in the Nordics. For a period of time, more than 50% of all online transactions in Sweden were processed over Klarna checkout. It's hugely successful, but we struggled to bring it international and do it as well as Stripe and Adyen did.\nI remember in 2013, there was an announcement that Adyen did that's like, we added 50 payment methods in Asia or something. I sent it to my engineers. I was like, guys, we haven't added a single payment method in two years. I can just look at the pace here of execution and I can see where this is going. In 2015, it was the final blow when Adyen signed Spotify. Obviously, Spotify being a neighbor of ours.\nBen: Right in your backyard.\nSebastian: Exactly. You're like, okay, here comes your worst competitor in science with your best friend and you're like, okay. It became a very critical point of time for the company because we said, okay, look, it's clear that we're not executing on the strategy as well as they are.\nWe have two options. Either we pretend to be almost Adyen and Stripe, and then we exit the company because somebody wants to buy an almost Adyen or an almost Stripe, which for example happened. Bambora was a company in Sweden that got acquired by Ingenico because they were an almost Adyen. You can do that.\nOr we pivot. This was when we pivoted in the direction that we're on right now. In 2015, we changed the ambition and said, look, if we can't win on the merchant side, let's instead pivot and try to win on the consumer side.\nBen: To be clear, you were still doing well on the merchant side for the buy-now-pay-later platform, just not the full umbrella checkout platform.\nSebastian: Exactly. The checkout really worked in the Nordics where we had good support and good for it. The biggest challenge actually in the US market was Shopify's dominance. Basically, the only opportunity we saw for checkout was to start with smaller merchants and then grow into larger merchants.\nShopify decided they wanted to do their own checkout and be their own fintech company. At that point in time, it became basically blocked the only entry point that we had into the market. That was also like a revelation, like it's going to be very difficult.\nSince then, you've seen a few companies have been trying to do checkout. There's been that company in the US. I forgot the name now, I got quite a lot of attention trying to do checkout. There's been a few people that've been fast as an example and a few others. It's been trying to do something like that. It became clear to us that we needed to move away.\nToday, Adyen and Stripe are our biggest distributors. It really changed a lot. We actually mostly are integrated over acquirers and PSPs like them who are promoting and offering the Klarna product to merchants. It's actually not that common today that a merchant has a direct integration with us anymore.\nBen: Really?\nSebastian: Yes.\nBen: That'll help not require a gigantic sales force.\nSebastian: Exactly.\nBen: Classically, the problem with merchant acquiring is you need to have boots on the ground and every geography.\nDavid: Which is why you needed banks to do it.\nSebastian: Exactly. It became problematic for us. Obviously, we checked out because we were partially competing with Stripe and Adyen. In order to get those relationships and partnerships going, we've made commitments that we are moving away from that part of our product line and move into the consumer product line, which has been the direction of the company ever since 2015.\nBen: We haven't talked really about the consumer products at all, and that seems to be the more recent evolution in the company. What does that look like?\nSebastian: Funny enough, in 2015, we were like, okay, the buy-now-pay-later thing worked really well. We didn't at that point in time yet recognize there was an opportunity in the UK and US. We were a little bit concerned. We did a last attempt in 2015 to launch checkout in the US with very limited success. We're a little bit like, what do we do?\nIt happened to be that my second co-founder was leaving at the same point of time, so I had an entirely new management team come in, which at that point of time, I also learned that I don't want to hire executives from the outside. I'd rather promote from within. The company had been around for 10 years. I took some of our best junior managers and promoted them into my management team. We basically sat down with a white paper and said, okay, where do we go from here? We need to find a different direction.\nActually, the conclusion was the following. What's going to happen with financial services? That was the big question. It's a bit like self driving cars. We don't know when it will happen, but eventually what will happen is you will wake up in the morning, and your digital financial assistant will basically say, hey Ben, I looked through your mortgages this night, and I realized that you're overpaying. I have negotiated a new rate on your behalf with a separate bank. The only thing you need to do in order to save $10 on your mortgage every month is for you to say yes, because I'll do all the switching for you and I'll just move you to a different bank.\nEventually, that's going to happen. I don't know how fast it's going to go. I don't know when these things will become a reality, but it's very clear that directionally speaking with the way software is developing and obviously in the last year now with AI coming along, you're like, okay, that's much closer than I thought it was going to be. The point is it's like self-driving cars. I don't know when it will happen, but I know it will eventually happen.\nThe conclusion was like, okay, the future we're looking at in financial services is that at some point in time, there will be this digital financial assistant that just does this on your behalf.\nThen the next question is, okay, but where does that leave us? What do we do in that world? What is Klarna in that world? Obviously you said like, well, the best position to be in is I want to be your digital financial assistant, because maybe if I did that for you, Ben, you give me a dollar a tip for like, hey, thank you for fixing that mortgage thing. I'll give you a dollar in tip.\nBen: If you can get me a cheaper mortgage, I'll give you a lot more than a dollar.\nSebastian: Yeah. I'm happy to hear that.\nDavid: Can we talk after this episode?\nSebastian: Exactly. What this all means is that eventually, you'll have to be that digital financial advisor, which in a way is what you would think of as like, what was the purpose of a traditional bank man? It was your financial advisor that would like, hey, I'm going to take over, I'm going to take care of your finances, of your savings. I'm going to make sure that they grow. I'm going to take care of all this stuff that you don't understand and don't have an interest in, and I'll just make sure that you're good off.\nThe only problem is that once banks got that trust from us as customers, they took it to their advantage, and they started finding all these ways to not necessarily serve our best interest as customers.\nAt some point in time, we just realized that that's directionally where financial services are going. It is going to be a very, very disruptive force because, for example, one of the things it means, it means the end of the excess profits that we have seen in the banking industry.\nIn the banking industry, we've always had excess profits because people are not very easily moving between banks, because they find it hard, difficult to change, and they're not sure they're getting any value. A lot of these things will go away, and it's just going to look like a very different industry than it does today.\nWe said, well, okay, we want to be that digital financial advisor. The next question is, how do you win that? How do we make sure that Klarna is the best digital financial advisor? We don't know everything, but we know a few things.\nWe know that it is beneficial to be global over being local, because this will be a question of scale. The more markets you serve, the more consumers you serve, the more likely you are to be able to operate such a thing. It's going to be about volume of size. It's going to be important. Global distribution was very critical. That's when we said, we have to really expand our network of a number of countries. That was one.\nThe second thing is data. Ben and David, the more you have trusted me with data about yourselves, about your transactions, about your financial life, the more likely and capable I will be to be able to provide you advice and services of value. The better I understand you as customers, the more likely I'm able to actually save you time, save you money, and do something that's of value for you.\nWe then realized that Klarna had one very unique thing that really sets us apart. That to me is much, much, much more critical and has been much more at the core of what Klarna is than buy-now-pay-later, and that is SKU-level data.\nWhenever we started a business, because we started as an open invoice business, we needed to produce an invoice at the very beginning of our life as a company. That meant we needed SKU-level details on every purchase.\nAs you know, when you process a transaction on Visa, you don't get that. You just get the amount and the merchant name. In our case, we know exactly at H&M, you bought this sweater of this color of this size, et cetera. Today we even show you images of the items that you bought.\nBen: There are two really interesting things here that are simultaneously happening. One is the strategy thing that you're talking about. When you started with SKU-level data, it just lends itself better to, well, great, now we're going to have more data.\nThe other thing is literally just technology advancing. We're 50 years past the origin of credit card networks. You just couldn't actually run that much data over the networks, and now the networks are what the networks are. It's I don't want to say impossible for credit card networks to retrofit and get SKU-level data, but it's a hard task to roll that out to the entire network simultaneously.\nSebastian: It very much is.\nDavid: I'll let you keep going, but I'm still like, how do you get that data with the Klarna card now that so many users have the card?\nSebastian: You're right. The point is that Visa and Mastercard tried it in the 1990s called Level 3. They had Level 3 data. They tried to convince some versions of it, but it was very difficult. This is again where a four party network will suffer, because a third party network like American Express, Klarna, or PayPal, has the ability to be close, like if we get SKU-level that are from merchants, we can instantaneously make sure that it's visible to the consumer and the consumer can see the value of it.\nThe problem with Visa and MasterCard is that even if merchants would share that data with them, they need the banks to change all of the banking apps to start visualizing and showing that data. You really get this catch-22, where it's so difficult to drive innovation when you have so many parties involved. Each one with their own self interest, their slowness in adaptation, et cetera. It's one of the reasons I think it never worked.\nThe other reason is trust. The amount of time I had to spend with the top CEOs of US retailers to say, hey, trust me with this information, trust me with that, if it's Macy's, Sephora, H&M, or whatever it is, I've spent so many hours, like, why should you be comfortable with sharing SKU-level with Klarna. How is that going to benefit you as a merchant? There are a lot of aspects to this.\nWe realized that this is something that when utilized in the right way with the consent of the consumer, it can actually create tremendous value that's helpful. I think that was one.\nThe other thing is we said, well, look, other people will figure it out. We already said back then, if we're going to go down this consumer path, and we need to build a brand as well so the whole smooth, the pink, and all that became very important for us, but we just said, look, there are going to be three parties that we're going to compete with. It's going to be big tech. Apple is going to try, Amazon is going to try, Google is going to try to be in this space.\nSecondly, there's going to be fintech, Revolut, Chime, NewBank, whatever. Then there are going to be the traditional banks, Goldman Sachs doing Marcus or whatever. It's very clear to us that it will be these three categories of companies that will try to aspire to do similar things that we're doing. The only thing that we can try to do is be faster, better, smarter, move faster, innovate faster, and try to do this differently than the others.\nEventually, and I’m still very committed to this, I think in a few years, you will see out of all of this emerge, three or four really large global players in the space who are basically being that digital financial assistant of customers. That will be a very valuable position to have. That is basically what we're trying to do.\nDavid: How does this work with in-store at Stonestown?\nSebastian: I'm not a big fan of management literature. I think a lot of it is very general and high level and of low value, but I read good to great. There was one thing that I liked in good to great. One of their conclusions was don't bet on a single technology. I really liked that.\nHow we tried to introduce that in Klarna is we said, look, it's fantastic if we can grow this third party payments network that has SKU-level data, but it's also a problem for our consumers that they're limited to using Klarna only where Klarna has been integrated at point of sale or at the merchant. Can't we try an even more difficult approach, but also an interesting approach?\nWhy don't we enable it through multiple different technological solutions? A card is one way to allow you to use Klarna everywhere. You have the disadvantage of not getting SKU-level on those particular transactions, and then you're faced with the complexity of explaining in the Klarna consumer app, why do I see images of my purchases on this one but not on that one and so forth. You have other complexities that arise from that. But there's a benefit to exploring the concept of using Klarna everywhere.\nThis was also funny enough, one of the most critical aspects of the US, because what ended up happening is we missed out on the US opportunity. Suddenly out of nowhere, Nick and his team from Australia came and signed Urban Outfitters in the US, and started gathering very significant momentum.\nBen: Was that the start? Urban Outfitters?\nSebastian: It was, yeah. I think Urban Outfitters was the big first. We were part of that RFP. We didn't have the right people in that call, and we just missed the opportunity. We could have won that RFP.\nDavid: That was the first one of Affirm and the Boosted Boards. I'm buying a $1000 skateboard. The Urban Outfitters, Afterpay, that was the first like, I'm buying a $10 t-shirt.\nSebastian: Exactly. I think Affirm at that point in time had had a lot of years. Affirm started a long time ago already, but Affirm was so focused on the high ticket purchase items. I think they were very late to the game on paying for stuff. They didn't really see that, and it took some time for them to also try to go after this opportunity.\nI remember very clearly, we came to the US in summer 2019, and we started seeing the traction of Afterpay and buy-now-pay-later. We were like, no. That's pretty much it. We're like, no, we're going to miss out. Finally, there's an opportunity for us to actually establish ourselves.\nAgain, coming back to that AI vision, we realized that we have to make it in the US. There's no scale if you don't make it in the largest market in the world. You're not going to reach scale, so it was super frustrating to us.\nThe other part was we picked up. I was like, okay, we got to do this. We got to do the paying for it, and we basically got it live very quickly. It took us two or three months to get it to market in the US. Then we had a big problem, which was that we started talking to all these merchants. We show them like, because we've been doing this much longer than Afterpay, we had a much richer product, much richer features. We had so many great things, our brand and everything, but we had a very difficult dilemma, which was you don't get fired for choosing IBM.\nAt that point in time, Afterpay was already gaining momentum. It was clear that if I'm a chief officer of ecommerce at some big brand in the US, I'm like, okay, Klarna had a nice presentation, seems to have an awesome product, but the others have already picked off the pace, so I don't want to get fired for choosing the wrong provider. I'm going to go with a market leader in their opinion. That was a very difficult situation for us.\nI thought it's probably one of the most difficult things I've ever done as a founder and a CEO. It's one thing to come into a market and only compete with incumbents and traditional players. It's a very fascinating and interesting thing to come in and compete with somebody like Nick and his team who are themselves founders, entrepreneurs, super fast moving, super aggressive, super smart. It was just the most awesome challenge I've ever had in this job. It was just so much fun.\nDavid: And then the Black acquisition happens, right?\nSebastian: Exactly, but that was a few years. Actually, we realized that nobody wants to go with the second one. Everyone wants to work with a winner. We asked ourselves, how could we create a perception of winning without actually winning? That was the challenge.\nDavid: That is the ultimate entrepreneur's task.\nBen: If you figure that out, please let me know.\nSebastian: What we realized is that they were ahead on the merchant side, meaning that every meeting they would bring a slide with more brands and logos on that we could bring for the US market. We could fake it a little bit and bring some of our European brands that were international to make it look better, but the Afterpay sales guys quickly shut that down by training the merchants to ask, how many of those actually live in the US? That worked only very shortly.\nWe were looking for like, how do we solve this? We concluded that we had had this idea for quite some time. The idea was our app, the Klarna app could function not only as a transaction history just like your banking app where you can see, okay, here are my purchases, and we had a nice images of what you purchased, but we had this idea of creating a browser and using virtual cards as a way for you to shop with Klarna where Klarna was not available.\nWe launched our browser. The browser is part of our app still, and it basically allows you to go to any website. Let's say you go to Amazon as an example. Klarna doesn't work with Amazon in the US, but what you can do in the app is as a Klarna user, you can generate a one time Visa card, and then the app will basically enter the card numbers into the Amazon checkout.\nAs a consumer, it feels like, thanks for using Klarna browser, you can now shop with Klarna on Amazon. You can pay in four with Klana, you have the payment methods. Also, because we control the browser experience, we can actually collect SKU-level data out of that transaction.\nIt gave us this idea that, you know what? Maybe we can't win with Afterpay on the merchant side, but we can win on the consumer side. Basically the pitch ended up being, we had one slide, which was App Annie downloads. We made sure to always have more downloads of our app than Afterpay. That was like, look, we have more downloads than them of our app.\nThe reason for that is you go to Urban Outfitters, you use Afterpay, but then you can only use Afterpay at the merchants that are integrated. Even if they've had some success and they have some merchants, it's still limited.\nKlarna, you go to H&M, you try Klarna out on the H&M website, and then you can use Klarna everywhere on every online retailer in the US. Who do you think the consumer will choose? We just said the consumer is choosing us, and we had all the data to support this claim. The merchants were like, maybe I should go with this winner instead of that winner.\nDavid: Interesting. By doing this browser hack, did you then capture the SKU data because it was happening in your browser?\nSebastian: Yes. The funny thing is it grew immensely.\nDavid: You got klarna.com still today and it's like, oh, you can shop on klarna.com, right?\nSebastian: We do over $10 billion worth of volume on that browser, so it's a huge business. It actually became very popular with the consumers as well. It was just interesting. That managed us to then, we signed Sephora, we eventually got Macy's, and so forth. That started turning the tide towards Klarna and the US away from Afterpay. Not entirely, I mean they've been successful as well, but the point is that at least it made a huge difference for us.\nBen: We've got a lot of founders that listen to this show, and you've had an epic journey. You're still a private company. It's been 19 years. You've had multiple business models, multiple management teams. You raised a lot of money in the headiest of times the world has ever seen from the headiest of players who were investing at the time. You had quite the valuation. Now you have a different valuation. You were in the news quite a bit a couple of months ago for board-level corporate governance stuff.\nSebastian: We internally refer to the succession drama.\nBen: The succession drama that played out, yes. Truly, new reporting twice a day with here's the latest on the situation. You were in Sauron's eye for a week there. What advice do you have for founders? Maybe let's start there with the succession drama and work backwards of in-company building, you have these crazy moments along the way.\nDavid: You've seen a lot of chapters.\nSebastian: I don't know if there's any good general advice that can be had from that. I think at least one thing has changed. I always try to be very humble about the fact that I've gone through a rollercoaster with this company. There's been tremendous success and tremendous challenges that we faced. Some of which are well-known, some of which are less well-known.\nI think over the years, at least something that has developed within me is the fact that whatever challenge I'm faced with today, as much as I can be very, and I really want to say this from the bottom of my heart, I can be desperate. I can cry. I can feel, oh, my God, this is so difficult or so hard, or I can feel it's unfair, or whatever the emotions that you get into, and I can feel desperate and I can feel confused. How the hell am I going to solve this situation, or what am I going to do about this?\nI obviously get all of those emotions still, and I've always gotten, and I think everyone else that is sane does in such a situation. I've also, over the years, started breathing a different emotional state. That is a little bit of this is what I trained for.\nI often think about Zlatan Ibrahimović, the best soccer player in the world who happened to have come from Sweden and was born on the same day as I was. If you are playing football at that level, your dream is to play the champions league final. That's the dream.\nThat's not an easy game. That's a freaking difficult game. The psychological pressure, the audience cheering against you if you're in the wrong arena. The pressure, this may be the peak of your career, all of these things going on, but at the same time, would you rather not play that final? This is what I was trained for.\nTo me, what I've started to think more commonly in these situations is like, whenever I feel under massive pressure, I take Queen, I put on Under Pressure in the car, I put it on maximum, and I just enjoy the moment. I enjoy the feeling of like, you know what?This is what I've trained for. This is my 20 years of work. It has come to me, now trying to see if I can figure this situation out. I may very well fail, and that unfortunately is the way it works.\nThere was an amazing Netflix documentary about everyone participating in the Tour de France, all these different teams, and how hard they trained for that and so forth. But there was also this thing that at some point in time, the race is over. The world keeps spinning, there's a new day, and things work out. I think people in sports have much more recognition of the fact that there is that huge final game, and then the next day the world keeps spinning. The same applies here.\nI'm not saying that it makes it easy because it's not, it's really difficult. Again, as I said, all the other things are true, but I've also come to some degree to say, this is it. This is what I trained for. I wanted to be in this difficult situation. I want to see if I can master this situation, if I can solve it, if I can resolve it in a good way. To some degree, I also started to cherish the fact that I have the privilege of being challenged to a level where it's sweaty.\nI laugh about that a little bit because at the peak of Klarna's valuation, when we were officially Europe's most valuable fintech and the company was worth $50 billion, even though at some point in time, you're like, hey, when valuations are growing faster than revenue and profit, then you have to realize that at some point in time, there may be a correction in the market.\nBut when I was there and I was invited to Downing Street to have dinner with Boris Johnson, and then I flew the next day to go and see a conference where Elon Musk was there, Kim Kardashian, and whatever, a very small private conference, I was thinking to myself, like, is this what life is going to be like now?\nThree months later, the company valuation is $6.5 billion. We can't raise money. The newspapers are writing about how we're a failure and will be the next WeWork. It's obviously horrible to some degree, but it's also like, wow, I'm living again. This is not just me. It's for real.\nI'm not saying I wanted it. I don't say I planned for it. Obviously, maybe if I would have been smart, I could have avoided it. Once you're in this situation, you just have to make the best out of it.\nBen: Do you think that's actually the case? Let's take the big valuation haircut in order to raise the money, you needed the time, or let's take the board strife recently. Weren't you always just doing the very best, most forward-looking thing you could at the time? How could it have played out differently?\nSebastian: No, I think that's true to some degree. Some of it is true because one of the things, for example, that people tend to forget is the company was profitable up until 2019. We actually made a profit every year. We still raised some money because we were growing a balance sheet, and we need equity to support that balance sheet.\nBen: You were profitable in those years when you were raising hundreds of millions of dollars?\nSebastian: Yeah. Actually, it's a little bit misquoted because the media hasn't separated between secondary transactions and primary. A lot of the initial announcements of Klarna fundraising were actually secondary transactions, and we weren't raising that. I think I was one of Sequoia's most—I hope I was, or I've been implied that I was—capital-efficient investments for the first 10 years.\nAs we decided we were going to go all in on the US, and we were going to expand much faster into new markets and so forth, at that point of time, we started investing heavily. We reached a state where our worst EBITDA month was a negative $150 million, which basically on an annual basis meant about a burn rate of a billion dollars.\nThat is obviously a massive amount of money, but to your point, Ben, at that point in time, investors were cheering us on and giving us a valuation of $50 billion, which meant that actually $1 billion of loss per year was a 2% dilution per year, which is very low. A 2% dilution is very low for trying to achieve that big opportunity.\nI think there is validity still to the fact that we are operating in one of the largest addressable markets in the world, payments and financial industries, like a trillion dollar opportunity. It's not unthinkable that a company in this industry could be worth hundreds of billions or even a trillion dollars eventually.\nDavid: Like Visa.\nSebastian: Exactly. It's not unthinkable. To some degree, it made \"sense\" in the word. With that said though, I still obviously, as a healthy individual, as a healthy human, reflect back and say, was every decision sane? Could some of the decisions have been made differently? Particularly in my opinion, I should have been more careful about hiring.\nMost of the marketing spend, the investment we did in marketing and market expansion support, that I don't regret at all. I feel that we expanded too fast in hiring. We should have been a little bit more careful about that. That, I regret. There are regrets that I have.\nDavid: I imagine also there was a big element of the Bill Gurley saying of like, you got to play the game on the field. You've got Afterpay playing a game on the field there, and it's like, well, you're going to play that game, or you're not going to play that game and you're not going to be relevant.\nSebastian: That's exactly it. That was so clear to me. I think in 2016 or 2017, we had a $2 billion valuation. In 2019, we got $5 billion because Dragoneer actually believed that we had a chance in the US, even though Afterpay was kicking our ass. Then a year later, we got a $10 billion valuation because Silver Lake said, not only do you have a chance, but you actually seem to be outperforming Afterpay. Then a year later, we got a $30 billion valuation because the investor says, no, you're actually far ahead of the game, and you're making really, really well on that. That was the narrative that played into that.\nI think to your point, it's always easy with the benefit of insight to say, yeah, this, that, and so forth, but you're trying to make the best out of every situation. You're trying to make the best decisions that you can.\nIf I look at the fact that the company is soon going to do over $3 billion worth of revenue and it's this size after 20 years, I think it's still a fairly successful company, and I think it's an okay achievement. I think that you have to look at it from a longer perspective. It doesn't mean that there weren't mistakes that were done along the way.\nDavid: What you said a minute ago about hiring AI and the future, I think we have to talk about that before we wrap up. You've set the stage with AI as the vision for the industry for the future, but it's also here now. Tell us about what you're using AI for the stuff you've been in the news for recently.\nSebastian: Actually, it also partially relates to the challenge that I said in the champions league stuff. I read Elon Musk's book. I didn't read all of it, but I read some parts of it. There was one thing that stuck with me actually, which was that I've thought about Elon Musk predominantly from the perspective of like, it's amazing. He's building electric cars, rockets. I can't even compute how you can be active in all these different areas and create these tremendously successful companies. It's just mind blowing to me, it's so inspirational.\nObviously he has everyone, he has his pros and cons, and his challenges just like everyone else. Anyway, the one thing I truly reflected on reading that book was the fact that he's a freaking cheap bastard. He is so cost-conscious. Do you think about it? Everything he talks about through that book is cost.\nYeah, you know, NASA when they build a rocket, they have an air conditioning unit that costs $3 million, and we went to Home Depot and bought one for $5000 and it worked as well. There are all these things. He doesn't do that on a single occasion, he does that across the board.\nI saw recently, some people presented to me the numbers of SpaceX. It's a freaking profitable company with high revenue growth. It was just so impressive. I thought to myself, with Klarna, I have first been part of growing this company with others as a profitable company growing first. We invested much more, we had our loss making years, and now are really being funded by VCs and investors.\nNow I just think that the ultimate challenge is a revenue line that goes up and a cost curve that goes down. That must be the ultimate accomplishment if you can accomplish those two things. With that said, AI is definitely an enabler of that.\nAt the same point of time, I want to be mindful. Klarna currently has about 4000 people. Part of the cost reduction we can find is doing more with less. At the same point of time, I think it's the most painful, difficult, challenging, and sad thing to go through layoffs. I think it's very difficult. I would rather never have to do it again in my life if I could avoid it.\nBut we do recognize the fact that as every tech company, we have a retention rate. We're about 20% leave the company every year because people in general stay 5 years, which is pretty typical for tech. That basically means if we stop recruiting, the company will shrink by 20% per year.\nThat's what we're managing towards right now. We stopped recruiting in September and October. Since then we're not hiring. We're hiring a bit on the engineering side still, but in general, we're trying to not hire at all. We're reapplying and rethinking our organization and structure as we go to manage it down. We're trying to do that in a thoughtful way, but it allows us to not have to lay off, which we really want to avoid.\nWe're using AI in all sorts of areas to figure out how we can do more with less. It's fascinating because you do realize that when you've been growing this fast and you've been hiring at that pace, there's so much duplication internally. There are so many people doing similar things in slightly different fashions.\nIf you can figure out a way where you can have people contribute to each other's work and build on top of each other's work, rather than constantly reinventing things from scratch, redoing things, or spending too much time doing manual stuff, then that obviously would make for a much more successful, inspiring, and fascinating company. I think AI is extremely well-positioned to do that now.\nOne of the areas that's been the one that we have been most publicized for was as we started exploring this within customer service. Outside of the 4000 people that Klarna employs directly, we have in general had about 2000–3000 agents that are employed by customer service companies that we hire as suppliers, and then they help us with customer service errands.\nWhat we realized was that there was an opportunity obviously to become less dependent on that and introduce AI into that mix. Again, to some degree, that's always what product development has been about.\nBen: Technology is a deflationary force. It improves the productivity of an individual to make it so that any individual human can create the most economic value possible.\nSebastian: Right. I think in addition to that also, if we, before AI, tried to make our app easier to understand, easier to navigate, or added features, part of the intent of that was obviously that less customers would feel that they had to call us to resolve an error and that they could solve it themselves. That wasn't just because we wanted to reduce costs of customer service, but it was also because consumers want that. They don't want to necessarily call customer service for everything. They want to be able to resolve it themselves, just do it, and have a simple app.\nTo some degree, a lot of product improvements have already been correlated to higher efficiency and less errands. The only difference this time around is when we started applying AI to actually deal with customer service errands directly as an alternative to human agents, we had two major breakthroughs.\nOne major breakthrough was when suddenly the customer satisfaction of the human who had interacted with AI versus the human agent was on par. That was a huge breakthrough.\nEveryone hates these IVR systems, like press one for this, press two for… Nobody thinks that's a better experience than a human agent. The same is with the chatbots online, like, oh my God, you tried to ask a question, it's some insane, stupid answer. We've all had these bad experiences. Suddenly, we could actually construct a model that allowed us to create an answer that the customer satisfaction was on par. That just was mind blowing to us.\nWhen we saw that, we were like, okay, let's now launch this across the board. Of all the product features I've ever launched in this company, I've never seen anything that we pushed a button, and it removed the number of errands that our humans had to deal with by two-thirds. Two-thirds were taken over by the AI and then one-third was left with our humans. That was a surprise to us. It's just such a dramatic effect on a single feature release.\nFortunately in this situation, because of the human aspect of this, the fact is that we have been using customer service companies that, in combination, employ probably over a million people, the fact that 700 full-time agents were less needed by Klarna now. Would in that case just mean that these agents would now work for some other clients of these huge customer service companies? But these companies employ a million people.\nDavid: It's not like you were laying off 700 people.\nSebastian: No, exactly. It's not like those companies will have to lay them off either because they will just deploy them. There's always been fluctuations, where different clients of those customer service companies will have this.\nIn the short-term, there's no implication for anyone's job. It's just an implication that Klarna has a lower cost of customer service and a higher customer satisfaction, but obviously we also felt obliged from a more human perspective.\nWe wanted to actually share this because we said, look, obviously if other companies start copying and doing similar things. There will be real-time implications for those jobs. Over time, it won't be any other client to just shift over to.\nWe felt that so far, most of what we've seen in AI has been more like beautiful demos, beautiful prototypes, and this and that, whatever. Like, hey, I'm going to have ChatGPT write all my emails. You do that a few times and then you're like, yeah, but I didn't really like this email, so I'm going to type it myself.\nDavid: You spend more time reworking the email then.\nSebastian: Exactly. We haven't seen that many real life business implementations that were of that size that actually produce such significant outcomes. We felt that we wanted to share it with the world and say, look, we've actually been able to do this, and this is the outcome over time to also encourage politicians and society to consider what are the implications of this because it will eventually have implications. That's been very fascinating to follow, obviously.\nDavid: In Silicon Valley, at least, early stage founders, I've noticed for the last close to 10 years, especially people who worked at bigger companies before, they always have this dream of like, I'm going to start a company, I'm going to be like Instagram. I'm going to be 13 people. I'm never going to have a big team. I'm never going to scale. I don't want the complexity. I don't want the manpower. It's never actually been true. You never could really do that.\nSebastian: Maybe with the exception of WhatsApp.\nBen: Right. I was going to say, Facebook bought both of them.\nDavid: Yeah. Facebook bought the two of them that did it.\nSebastian: And then scale them up to hundreds and thousands.\nDavid: Exactly. Now for the first time, I hear that from founders and I'm like, well, that might be true. That might be true now, or at least it's a lot more true than it used to be.\nSebastian: I think that's true. I have this thesis, which I call Tigers, which is that within 6–12 months, we will start recognizing a few companies that have really taken AI to the core of what they do, have really reimagined how they work, how they ship code, how they ship product features. I think that what you will start seeing is those companies are accelerating ahead in specific industries.\nI'm pretty excited about what I see Brian at Airbnb sharing and what they're doing. He might very well do that in that industry. There will be others, and I hope the Klarna will be one of them. I think what you will see is that these companies will produce higher revenue per MP than we have seen historically ever.\nIf you look at a company like Klarna, we used to operate at maybe $0.6 million of revenue per MP. We're now at almost $1 million in revenue per MP. Apple and Netflix are at $2 million. It's only really the old companies that operated $6–$7 million of revenue per MP.\nYou will start seeing these companies operating at $5–$10 million of revenue per MP. Goldman Sachs is $1 million, Visa that you referred to as I think is $1.1 million. That is the metric that I'm keeping in the back of my head when it comes to how this will evolve.\nI think those companies will also be much faster at getting new services out there. They will improve the quality and the pace of their software development. You can AGI and all that stuff, whatever, when that happens. Who knows? The point is that I think in the shorter terms of 6–12 months, you're going to see some companies pick up the pace. I think it's going to be revolutionizing.\nI genuinely believe this is going to be something very different because if I am that traditional bank as an example, and I'm trying to compete with this, I just don't understand how that's going to work. I can't compute. How am I going to do that with the decision-making process, the slowness, and the technology stacks that they sit on? It's just going to be very, very difficult.\nWe're going to see a massive revival of fintech. I think you see the early signs of it, just look at what Newbank is doing. Even companies like Dave that I was a big fan of and then got highly criticized, but now it seems to be doing quite well. You see Monzo in the UK, Revolut is doing fantastic. I think in 6–12 months, people will talk about the revival of fintech as an example in that industry, but there will be other industries as well where you will see this happening. It's going to be very exciting, interesting, and challenging. Maybe I haven't played that champions league final yet, maybe still ahead of it.\nBen: Sebastian, we expected to have some good discussion in the payments industry. This is a whole new chapter that you opened up at the end here. We'll have to have you back on the show in the next 6–12 months, or at the AI pace, maybe in the next 2 or 3 weeks.\nSebastian: Yeah, exactly.\nDavid: We got tiger. I like that. We'll credit you with that term. It’s much better than unicorns.\nSebastian: Exactly. That’ll be fun and interesting to watch. Well, thank you so much for having me.\nDavid: Thanks.\nBen: Sebastian, appreciate it. And listeners, we’ll see you next time.\nDavid: We’ll see you next time."
}