{
  "url": "https://www.acquired.fm/episodes/ikea",
  "title": "IKEA",
  "heading": "Fall 2024, Episode 3",
  "date": "November 17, 2024",
  "description": "The Complete History & Strategy of IKEA‍\nIKEA may be the most singular company we’ve ever studied on Acquired. They’re a globally scaled, $50B annual revenue company with no direct competitors — yet have only ~5% market share. They’re one of the largest retailers in the world — yet sell only their own products. They generate a few billion in free cash flow every year — yet have no shareholders. And oh yeah, they also sell hot dogs cheaper than Costco! (Sort of.)\nTune in for an episode flat-packed with counterintuitive lessons about how this folksy mail order business from the Swedish countryside came into your living rooms (and bedrooms and dining rooms and kitchens and bathrooms and patios and garages and backyards) all over the globe!",
  "transcript": "Ben: Welcome to the Fall 2024 season of Acquired, the podcast about great companies and the stories and playbooks behind them. I’m Ben Gilbert.\nDavid: I’m David Rosenthal.\nBen: And we are your hosts When you’re running an in-person retail establishment, you know one thing for sure. If people are going to buy your products, they have to be in your store, and more time in your store generally means they buy more product. What is a great way to increase time in-store? Meatballs, David, meatballs.\nDavid: Meatballs and hot dogs.\nBen: And hot dogs. We’ll get there. Listeners, today we dive into IKEA, the company that sells over a billion Swedish meatballs a year and a lot of furniture and homewares to go with it.\nIKEA is an 81-year-old company. People visit their stores nearly 900 million times a year. And it’s quirky as hell. If you’ve ever shopped there, you’re familiar with the crazy maze of showrooms.\nDavid, I spent five hours inside the Seattle store last weekend. I went there to prepare for this episode. I didn’t realize that I was going to spend the whole day there, but that’s what happens when you go to IKEA.\nDavid: God bless you. Did you make use of Småland?\nBen: I went with a friend who had a kid old enough to take advantage of Småland, so yes.\nDavid: Nice.\nBen: Perhaps you know the relationship test of, can you make it through IKEA together? And that’s just at the store. Then you get home and you have to assemble all that flat-pack furniture you just bought. But the furniture, it does look good. Even though it’s extremely inexpensive and you do have to build it yourself using the funny diagrams with the funny little man and the funny labels, it ends up looking pretty good.\nDavid: Hell yeah, it does.\nBen: And the results of this crazy stew of ingredients is that IKEA has become the world’s largest furniture retailer and one of the largest retailers, period. Today, we’ll examine why it has worked so well, how its founder became the 8th wealthiest person in the world before shifting his ownership into a foundation, and how all the little innovations have just added up and refined the concept along the way.\nWhether it’s the POÄNG chair, the LACK shelf, the BILLY bookcase, it is very likely that you have something from IKEA in your house right now. This is the story of a mission to create simple, well-designed, low-cost furniture accessible to as many people as possible, taken to its absolute logical extreme.\nDavid: Totally.\nBen: Well listeners, after this episode, come discuss it with us on Slack and check out ACQ2, our second show, where we just had Luis von Ahn as a guest, the CEO of Duolingo.\nHis company story is pretty unlikely, given most investors assumed you could not build a large business in either the education or language learning market specifically, and Luis has some of the most practical advice I’ve ever heard for anyone building a consumer startup, and have sent it already to a bunch of friends who are building consumer companies. So go check it out, ACQ2 available in any podcast player.\nIf you haven’t taken the Acquired 2024 survey yet, please do. It is open for another week, and we would greatly appreciate your feedback. Click the link in the show notes or go to acquired.fm/survey for your chance to win some sweet Meta Ray-bans or an ACQ dad hat.\nDavid: We might need to add a POÄNG chair or something to that.\nBen: Actually, that’d be extremely economical for us to offer.\nDavid: Yes, it would be cheaper than the Ray-bans.\nBen: Maybe we’ll even throw in some at-home assembly for you and really gross it up.\nDavid: Well, as we will discuss later in the episode, including delivery and everything that comes with e-commerce. I don’t know if it’ll be cheaper or it will certainly be impacting IKEA’s margins.\nBen: It’s true. Well, before we dive in, we want to briefly thank our presenting partner, J.P. Morgan Payments.\nDavid: Just like how we say every company has a story, every company story is powered by payments, and J.P. Morgan Payments is a part of so many of their journeys from seed to IPO and beyond.\nBen: With that, this show is not investment advice. David and I may have investments in the companies we discuss, and this show is for informational and entertainment purposes only.\nDavid: Unfortunately, there is literally no possible way for us to have investments or for any human being to have investments in the companies that we discuss here. But we start in the small town of Älmhult, Sweden, which is in the province of Småland, which despite its name is not so small, but rather a large rural area in the south of Sweden, not too far from Denmark.\nSmåland, again, despite its cutesy, friendly IKEA-like sounding name, is a pretty tough place. It’s rural, it’s agrarian. The soil is pretty barren. It’s really rocky. There are a lot of forests and timber. Timber wood, foreshadowing maybe one day what will come out of this province in Sweden.\nBen: It’s also cold.\nDavid: It’s Sweden. It’s really cold.\nBen: Tough place to grow up.\nDavid: Totally. The farmers in Småland, though, really have to work hard to scrape out their existence. There’s actually a word in Småland called Lista, which means making due with an absolute minimum of resources appropriate to the province and appropriate to IKEA as we shall see.\nSo it is there on a farm in Småland in March of 1926 when our protagonist, Feodor Ingvar Kamprad (or just Ingvar as he is known), is born. He’s born for the region on a family farm named Älmtaryd in an area about 20 kilometers outside of Älmhult called Agunnaryd, which, apologies to all of our Swedish friends if we butchered those. I listened to a lot of pronunciations to try to get this right.\nNow, to give you even more of a sense of this land that we’re talking about, Älmhult, the bustling local metropolis, I don’t know what the population was in 1926, but in 2010 the population of Älmhult, the big city, was 9000 people. That is including IKEA’s major, major presence there in that town today, including [...], the IKEA museum, the IKEA hotel, et cetera. I’m imagining maybe 1000 people live there at this time. Agunnaryd, the area where the farm is in 2010, do you know what its total population is?\nBen: Low hundreds?\nDavid: Two hundred and twenty people.\nBen: All right, so he is in the sticks.\nDavid: This is the sticks. So how did the Kamprad family come to Småland? Well, if you’re perceptive and know your northern and central European family names, you might say Kamprad is not a Swedish name. It’s German. Actually, do you know what IKEA’s largest market is still to this day? It is not Sweden, it’s not the US, it’s not China.\nBen: Germany?\nDavid: It’s Germany. Ingvar’s grandmother and grandfather had immigrated there to Småland from Germany only 30 years before Ingvar was born, so in 1896. Unfortunately, it’s not a happy story. They bought the farm—Älmtaryd Sight Unseen—when they were in Germany from an advertisement in a local hunting magazine. People would joke later that this was IKEA’s first mail order purchase was the farm and moving to Sweden.\nBen: So wait. Why would you buy a Sight Unseen farm in Sweden?\nDavid: Especially a not very attractive place to farm in Sweden.\nBen: This is pre-World War I Germany, too.\nDavid: Yes, so more to the story here. The stated purpose and idea was that they were going to convert the farm from an agricultural farm into a timber farm, into a timber forest. Ingvar’s grandfather, Achim, had been connected to the timber trade in Germany, so idea makes sense on paper.\nUnfortunately though, it doesn’t work out. The next year after they immigrate in 1897, Ingvar’s grandfather Achim, commits suicide. That leaves his grandmother, Franzisca, alone to raise three kids (one of which was just born), and manage this farm. She knows nothing about how to farm. It’s a really difficult farm to operate in a rural isolated part of a country that she’s not from, doesn’t speak the language.\nBen: Totally rough.\nDavid: Really, really rough.\nBen: I don’t know if this came up in the stuff you were reading. Something I read alluded to the idea that Ingvar’s grandfather committed suicide basically out of poverty. His life was so miserable from being totally impoverished, that he was clinically depressed.\nDavid: Well, yes. There’s a little more to the story. Turns out the actual reason for the family’s immigration from Germany was more about Franzisca and Achim’s marriage, and Franzisca’s family. Achim had been from a noble family in Germany, or at least a family with historically ties to the nobility. Franzisca was a commoner and (I think) an illegitimate child born out of wedlock.\nAchim’s parents, in particular his mother, was not happy about this, didn’t approve of the marriage. Part of, or really probably the whole reason for their immigration from Germany to Sweden was to escape this. This is tough.\nBen: So to plant a seed here, there is a strong cultural thing in this family of don’t be poor. Figure out a way to earn a keep, make wealth, deeply ingrained from this.\nDavid: Yes. Really, really bad situation. Nonetheless, the family perseveres, and by the time these children grow up, Franzisca has turned Älmtaryd into a real functional farm. They’re getting by. It’s not going to make them rich, which again, nobody in Småland is rich. They’re making it work and they’ve built themselves into a respected family in the area.\nNow the eldest of these children, the eldest son, Frans Feodor grows up and marries the daughter of the biggest merchant in Älmhult, so bringing now some merchant blood into the family.\nWhen he’s 25, Franzisca asked him (and I don’t think she asked) to come help manage the farm. Frans Feodor and his new wife Berta, they have two young sons, the elder of whom is Feodor Ingvar Kamprad, our protagonist here. They arrive at the farm and this is where Ingvar Kamprad, the founder, purveyor, janitor, soul embodiment of IKEA grows up. Really, we say this on a lot of episodes, but Ingvar is IKEA as we shall see. He is like Jensen and Mark Zuckerberg all in one.\nBen: Singular founder. The company wouldn’t exist but for his exact personality magnified and multiplied into this huge behemoth. You already see the frugality that we’re about to get to the cleverness of being a merchant.\nDavid: The adversity, the chip on his shoulder, all of it.\nBen: Yup.\nDavid: So when Ingvar is super young, like five years old, this merchant side of his DNA starts to come through and blossom. His aunt, the youngest child, the third child of Franzisca, helps young Ingvar buy bulk sets of matchboxes, mail order, from Stockholm, the capital of Sweden.\nLittle Ingvar, 5-year-old, then goes around the countryside selling individual matchboxes to other farms and other families in the area at a 3x markup from what he got them unit price in the bulk package from Stockholm.\nHe writes later, “My aunt didn’t accept payment for the postage. Then I sold the boxes at two to three,” each order is like a penny to a krona at the time in Sweden, “cents each, sometimes even five. The whole mail order package of 100 cost 88 cents. Talk about profit margins. I still remember the lovely feeling from that time selling things became somewhat of an obsession for me.”\nBen: The seeds are sewn of one of the greatest retailers of all time right here at age five.\nDavid: Totally. Sam Walton, Jim Sinegal, Sol Price, Jeff Bezos, Ingvar Kamprad.\nBen: Absolutely.\nDavid: Young Ingvar gets a taste of this. He’s hooked. He goes on. All throughout his childhood, he’s ordering bulk items, mail order from elsewhere in the country, selling all kinds of stuff out to the residents in Småland and the countryside. Christmas cards, wall decorations, garden seeds, random small goods.\nUltimately, he finds a niche and a good business importing and selling fountain pens from other countries in Europe. He’s 10–12 years old at this point. He’s selling these fountain pens so fast that he decides like, oh hey, I wish I had some financing to be able to buy some more of these pens. I know I could make money.\nBen: I have product/market fit. I should raise money.\nDavid: I should raise money. So he goes to the village in Älmhult, and he takes out a 500 krona loan from the bank there, Swedish krona. This is like $63 about at the time. This is in 1938.\nBen: And in 1938 dollars, $63 is hundreds of dollars today.\nDavid: Especially for a 12-year-old.\nBen: Imagine your kid walking down the street and going and somehow going back with $500.\nDavid: That’s also part of this story here. He finagles. I don’t think his grandmother or his parents were helping him with this. So he uses that to import 500 fountain pens from Paris. Then I think they sell quickly. He repays back the the loan pretty quickly. That listeners is the only capital that ever goes into IKEA. That is the only money that Ingvar would ever raise.\nBen: We will flash all the way forward to modern day. Ingvar always owned 100% of IKEA. He built it into the world’s largest furniture store and one of the world’s largest retailers, period, without anybody else owning a single share of the company. No outside financing, no debt financing, nothing.\nDavid: Nothing. They own (I think) all of their real estate today, they own all this. I’m sure they probably use construction financing today, but they have €25 billion in the bank. This is it. This is the background. This is what he comes from. 500 krona loan in 1938, paid back immediately. Only capital that ever goes into the business. Freaking wild.\nBen: Totally crazy.\nDavid: Totally wild. I don’t recall exactly the Walmart story, but even that I think Sam was from family and banks and other folks taking money.\nBen: His wife’s family I believe invested.\nDavid: That’s right. His wife’s family.\nBen: The whole thing gets financed off of cashflow from pens.\nDavid: He literally trades matchboxes to Christmas cards, to pens, to furniture, to IKEA.\nBen: Nuts.\nDavid: It’s like the story of the guy who starts with a paperclip and ends up with not just a house but a city.\nBen: It’s not, though. It’s not really trading. He generates positive cash flow off of the sale of each of those items, then reinvests that positive cash flow in buying the inventory for the next thing. It’s just this, thank God he’s had 81 years to do it. Otherwise, you could never grow to something this large financing your future growth only on the cash flows you’ve generated so far.\nDavid: It’s a good point. Although he is a trader for a very long time, I think that is how he would think of himself. It’s not like he’s getting the better of other folks. He’s creating value. He’s creating value for suppliers. He is creating value for buyers. He’s performing capitalism here.\nBen: That’s just the definition of capitalism. You sell something, you have excess cash flows in the form of profit margin. You reinvest that in growing your business. And he just did that over and over and over again.\nDavid: Okay. In 1943, when Ingvar is 17, he’s about to go off to the equivalent of college at the School of Commerce in Gothenburg, which is a much bigger city in Sweden. It’s actually a city in Sweden. Ingvar decides that before he goes, he wants to officially start a company, a firm to formalize all of his trading activities that he’s been doing, because he intends to expand it while he’s in Gothenburg at school. His import export business shall we say.\nBen: And there is one other thing happening during this period of time in Ingvar’s life. We will come back to that later.\nDavid: So before he leaves, he registers an official trading firm with the county of Småland, and names it very creatively, the natural thing that comes to mind, very descriptive term. He names it his name and his mailing address. Ingvar Kamprad Elmtaryd (Älmtaryd) Agunnaryd. I-K-E-A. IKEA.\nBen: I never put together it was his mailing address. I always knew it was the two initials of his name and the farm and the city.\nDavid: Well I think that was his mailing address.\nBen: That makes sense.\nDavid: This is the countryside here. It’s not like there’s any more to the address than like Älmtaryd Agunnaryd. He doesn’t have a house number.\nBen: So cool.\nDavid: So that’s IKEA, that’s Ingvar Kamprad’s trading firm. This is it.\nBen: And he does put the first IKEA logo sign on a little shed on the property. It’s simultaneously labeling the property by address, then in addition to saying this is where IKEA does business.\nDavid: Which is all part of the lore. I’m not sure how much actually happens in the shed besides he puts the sign up there.\nBen: I think he just stores inventory there.\nDavid: Well let’s talk about inventory. Ingvar goes off to the School of Commerce, and for the first time there he’s able to do what (I think) he intended, which was get access in the school library to real actual trade publications, import-export trade papers and trade publications. He starts writing to the suppliers all over Europe who are listed in these trade publications and asks if he can become a selling agent of theirs in Sweden.\nNow I say agent. At this point, he’s running an actually incredibly capital-light business. Most things I think he is not taking inventory. Some of it he is. He’s storing some pens and stuff, small goods under his bed while he is at college. But a lot of it, what he’s doing is he’s finding and aggregating demand in Sweden and sending purchase orders directly to the manufacturers wherever they are in Sweden or elsewhere, and they just fulfill the orders directly to the customers by mail. It’s pretty awesome.\nBen: The first drop shipper.\nDavid: Yeah, he’s not doing the shipping. He’s just an aggregator for demand. He’s an agent.\nBen: And he never takes possession of the inventory. It’s fulfilled in real time as he gets the order. The supplier puts it in the mail. It’s great.\nDavid: And again, not always. Sometimes, he gets a box of 500 pens or whatever. He’s doing whatever is going to make him the most money and be the right arrangement, but being an agent is the best way to do this.\nHe starts off, naturally he continues the pen business. He goes from fountain pens to ball points. That’s a big hit. Then he gets into wallets, cigarette lighters, file folders, all sorts of small goods.\nAt first, he’s mostly just doing what a lot of other people are doing at this point in time who are trader-agent types. He’s a traveling salesman. He is going back and forth to Gothenburg and to Småland, and he’s selling to customers that he meets mostly out in the countryside. It’s hand-to-hand combat, it’s ringing doors, it’s calling on his network.\nThen, though, he gets the idea. He’s like, well I’m getting all my supplier relationships through trade magazines and corresponding by mail. Then a lot of times when I’m the agent, they’re fulfilling the orders by mail. What if I just get into the mail order business myself? These trade publications are a pretty good way to get business for the suppliers. What if I do that?\nSo he starts a product catalog and he advertises it in publications all around Sweden, with the idea being that, oh, rather than just what I’m limited to doing myself, I can now scale across the whole country. I can aggregate a lot more demand. It actually doesn’t matter if I don’t know these people or I don’t go to these parts of Sweden. The suppliers don’t know them either. It’s all going to work the same.\nHe’s also learned at this point that if he can aggregate more and more demand and get higher order volumes, he’s for sure going to get better prices from these suppliers.\nNow here in the, call it mid-1940s, this is not a new innovation that young Ingvar is coming up with. It’s basically the story of the Sears Roebuck catalog, 50 years earlier in America. This is happening all over the world and there are plenty of other people doing the same thing in Sweden at the time.\nBen: Once you had enough scale to say, hey, I’ve aggregated a bunch of interesting products, you’ve started making a catalog, you mailed out to everyone, and that was your client base.\nDavid: It was the e-commerce industry before the e-commerce industry. Anybody could do it. It was just about aggregating demand.\nIngvar creates a catalog of his wares called IKEA News. Eventually, he publishes IKEA News on its own with its own subscriber base, but at first he’s just inserting it as an advertising supplement in local farming publications all around Sweden.\nBy the end of college, end of the war, like I said, he’s doing really well. He’s doing way better than probably anybody back in Småland. After school, he returns to the farm, to Älmtaryd, and he recruits his family to also start helping him with the business, fulfilling these orders, running all the mail and all that stuff. They’re still just running it on the farm.\nThen in 1948, Ingvar makes a fateful, but again not unique, decision. He decides to add furniture to his catalog. Now, other competitors of his, other rural-focused mail order businesses dealers offered furniture at the time, and that’s actually why Ingvar starts doing it too.\nHe had been shopping the competition, doing the Sam Walton thing, reading all the advertising supplements of all his competitors, and he notices that they start offering furniture. It seems to be working for them. They’re promoting it more and more. He says, well hey, I should try that too. He would joke later it was an accident that he found his life’s calling in the furniture business.\nSo he does with furniture what he’s doing with all IKEA products at this time, which is he goes around, sources some suppliers, and he asks them if IKEA can be their agent to sell their furniture.\nNow, furniture isn’t exactly like fountain pens or wallets. It’s big. You can’t just order a box of 500 armchairs and stuff it under your bed or put it in your little shed on the farm. Really, what you need to run this model is you need local suppliers or at least domestic suppliers within Sweden.\nWell, fortunately as we discussed, Småland is full of timber. And it just so happens that probably because of that, there are a number of furniture makers right there in the province.\nIngvar goes around to local Småland furniture makers and asks if he can be their agent. Like hey, can I bring you more business? And they’re all like, well sure. He’s like, there’s one condition which is you’ll have to deliver the furniture yourselves. Is that okay? And they’re like, well that’s what we do anyway. It’s part of our business. Sure, yeah.\nNow famously—this is part of the lore about Ingvar and probably is somewhat exaggerated—he loved to tell people that he’s dyslexic. It totally serves this lore of, oh, here’s this hardscrabble country retailer. I don’t know how dyslexic he really was.\nBen: Really? This was a thing that I almost thought I was going to stump you because it comes up later in a key moment of IKEA, that he’s dyslexic and it’s why some—I don’t want to spoil it yet—obviously not only do you know he was dyslexic, you’re proposing he may not have been that dyslexic?\nDavid: Well, I read some stuff from some former employees that suggested that it was more part of the legend that he cultivated than reality. But I actually don’t know what you’re referring to. I’m excited to be surprised.\nBen: So it’s why the products are named the way they are, rather than having model numbers.\nDavid: Oh, this is exactly what I was going to say here.\nBen: Okay. It’s like part of the, hey, I need to have a word for each of these things and not only—\nDavid: Oh, yeah. This is exactly what I was about to say. I thought that was like, oh, is there another point later?\nBen: No. Okay, so where are we going here, David?\nDavid: Well, regardless of its veracity or not, Ingvar does not like remembering product numbers and codes and catalog. He decides that he’s going to give a name and not a product code or number to all these furniture pieces. Yes, this is the beginning of IKEA product naming conventions.\nDo you know, though—I actually had no idea until I started researching—what these general naming conventions are within IKEA today?\nBen: I think so. I think different product categories are named after different things, like rivers, and certain furniture is named almost like conference room naming at companies.\nDavid: Yes. Products are usually named after Scandinavian locations. I think Swedish locations are used for sofas and coffee tables, like the core part of the line. Norwegian locations (I think) are used for beds, Danish locations for textiles. Then some of the smaller goods like lamps are season lakes. Outdoor furniture is islands, I think.\nBen: Clever.\nDavid: We got the whole schema here with names. Ingvar, if he truly was dyslexic, would now be having a tough time with all of this.\nAnyway, Ingvar decides that he’s going to start all this off with his named pieces of furniture in the IKEA catalog that again are not his furniture. He’s just sourcing them from local furniture makers like other people are doing. He’s going to start with a test, and he puts three pieces from Småland in the catalog, two armchairs, one of which is an armless armchair (I guess just a chair) that is intended for baby nursing.\nBen: Dude, an armless chair for baby nursing? Sounds awful. It sounds like torture, like that’s the time where you need the arm the most.\nDavid: Hey man. Different era. He writes, “The response was unambiguous. We sold a huge amount of this ‘test’ furniture.” And Ingvar, of course, he’s a trader, he has a nose for business. He’s like, great, what more can we add?\nSo he quickly sources a sofa bed to add to the catalog. Famous IKEA sofa bed, there it is right in the beginning. Then a chandelier, and then all sorts of other stuff. It’s off to the races. Pretty much any piece of furniture or furniture-like home goods that he can get his hands on and advertise in the catalog, it sells like hotcakes. Or maybe meatballs. Is that too much? That’s too much.\nAnyway, now why is it selling like meatballs here? Why is there a huge demand? Before mail order, the only way that people out in the countryside could get furniture that wasn’t locally made right there or passed down from generations but still it had to get made and bought at some point in time, was through dealers like Ingvar used to be like, traveling salesmen–type people.\nAnd they had very limited access to inventory. They were sourcing individual pieces, probably more often than not, second-hand estate stuff or maybe they’re from a distributor or a third-party middleman. Either way, we’re talking super limited scale, very sparse and unreliable product offerings, like you need a baby nursing chair? An armless baby nurse, whatever you need, a dining table, the likelihood that your guy had that in his stock was low.\nThat’s just availability. But then also the pricing. Again, we’re talking about how everybody here is just basically eking out a living. The traveling salesman agent types are trying to eke out a living, too. They’re trying to make as much money as they can. They’re not trying to build scale. They don’t get, oh hey, volume drives prices down, low prices drive volume. No, no, no.\nBen: No. It’s, what’s the maximum margin I can extract for this very one-off random special sale I’m making?\nDavid: Totally. Ingvar, though, because of his history in small goods and as an importer, has got a very different mindset. He knows that oh, selling goods in bulk orders—it’s all the way back to the matchboxes—that’s how he’s approaching the problem.\nHe’s also young. He doesn’t have a family. He can just operate in a very different mindset than everyone else here. Scale doesn’t bother him. He’s happy to try and drive prices down as low as possible, pass that savings along to buyers, undercut everyone else, and get more demand. This is how he operates.\nEven more than that, he realizes furniture is way better than these small goods. Because even though I could sell cheaper, these are still large ticket purchases for people. The absolute number of dollars or krona that I’m going to make on any given piece of furniture, even if I’m selling it at a low margin, is way more than ballpoint pens here.\nAnd not only that, but it’s also selling quickly even though these are high-priced items, because there’s this huge unmet demand in the countryside. People are starving for this stuff. Even better, the logistics and distribution for us for IKEA is just as easy as ever. The furniture makers are handling it all themselves. This is great. Let’s pour resources into this.\nBen: It is crazy. He managed to aggregate demand for something that is very difficult to manage and take inventory of. He managed to sell to those customers without having to deal with the really tough inventory problems. Truly is the first drop shipper.\nDavid: Well as we’ll see, it works for a while, and then it doesn’t. But for the moment in time, the furniture makers love it. Ingvar and the other folks who are doing this have just expanded their market. This is the golden early days for this whole catalog drop shipping industry.\nWithin a couple of months, Ingvar is getting so many orders from customers and so many furniture makers who want to be in the catalog, that he’s like, okay, we got to just focus on furniture. He starts hiring a handful more of other folks beyond just his family to help out. But it’s still a fairly lean operation. We’re talking 10 people or so through the 1940s, they’re still running it out of the farm at Älmtaryd.\nThen in 1949, Ingvar decides to go really big. He starts buying regularly every week a supplement in the big national farmer’s paper in Sweden, which has a circulation of 285,000 copies. I guess we should have talked about this earlier. I’m talking about supplements, advertising. I’m realizing that I bet a lot of our audience has no idea what I’m talking about.\nBen: A supplement to a newspaper.\nDavid: Yes. This is here in America going back to the Best Buy circular in the Sunday paper or the Target circular or the Sears circular.\nBen: I don’t get a newspaper anymore, but I’m pretty sure this still happens. I think this is still a very common advertising channel.\nDavid: Totally. Anyway, back to 1949, Ingvar goes big. He commits to regular weekly publication as a supplement in the national farmer’s paper.\nBen: So before this, when we said people were subscribed to his catalog, how did that work?\nDavid: It worked like all these businesses I think did at the time, which was if you were a customer, you saw something in this advertisement circular in a paper or somehow got exposed to it, you then place an order, you then get placed on the customer list. I think once Ingvar’s got your address and knows who you are, you’re in his CRM so to speak. Now I think you’re getting his catalog directly.\nSo in this first weekly supplement, he specifically appeals to what he ultimately terms this idea of the many. We’ll keep coming back to this. This is super critical to IKEA.\nIn this first national circular that goes out, he writes, “You may have noticed that it is not easy to make ends meet. Why is this? You yourself produce goods of various kinds—milk, grain, potatoes, et cetera—and I suppose you do not receive too much payment for them. No, I’m sure you don’t, and yet everything is so fantastically expensive, to a great extent that is due to middlemen.\nCompare what you receive for a kilo of pork with what the shops ask for it. In several areas, it is unfortunately true that goods that may cost one krona or two krona to manufacture, costs five krona, six krona, or more to buy. In this price list, we have taken a step in the right direction by offering you goods at the same price your dealer buys for, in some cases lower.”\nBen: This is it. We’ll make it up in volume. This is the thinnest margins possible for the many people with an obsession in cutting out middlemen.\nDavid: What’s interesting here is I think this is the first time where he’s by instinct appealing specifically to the low price aspect. Again, almost everybody else was appealing to the selection, the availability of, oh you can finally get furniture. He’s now saying, no, no, I know it’s hard for you out there. I know you’re struggling to make ends meet. I’m going to give you the absolute lowest prices on this stuff.\nBen: Oh yeah. This is worth a pause. Harken back to our Walmart episode. What’s the perfect triangle of delivering a retail product? It’s convenience, price, and selection. What he’s basically saying is price, price, price.\nDavid: Yes, and way better selection than you had in the old model. Convenience, probably not as good, but price, I know you care about price. You are struggling to make ends meet.\nA little later, we’re going to talk about this amazing document that Ingvar writes in 1976 called The Testament of a Furniture Dealer. He’s so folksy. But the very beginning of it, the very first thing reads that the mission of the company is to create a better everyday life for the many people—the many—by offering a wide range of well-designed, functional home furnishing products at prices so low that as many people as possible will be able to afford them.\nBen: That’s it. It’s all right there in that sentence.\nDavid: Yup. Now, the interesting question though here and for the rest of the episode is like we said, Ingvar is not the only mail order furniture company at this point. He has plenty of competitors who are doing the same things and probably catching onto this same idea that low prices are also important. But none of them become IKEA. The next reason why none of them become IKEA is none of them have a showroom.\nBen: Oh yes.\nDavid: But before we tell the showroom chapter of IKEA, now is a great time to tell you about our presenting partner this season. J.P. Morgan Payments. We’ve been talking about how IKEA brought simplicity to a complex and fragmented customer experience. This is exactly what J.P. Morgan is doing for payments.\nBusinesses don’t want complexity or to have to rely on connecting multiple third-party hardware and software vendors together, or to sacrifice stability and security in order to grow their top line. This is why J.P. Morgan invests over $17 billion a year in technology as the end-to-end seamless payment solution to handle everything from payment acceptance and processing to security to reconciliation, so you can focus on running your business.\nBen: Exactly. Since we’re in IKEA land, let’s zoom in today on retailers, and specifically on a product that most of you are very, very familiar with—tap-to-pay.\nObviously, there’s been a massive shift in the last few years in how consumers expect to seamlessly use their phones to check out. Well, J.P. Morgan payments enables this as part of their omnichannel solution that’s likely been running under the hood in many of the in-person checkout experiences that you’ve had. We’ve reached this tipping point where 50% of global in-person transactions are now contactless, and it’s totally essential for companies to offer a great tap-to-pay experience.\nDavid: I honestly love this and I’ve been preaching the virtues of tap-to-pay for years now.\nBen: Listeners, I can vouch for that. David was a very early adopter. When we would go on morning runs—I think actually back when you lived in Seattle—you’d only bring your watch even when we were going to go get breakfast together afterwards. I thought this is crazy.\nDavid: Yes, it’s great. It’s great for everyone. For merchants, they can easily accept debit and credit cards from the NFC-enabled digital wallets on smartphones. For employees, it’s great because they can seamlessly complete payments from anywhere in the store. Of course, for customers like us, it’s great since they get a transparent and secure transaction and pay more conveniently.\nFor anyone who is at our Chase Center show, this is the exact experience we used for the roaming hawkers selling the hats. You got to experience this firsthand, and the results were pretty insane. We found out after that they sold 1500 hats in under two hours with a 100% success rate, which means zero declines.\nBen: Any business, retail or otherwise, benefits from having a frictionless payment experience. Listeners can go to jpmorgan.com/acquired and learn more about tap-to-pay, and check out other payment solutions driving growth for businesses. Our thanks to J.P. Morgan Payments.\nOkay, so David, how does the first IKEA showroom come to be?\nDavid: As we alluded to earlier, in the early days of this mail order furniture catalog circular–type business model, it’s the golden era. Everybody prospers. Consumers are happy, furniture makers are happy. There’s room for competition. It’s all greenfield. Everybody’s going after new customers. Nobody’s stepping on each other’s turf. Inevitably though, as we get into the early 1950s, competition gets more intense among these mail order businesses like IKEA, and price wars start.\nThis is the next chapter. The thing about mail order was yes, it enabled scale, which enabled selection, which enabled low prices, but there was no governor on quality. What I mean by that is that anybody who had a mail order business could take attractive-looking photos of their furniture and home goods, stick it in their catalog or their circular advertisements, and say oh, buy my beautiful-looking furniture at this really, really attractive price. Those photos may or may not have any bearing on the reality of what the furniture actually was when it arrived.\nBen: Not to mention, you basically had no recourse because at this point there weren’t modern credit cards. It’s not like you could charge back. There weren’t 2024-style returns infrastructure where you could just get your money back by sending something back weeks or months after it was delivered to you and get a full refund. Nobody was building these big, global brands that were trustworthy. It was just a matter of which small, local circular brand convinced you that their picture was worth ordering.\nDavid: I actually don’t know what their return policies are. I hope they’re good. But it’s like the Temu of 1950s Sweden here. The disconnect after a couple of years of this between what you think you’re getting and what you’re actually getting starts to widen.\nBen: Even though Ingvar is focused on quality furniture at the lowest possible prices, the fact that other people aren’t is hurting him because it’s hurting consumer trust.\nDavid: And I can just deliver low prices if I compromise on quality. So he’s searching for a way out of what’s starting to become a pretty brutal competitive landscape.\nOne night, as legend has it, he’s working late with one of his early employees, a guy named Sven Göte, and they come up with a crazy idea. The crazy idea is what if we had a showroom where people could come and they could touch, see, and feel the actual items that we are selling in our catalog, then they could convince themselves, yes, this is the quality, this is the item that I’m going to get at this price. I think if we could just show people they could see with their own eyes, touch with their own hands, they would see that the quality we’re delivering at this price is way better than anyone else out there.\nAnd it just so happens at this moment in time that the local furniture joinery in Älmhult is about to close. He is going to buy the building for 13,000 krona which is about $2500 at the time we’re here in early 1950s. So not cheap, but not that much money. That $2500 investment becomes the first IKEA showroom. We seriously kid you not listeners. The only money this guy ever raised was that 500 krona bank loan.\nBen: It’s nuts. The funny thing about this, it is a showroom. It’s not a store. Our business model continues to be this catalog thing, but we have a place where you can just touch and feel the furniture.\nDavid: I think Tesla does this today or has done it for a while.\nBen: Or Bonobos.\nDavid: Yeah. There’s a store in a mall that you can go see the cars or see the pants, but you can’t take it home. Let’s illustrate why this is a completely nutty idea. (a) There’s the obvious. You can’t take it home. (b) The whole point of the mail order business was that buyers and sellers can now access each other across the whole country. All of Sweden as a market, all the rural areas everywhere in the country. Sweden is a pretty big geographical country.\nWhat Ingvar is doing here, they’re opening a showroom in one singular remote part of this country, in a town with 1000 people who live there. Their business model is to sell to the other towns of 1000 people all over the rest of the country. Why on earth would opening one showroom in one little town work?\nHere’s the thing. By God does it work? I don’t know that the customer base in the town of Älmhult was that important to IKEA itself. People come from all over the country to go to the showroom. This is wild.\nIngvar advertises that they’re opening this for months leading up to the actual opening, which is in March of 1953. All of his customers and everybody getting the circular advertisements in the weekly paper all across the country, they’re hearing about this showroom in Älmhult on opening day in March of 1953. There are over 1000 people from all over the country who show up and wait in line to get in. Take the train, they somehow make their way to Älmhult to see the furniture. They’re not even buying anything. It’s crazy.\nIngvar and the team, they’re so worried about this that they don’t know that the floorboards on the second floor of this old joinery—it’s an old building here—are going to stand up to 1000 people being up there, plus all the furniture that they have as the showroom. They had also advertised in the circulars that they were going to offer free coffee and morning buns to anybody coming to shop.\nBen: The very first time there’s food at an IKEA is the very first time there’s an IKEA.\nDavid: That’s right. There has always, always been part of the concept. But yet Ben, as you say, like there’s no warehouse, there’s no flat-pack furniture. Everybody’s just there to see the stuff. And you could also fill out an order form while you’re there to then buy it by mail later.\nBen: Ingvar has a quote about this. “At that moment, the basis of the modern IKEA concept was created. And in principle it still applies. First and foremost, use a catalog to tempt people to come to an exhibition, which today is our store. Come and see us in Älmhult and convince yourself.”\nHe wrote on the back of the first catalog, two very important words there. Convince. The other one is exhibition. Already they were seeing this idea and the fact that he marketed to the whole country and offered food. We’re not just offering you a store that you can walk into and buy something. We are creating an exhibition.\nDavid: Yes, it is an experience. It’s almost like you’re getting a free ticket to this experience, this exhibition.\nBen: Great retailers have more in common with P.T. Barnum than poor retailers.\nDavid: Totally. Oh my God. I think and Ingvar thinks and he writes this, “This is the very first time anywhere in the world that a mail order business is combined with a physical showroom.”\nYou might think, oh, Sears in the US. Obviously, yeah. That’s a mail order business. And they have Sears stores. No, no, no. They’re different. The Sears stores, you buy the stuff at the stores and you walk out. It’s not a showroom.\nHere with IKEA for the first time, it is that concept you just described, Ben. It’s like we tempt you to come see this exhibition that then you order by mail. I don’t think anybody had ever done this before because again, it was a crazy freaking idea.\nBut of course it becomes an enormous success. Within the first couple of years of the Älmhult showroom store—it’s not a store being open—a huge portion of IKEA’s catalog subscriber base they’ve now formalized it as the IKEA catalog, about half of their catalog subscriber base which is hundreds of thousands of people now at this point in time, make the pilgrimage to Älmhult and they visit the showroom. This tiny little village, hundreds of thousands of people are now coming there.\nBen: And you might ask yourself, what’s the big deal with the catalog? Why are people so interested in getting a catalog? It was really inspirational. It hadn’t quite made the shift yet, but especially in the 60s after Brita Lang took over from Ingvar, because Ingvar is everything right now. He’s art directing the photography. I think he might even be taking the pictures and writing the copy.\nBut it turned into this thing with these vibrant, beautiful living room settings, and people are anticipating the arrival of the IKEA catalog. It positioned IKEA as this brand, this lifestyle. It illustrated a life you could be living if you participated in the IKEA story.\nDavid: That really, really becomes a thing in the 60s with modernity and when the target customer becomes the urban and suburban customer. But here, even with the rural customer, it still works. They lean into this model heavily.\nThey arrange for any IKEA customer to get discount tickets on Swedish railways to make the pilgrimage to Älmhult. Then they also set up this program where customers who come from another location and commit to furnishing a whole house—they call these the setting up house customers—they get free dinner at the hotel in Älmhult that night. This is hokey stuff, but to your point, P.T. Barnum. That’s what this is.\nWithin a year, they pass one million krona in sales at this showroom, which has got to be by multiples the largest business ever built in Älmhult in human history. In 1954, the next year after this has been open, they passed three million krona in sales. I think the exchange rate was about 5:1 at this point in time of five krona to $1.\n1955, they double again to six million krona in sales. The number of IKEA catalog subscribers around the country passes half a million. All this is done with still less than 30 employees, the business still being run out of the combination of the family farm and this one showroom. It’s wild the scale they get to.\nBen: It’s amazing. It’s one of these things that on the one hand we are, how many years into IKEA? Was founded in 1943 and we’re approximately in 1953–1954 here, we’re 10–11 years in. But the thing that is really working is this thing that just got started the previous year, which is the combo of the catalog and the showroom. That proves to be this amazing winning combination that they just realize, oh my God, we need to scale this.\nDavid: Totally. This is, I would say, generation three of the IKEA business. Generation one is just small goods trading company.\nBen: Matches and pens.\nDavid: Generation two is furniture plus catalog. Now we’re here in version three of furniture catalog plus showroom, and that’s what’s really explosive. But here in the 50s, though, the target customer base—we referenced this a minute ago—and the product mix is still geared towards these rural farmland families, like hey, I’m outfitting my farmhouse.\nBen: Yup, and when you look at the old catalogs, you can tell. It’s not this simple Swedish design that we think about as IKEA as today. It’s pretty rugged, robust, heavy furniture.\nDavid: Yes. When the 1960s come around Sweden, like pretty much all of Europe, starts rapidly and inexorably urbanizing. The automobile becomes commonplace, farms are closing down, young people are moving into cities and suburbs. They’re taking jobs in factories, they’re taking white collar jobs, other blue collar jobs.\nI think there was some stat in the IKEA story that during the decade between the mid-50s and the mid-60s, three-quarters of the farms in Sweden closed down. It’s wild. But this is happening all over Europe.\nThe customer base for IKEA and all their competitors starts to majorly, majorly shift. It’s no longer families setting up their farms or taking over the farm from the elder generations. It’s now a whole new lifestyle of modernity in the cities, in the suburbs, smaller houses, modern houses, electricity, apartments.\nBen: Not to mention it’s impossible to do the traditional thing of just passing down the furniture to the next generation, which is how most people got their furniture up until this point because they were living very close to their parents or perhaps taking over the house from their parents.\nDavid: Totally.\nBen: This is, oh, I’m getting an apartment in Stockholm. I need to start from scratch. The furniture needs to be pretty easy to move or put together.\nDavid: Yes, indeed it does. On the one hand, this is a total existential threat to IKEA’s business. It’s like, well your customer base is shifting. The products that you are selling are no longer wanted. They’re going away.\nOn the other hand, there has never been a bigger opportunity in the history of furniture making and selling throughout all of human history than what is about to happen here. IKEA, even though it’s currently serving what is effectively the parent generation of these new customers, with a little bit of adaptation, has the perfect model for these new, young, urban, and suburban families.\nBut to get there—Ben, I know you’re itching to tell this story—there’s one more element of the IKEA model that needs to fall into place. Ironically, even though it is a totally identified core part of the company today, it’s a reaction to competition that drives it. That is designing its own furniture and specifically flat-packing.\nBen: It is astonishing that so far in the story, they’ve been shipping full-sized, fully assembled armchairs in order to get them to your house.\nDavid: Well, remember IKEA’s not shipping it. The suppliers are shipping it,\nBen: But it’s taking up a huge amount. Think about a flat-packed chair that you’re ordering versus a fully assembled chair and how much room that takes up in the truck.\nDavid: Yup. In the early days, this doesn’t really matter to IKEA. Hey, it’s all great. That’s my supplier’s problem. As the business is scaling, though, this becomes IKEA’s problem because it’s a limit to scaling.\nBen: Okay. Where does flat-packing come from?\nDavid: It’s totally intertwined with IKEA taking on the furniture design itself. I said it was driven by competition. It’s not driven by competition because any of the other players do the same thing. It’s actually the opposite problem.\nIKEA has become so dominant in Sweden at this point in time that it’s monopolizing a huge portion of all the furniture makers production output. The rest of the industry starts organizing against IKEA.\nBen: And IKEA is philosophically trying to drive down prices. They want to create the furniture for the many. Their competitors are all trying to maximize margin and have small businesses because the whole furniture landscape, in fact to this day, is very, very fragmented. It’s tons of players serving niche local use cases.\nYou’ve got the whole Swedish furniture industry that’s pissed at IKEA for going to the furniture manufacturers and saying, what’s the very best deal you can give me? And then turning around to customers and saying, I’m going to make very little margin and sell you all of this manufacturer’s capacity at extremely low cost.\nThe competitors are feeling it from both sides. They’re saying, okay, the manufacturers have no capacity to manufacture for me and no customers want my stuff because you’re selling it cheaper.\nDavid: It’s freaking wild. IKEA does not have a direct competitor today in 2024. There is not a single other globally-scaled furniture business in the world.\nBen: Put a pin in it. I have a thesis on why.\nDavid: Ooh, okay. So what do the competitors do? They start locking IKEA out of trade fairs, trying to limit their access to suppliers. They start pressuring IKEA’s existing suppliers into not selling to IKEA. They say, oh, we’re all collectively going to boycott other orders from you.\nBen: And IKEA’s not yet big enough where that fails. That actually works, and the manufacturers just come to IKEA and say, sorry, the collective leverage of all your competitors is too large and we’re not going to serve you.\nDavid: Competitors even go to the Swedish government and they lobby the Swedish government to limit IKEA’s ability to circulate its catalog. I don’t know on what grounds.\nBen: This is like the most European thing ever that that regulation should…\nDavid: This is too good for consumers.\nBen: Yes, exactly.\nDavid: Oh man. We could make a million jokes about European regulation. Anyway, to your point, it starts to work and this becomes a real problem for IKEA. Ingvar, the company, they’re like, all right. Well how are we going to design our way out of this one? Turns out design is the answer.\nThey start going to the suppliers, to the furniture makers, and they say, okay. We hear you that our competition does not want you to give your pieces to us you’re also giving to them. What if we give you a new set of designs for different furniture and you make those designs just for us? Separate line. Open up separate lines. Could you do that?\nMost of them say, well yeah, I think I could do that. This is the beginning of IKEA in-house designed furniture. Now the first “designer” who Ingvar sets to work on this is a former advertising draftsman named Gillis Lundgren. Ingvar had hired him originally to help Ingvar do the set layout and the photo shoots for the catalog as his assistant.\nLundgren starts cranking out sketches of furniture designs for the manufacturers. Then as legend has it, all this is going on, then one night, the two of them, Lundgren and Ingvar, are taking down the set from a photo shoot. Lundgren says, well, he’s putting a table away. He’s like, oh God. This thing is so heavy. What a huge amount of space it takes up. Let’s just take the legs off the table and put them under the tabletop and then we can store all this stuff better.\nIngvar is like a bolt of lightning has hit him. He’s like, oh my God, I have just received the last commandment from God about how to run this business. It’s like, yes, we take the legs off and it takes up a lot less space. My God, we can design these things to come off on purpose. And then when we have our manufacturers ship the tables to customers, they’re going to be able to fit a hell of a lot more of them in those trucks.\nBen: Yup, and it’s apocryphal. I am sure something along the lines of this insight happened. There were many other companies that were doing flat-pack furniture before this, including the company we’ve talked about multiple times on this episode, Sears Roebuck, was flat-packing their catalog distribution in America.\nBut certainly the company that gets credit for popularizing and growing the volume of flat-pack furniture being shipped 100x, 1000x around the world is IKEA.\nDavid: And it’s a nice little story. But I think what IKEA does is they go all-in on this. The first flat-pack product that they design is the max table in the mid-1950s. But by the end of the 1950s, flat-pack and then self-assembly by the customer is expanded across the entire range, all of IKEA’s furniture. Obviously, some stuff you can’t flat-pack, but as much as possible. And because they had, for separate reasons, started doing their own designs with manufacturers, they can do this.\nBen: Flashing forward a little bit to today, it’s interesting to look at all the downstream things that happen from flat-packing. (1) It enables this space-saving in trucks. It enables you to do more volume for the same cost. (2) There’s a cost reduction since customers can do the labor and transport.\nBefore, you had to have someone at your company put the chair together, and that costs a lot of labor. Now you’re putting that on the customer. You’re also making it so the customer has the capability to transport the merchandise in a way that they couldn’t before. They had to have a truck.\nDavid: Mail order was the only way to make this happen. You’re not going to drive away or get on a bus with a table.\nBen: Absolutely. There’s a further cost reduction since it decreases the broken merchandise in transit. There’s this third amazing benefit to flat-packing. Ultimately, they pass all this along to the customers, meaning now their products are definitely the least expensive on the market for their quality.\nAnd psychologically it gives this feeling of accomplishment. It increases your fondness for whatever object you assembled because of the labor, the blood, sweat and tears that you just put into it. You feel like I made this. We almost broke up, but we didn’t. And four hours later, I have the cabinet together.\nDavid: What are the articles I was reading for research? Called it the LEGO for Adults.\nBen: That’s totally right.\nDavid: Another great Scandinavian company. We’ll have to cover it someday.\nBen: I have a fun story for you, David, on flat-pack that I haven’t told you yet.\nDavid: Ooh, light on me.\nBen: There’s another word for this. Do you know what it is? Do you hear it anywhere? It’s an old school retail merchant phrase.\nDavid: Ooh. No, I don’t think I did.\nBen: Knock-down.\nDavid: Ooh, no.\nBen: And it was referred to as KD. In preparation for this episode, I talked to Jim Sinegal, who’s the co-founder of Costco, because I was asking about IKEA and the similarities. He said he used to love going to IKEA to look at the KD furniture that they stocked.\nI thought this was a brand. I was like, oh, maybe this was a brand that IKEA used to stock. At some point I realized in our call, oh no. This is what people used to call the flat-pack is KD furniture.\nDavid: That’s amazing.\nBen: The interwoven this with Costco is really interesting. Another research call was with Bjorn Bayley who ran IKEA in the US in the late 80s. He mentioned that Ingvar always looked up to Costco and thought they were the greatest retailer in the world. There’s a lot of shared admiration there.\nDavid: We’re going to talk about hotdogs a little bit there. You think I’m joking. I’m not.\nBen: All right, let’s go.\nDavid: Before we get there, though, KD, this innovation, knock-down, flat-pack, this is also what enables this shift in the product mix for the new modern, young, urban, and suburban customer who doesn’t want the same furniture, can’t use the same furniture that their parents were using back on the farmlands.\nLegend has it that right around this time as the whole IKEA range is shifting to flat-pack, Ingvar goes on a trip to the Milan Furniture Show in Italy. While he’s there, one of the suppliers, a carpet supplier at the fair, offers to take him around the city. Ingvar wants to see how people live and he is like, sure. I’ll ask a bunch of my employees who work in my urban, modern, mechanized factory here in Milan, if we can just go into their homes.\nIngvar goes into their apartments, and he’s just appalled by the furniture that he sees there and how different it is from the new, modern, city living designs he’s seeing at the furniture fair. It’s all the old, rural, farmhouse, big, heavy, dark furniture that takes up a lot of space and isn’t practical in the city.\nSupposedly, this is the moment when Ingvar really gets religion of like, oh, this is our new customer, and this is our opportunity to design the low price, high quality, affordable furniture for this target market. All these people that are moving to cities for the first time, this is modern middle class living.\nBen: We’re all familiar with the simple Scandinavian design that IKEA furniture is, and it’s become extremely popular. Basically universally adored.\nDavid: I just accept it as the standard of what modern furniture is.\nBen: The question is, is there something intrinsic to simple Scandinavian design that makes it universally applicable, or is it IKEA’s success that now we all look at it and have some reverence for it? It really is beneficial to IKEA that we all like simple designs instead of ornate designs at this point because it makes it work much better for flat-pack, for reducing cost, for making transportation easy.\nImagine chunky, ornate furniture with intricate hand-carved designs still being the creme de la creme of what you should have in your house. It’s basic and expected. It makes the business model work, that it’s these simple designs.\nDavid: I think these things are inextricable. I’m not an expert in design history and people who are might contradict me here, but I don’t think there was necessarily that much about Scandinavian or Swedish design that was particularly light, simple, minimal before IKEA.\nBen: Listeners join us in the Slack. I’m curious if someone has traced the lineage of this Scandinavian aesthetic in a pre-1950s world where this comes from. Who are we all copying? Because there’s definitely some lineage of designers that all this is trying to emulate.\nDavid: Ingmar writes to this, he says, “A design that was not just good,” implied unlike what the Milan factory workers previously had in their homes, “but also from the start adapted to machine production, and thus cheap to produce,” which Ben is exactly the point you were making. “With a design of that kind and the innovation of self-assembly, we could save a great deal of money in the factories and on transport, and keep the price down to the customer.” There it is.\nEntering into the 1960s here and all the demographic change that’s happening, IKEA is perfectly positioned and it’s just explosive growth for the company. To capitalize on it, they obviously need to ramp supplier production significantly.\nThey’ve had these battles in Sweden with competition, they’ve gotten around that with their own designs, but now they need to ramp up so much. Sweden itself, even if they didn’t have these problems, just doesn’t have enough capacity for all this new furniture that IKEA needs to source.\nBen: Just to illustrate, your point about 1955, they did six million krona. By 1961, they did 40 million krona. That’s almost a 7x in six years.\nDavid: So Ingvar starts looking around elsewhere in Europe to expand supplier production. Then in 1960, Ingvar reads in the Swedish newspaper that the foreign minister of Poland is coming to visit the Stockholm Chamber of Commerce with the express purpose of developing business relationships with Swedish companies.\nYou might be like, okay doesn’t this stuff happen all the time? What’s the big deal? Well Poland at the time was a communist country behind the iron curtain. This was odd. Ingvar is like, well if we could find a way to work with the communists, we could probably lock up a lot of production capacity that nobody else is going to go through the trouble of getting. And I bet they can also produce things pretty cheaply over there and in pretty high volumes.\nIn 1961, IKEA goes to Poland to help local manufacturers, state-sponsored manufacturers there set up furniture production of the IKEA designs. By the end of the decade of the 60s, Poland is producing 50% of IKEA’s furniture, including some of the first modern classics like the BILLY bookcase, the ÖGLA café chair. It’s the wooden, curved back chair, the iconic one. If I have it right, I think that design is actually based on a Polish chair design.\nBen: Interesting.\nDavid: It becomes one of the biggest selling products for the company in history.\nBen: The other thing that they’re doing here is IKEA is investing in bringing up these factories. They’re trying to build really close supplier relationships here, and basically make sure that those factories are going to be successful in the long run so they can bet their business on it.\nDavid: Totally. They get really, really intertwined, to the point where eventually a little later in the 70s after IKEA invests a ton in developing board on frame “technology” or sandwich board construction as it’s called. This is the LACK table. Listeners, probably many of those of you who don’t, you definitely have seen this thing. You’ve probably owned it. The LACK coffee table.\nBen: Or LACK shelves.\nDavid: Yeah. Poland is where they produce this coffee table, that they use particle board, sandwich board construction, inspired by how doors are made, more cheap, not solid wood doors. Today in 2024, the LACK table retails for $9.99 in America. This is a table that you can buy for less than $10.\nBen: It’s astonishing how they’ve driven the price down on some of these things.\nDavid: Totally astonishing. In fact, I think it’s worth a little sidebar on the coffee table right now as an example. It perfectly illustrates the new consumer dynamic and demand explosion that IKEA is about to head into.\nThe LACK coffee table is the first example of this idea that Ingvar starts to develop, of the item with the “breathtaking price.” Every product that IKEA sells in its range should be high quality, great value, ideally way better on both dimensions than any competition.\nBen: Have beautiful form. I think that’s a part of it, too, is it’s supposed to have the form and design. It’s not just build quality, but actually the form should be elegant to look at.\nDavid: Yes, but over and above, just like the standard products in the range, IKEA should always have a few products that are these breathtaking price products. These products should also be high quality, but they should be priced at least 50% below any competitive or substitute of products out there. Ideally well less than 50%.\nA $10 table today, that’s breathtaking. That’s astonishing. Ingvar says, “It’s our job to figure out, start with that end goal in mind and then design backwards from that of how we are going to make that happen.”\nHe would later write and describe, “The whole idea is based on the substantial price difference, the easily understood price by the consumer. We don’t lose on the deal nor do we make much profit, but at least we make a little, and in the end that’s what matters.\nWe can’t actually lose money on these products, and thus we need to design not just what the furniture looks like, the manufacturing process, the transport process, the raw material sourcing process. Everything end-to-end about how are we going to sell…”\nBen: The product is the whole supply chain.\nDavid: Yes. A $10 coffee table. The way they do it, at least in the case of the LACK, is we’re going to wholesale reinvent the manufacturing technology process for this. We’re not going to make a solid wood coffee table. We’re going to use board-on-frame construction.\nWhat are the raw inputs for that? Well we can use the leftover scrap wood chips and then eventually now I think it’s pulp material from the timber. That’s actually going to be 90-plus percent of the material that goes into the product is our waste products from our other things that we’re making. (a) That’s super cheap. (b) It’s super lightweight even though they’re pretty solid and sturdy. Then (c) we can just scale this indefinitely.\nToday, IKEA sells almost 20 million LACK tables every year and has been for decades. They’ve sold hundreds of millions of these things. You can optimize the freaking crap out of your whole supply chain to do this.\nBen: That is wild.\nDavid: I think they have multiple SKUs at that scale. Later, once he, like Charlie Munger got turned onto the virtues of Costco, Ingvar would hilariously formalize this idea, this manifesto in 1995 as the hot dog product policy, because in 1995 they copied Costco and they start selling hot dogs in the stores.\nBen: I brought this up with Jim when I was talking about similarities between Costco and IKEA. He did not believe that IKEA copied the Costco hotdog, and here was his rationale.\nDavid: There’s no way. It’s 100% a copy. I don’t believe him.\nBen: I know IKEA started doing it in 1995. There is a rich Swedish tradition in hot dogs. Swedish hotdog carts are freaking everywhere. I don’t think you had to look at Costco to observe we could probably sell hot dogs at a Swedish store.\nDavid: Jim is a very kind and generous soul, despite being one of the greatest retailers of all time. I’m just going to chalk this one up to that. The IKEA hotdogs today are priced at $1, which is cheaper than the $1.50 at Costco.\nBen: Well, no David. The $1.50 is a combo.\nDavid: That’s what I was going to say. I think, though, you can only get the $1.50 combo at Costco.\nBen: I don’t know if you could walk up and try to order a hot dog that’s less than $1, but it is $1.50 for a hot dog and a drink, and there’s no menu item of just a hotdog.\nDavid: We talked about all this on the episode, like part of how they do this is including the drink.\nBen: It’s a bundling, yeah.\nDavid: Anyway, I refuse to believe that the ability to buy just a hotdog at IKEA is not a nod to the Costco deal because IKEA also has the hot dog and drink combo for $1.50.\nBen: And it’s right after checkout, just like Costco’s is. It entered the store about a decade after Costco started selling the hot dog.\nDavid: There’s no way, there’s no freaking way that Ingvar wasn’t just like, all right. We got to copy the hotdog. The even more amazing thing is he codifies this into the official policy of the company, which is we must have, at least at first it’s 10 “hotdog products” across the range. He later ups it to 20. And it’s yes, it’s like the LACK table. It’s an impossible price for ideally one product in every category that we sell. That is just criminal not to buy this thing.\nBen: Yeah, and the fact that they just keep whittling it down year over year over year. A great example of this is the POÄNG chair.\nDavid: Another hotdog product.\nBen: Absolutely. I think they’ve sold 30 million of these since 1976. They’ve just been maniacal about optimizing. The initial POÄNG chair, which was originally called the POEM, not the POÄNG.\nDavid: I didn’t know that.\nBen: In inflation-adjusted dollars was $350 in 1988. By 2016, they had it down below $100, and it’s effectively flattened out. It’s now $130 but with a little bit more inflation. It’s astonishing you can get this chair that is a living room chair for $130. Comparable chairs are $2000–$3000.\nDavid: You’re not going to buy a POÄNG chair and have anybody mistake it for a Herman Miller recliner.\nBen: No, but that’s not what they’re trying to be.\nDavid: But it’s pretty darn close for the delta in price. A Herman Miller recliner is what? $5000 I think.\nBen: Something like that, yeah. Maybe this performs the same function, but you’re not going to aesthetically mistake it for a Herman Miller chair.\nDavid: Oh, I guess my point is the delta in the design aesthetics is also way closer than $4770.\nBen: That’s a great point. It has this wow price. When you drive home with it and you set it up, you can marvel at the fact that it only cost you $130.\nDavid: Yes. Okay, which brings us to the other, I think really uniquely IKEA piece of this hotdog policy that even Costco doesn’t really have. I just love it, the hotdog policy. IKEA, thanks to the catalog, controls all parts of the demand and the supply chain. They control the supply chain obviously as we’ve been talking about, but the catalog for decades is the primary marketing and demand driving channel.\nIt’s not like they’re having to buy advertising. They fully control the marketing channel. They can use these hotdog products strategically and promote them in each market in the catalog, to then drive the visits to stores, drive the huge demands, position them with other products, then they do the layouts in the showrooms. It’s just genius. It all works together.\nBen: It’s amazing that because in many ways they are their own customer acquisition channel with the catalog, that they never turned into a customer acquisition channel for other businesses. They should sell advertising.\nIt’s the Amazon play of once you reach scale and you have enough customer eyeballs, you can staple on a near 100% margin advertising business for free. I flipped through decades worth of IKEA catalogs. Unless I miss something, I’d never noticed an emergent advertising business in there.\nDavid: Yeah, it’s interesting. But that doesn’t actually surprise me. I think Ingvar probably viewed that as a short-term optimization and that is antithetical to how he wants to run the business.\nNow, what’s also interesting, though, is this element that I was just saying of they control the whole demand and supply chain is no longer true in the Internet world. In the catalog world, absolutely was true. In the Internet world, no. The company—\nBen: Whoa, whoa, whoa. No spoilers.\nDavid: Okay. We’re getting way ahead of ourselves.\nBen: I’m going to take us back to 1958. There are a few more key pieces of the puzzle that needs to come together.\nBut first, this is a great time to talk about friend of the show, Statsig. As we’ve been talking about, IKEA’s big innovation was finding a way to make high quality, well-designed furniture available to anyone at crazy affordable prices. The three ways they did this, sweating design and functionality, having a radically different delivery model, and offering great prices through crazy scale, which we are getting to here in the story.\nNow, it might not seem this way at first, but Statsig is doing the same thing for their category.\nDavid: Okay, lay it on me here.\nBen: All right, and bear with me listeners. You probably know the rough story of Statsig by now, but here’s a quick refresher. They were founded by a team of engineers at Meta who wanted to build a complete set of data and engineering tools like those that powered the growth at Facebook, and make all of those available to anyone at any company.\nOkay, so back to the IKEA similarities. Design and functionality. Statsig’s tools were designed and built from the ground up, for engineering, data science, and product teams, by world-class people in the same functions. This means their tools come with things that aren’t really available anywhere else, like advanced statistical treatments, over 30 high performance SDKs, and the ability to deploy your own data warehouse.\nNow the second piece, a radically different delivery model. Unlike legacy vendors, Statsig bundles all of their products, which means that when your team starts to use Statsig, they get access to everything—experimentation, feature flags, analytics, session replays, everything. Rather than charging for seats or licenses, you just pay for what you use.\nThis is super different than legacy vendors who are focused on maximizing revenue from just one product line. And because it’s all an interconnected set of tools, you can consolidate your spend and save time on configuration. That’s the second way.\nThird, Statsig makes their products super affordable because like IKEA, they make it up on volume. They power companies like OpenAI, Atlassian, Microsoft, Figma, and they process over a trillion events per day. They’ve got a great engineering blog on how they do this. This scale helps them basically give away their product for free to small companies and startups, and help larger companies cut their SaaS spend.\nDavid: I love it. I get where you’re going now. Statsig is the IKEA of product tools.\nBen: Yes. Listeners, if this sounds interesting to you, there are a bunch of great ways to get started. Statsig has an insanely generous free tier for small companies. A startup program with a billion free events that’s $50,000 in value, and significant discounts for enterprise customers. Plus the team is just awesome.\nDavid: They’re so great.\nBen: To get started, go to statsig.com/acquired or click the link in the show notes, and just remember to tell them that Ben and David sent you.\nOkay, so David, I’m taking us back here to the late 50s where we have a few more pieces of the puzzle of modern IKEA that are coming together. In 1958, they expanded—remember we said there was just some cold food and coffee?\nDavid: Yeah?\nBen: They expanded that. They added hot food, they added self-service. It’s more like you see today.\nDavid: This is all at the showroom in Älmhult.\nBen: Exactly. The philosophy behind this is the margin should never exceed 10% at the restaurant. They want to use it to attract customers to retain and delight, but they want to make their money on furniture. It’s like David, these hotdog items you’re talking about. They don’t want to lose money. Just like Costco, they’re opposed to loss leaders. I don’t know if it’s as religious, but they are looking to make money on everything they sell.\nDavid: I think it’s equally religious for different reasons. I think Costco was about not insulting your customers. I think at IKEA, it’s Ingvar just his background in being religiously opposed to losing money.\nBen: He is unbelievably frugal.\nDavid: Oh man, we got to tell that amazing story. We heard in the research, he was doing a store visit somewhere in Europe.\nBen: In Germany?\nDavid: Yeah, I think it was in Germany at night. The store manager’s like, okay come on in, I’m going to turn the lights on. He’s like, dear God, don’t turn the lights on. Do you know how much that costs?\nBen: And it wasn’t a store manager, it was a really junior person.\nDavid: That’s right. Do you know how much it costs? I’m going to use this flashlight. And they spend hours going through the store with flashlights.\nBen: And because he’s also obsessive about details and a micromanager, he finds like 30 little things wrong, all with a flashlight, and asks for all of them to be fixed by morning.\nDavid: Amazing.\nBen: But this whole restaurant thing, they really find religion on, this is here because we need to make it worth your while to come all the way to this store. It has to be an attraction. They develop this phrase, ‘it’s tough to do business on an empty stomach,’ so in the early days it’s not like prolonging time in store the way that it is today. But it is, hey, we want to add a Disneyland effect and add perceived value to your trip here.\nToday, restaurants—just to flash all the way forward—it is technically the world’s sixth largest restaurant chain measured by number of customers. In 2017, they had 700 million people per year eat at their restaurants. Now, I think that’s not de-duplicated. If I eat multiple times per year, that might be counting me. Otherwise, it’s unfathomable. Does 10% of the world really eat in IKEA’s?\nDavid: Even more wild, there are only 476 IKEA’s in the world, so whether that’s de-duplicated or not, 700 million customers across only 476 locations is wild.\nBen: Totally wild. Thirty percent of people who visit IKEA do so just to eat.\nDavid: I love it.\nBen: Lots of meatballs.\nDavid: I have done that many times in my life, most recently in downtown San Francisco.\nBen: I don’t have many of these stories and I was trying to figure out why. I was talking to my wife and she was talking about, oh my God, I loved getting the catalog growing up. Oh, I’ve furnished so many apartments in IKEA. I was thinking, actually until the last few years I haven’t really. I’ve never eaten at IKEA just to eat lunch.\nI realized Ohio did not get an IKEA for a really long time. I grew up without an IKEA near me. Even when I went to college in Columbus, they got one in Cincinnati. But it was was until after I left Columbus that they got one there. Until I got to Seattle, I don’t think I had ever experienced IKEA.\nDavid: And the Seattle IKEA is so great. Well I have a question for you then. What year did your family leave Delaware?\nBen: 1996.\nDavid: You grew up very close to an IKEA and you just didn’t realize it.\nBen: Oh really?\nDavid: Because IKEA has been part of my life pretty much my whole life. Again, I didn’t realize why. The first US store was in Plymouth Meeting, Pennsylvania, right outside Philadelphia, which opened in 1985. I was born in 1984. I grew up with BILLY Bookcases and all this stuff. It’s just been a constant my entire life. I went to the Småland, I played in the ball pit, all this stuff.\nBen: All right. It is funny how I’ve developed an appreciation as an adult, but it was not a formative thing like for you and so many others. All right, so into the 1960s, David, they opened a bigger store.\nDavid: They actually had opened a showroom in Norway, in Sweden’s next door neighbor country, to be able to sell in Norway. But that was the same concept as the Älmhult showroom, not really a store. By the mid-60s though, all of this new urban consumer, all really, really taking off. In June of 1965, IKEA opens its second showroom location, very different from the original. This one is almost 500,000 square feet.\nBen: What? That’s even still probably their biggest store or among their biggest few.\nDavid: I think it is still, I believe the flagship IKEA store.\nBen: Because even today they’re like 300,000–400,000 when they build new stores.\nDavid: It is a circular building inspired by the Guggenheim Museum in New York City. I think even this one is no longer circular. That does not last in the IKEA playbook. It costs 17 million krona to build or roughly $3 million compared with the original Älmhult location that Ingvar bought for 13,000 krona.\nBen: God, they must have done so much business out of that catalog and those two tiny showrooms in order to leap to this and spend all that money on this store.\nDavid: Well by this time, the business was (call it) about 100 million krona a year by the mid-60s when this second store is opening.\nBen: So US$20 million at the time.\nDavid: So a US$3 million investment in this store is a lot because I don’t know what their profit margins were, but a big investment, but they could handle it.\nBen: It’s probably a year or two of all of their profits go into this.\nDavid: Yes. Most importantly though is the location. It is on the outskirts of Stockholm, the biggest and the capital city of Sweden. For the first time, they actually stock items in the store. By now, flat-pack is really rocking and rolling. They’re trying to fit as much in the store for customers to buy cash and carry out themselves. This is the first real modern IKEA.\nOn the first day that they open it in June of 1965, they have 18,000 customers come through. Then in that first year, that store alone does 70 million krona in sales. It doubles the company’s revenue.\nBen: They also at this store for the first time now have the setup where customers fetch the products themselves from the warehouse.\nDavid: Yes, and a few more elements of this Stockholm store that you might recognize if you are an IKEA customer today, it’s located on the outskirts of the city with good highways leading to it and lots and lots and lots of parking spaces.\nIts opening hours are 11:00 AM to 7:00 PM, so that both you as the customer and the employees, the coworkers there, are not battling morning rush hour to get there when, who’s going to be shopping at 9:00 AM in the outskirts of the city anyway?\nBut it’s open late after work. You finish your work, you finish your shift at the factory, you finish your white collar job, whatever you’re doing, great. Hop on the bus, hop in your car, go on over to IKEA, buy some furniture. Yes, Ben, as you say, you can buy and carry away the flat-packed furniture right there.\nBen: The fact that you don’t need employees to go and fetch things for you, you can just grab them off the shelf yourself after you wind through showrooms. It’s like further compounding their cost structure advantage.\nDavid: Totally. Then this is tragic but ends up being great for the company. Five years later, this beautifully-designed, Guggenheim museum-inspired store in 1971 night, the neon IKEA sign on top of the building catches fire and the building burns down. I don’t know if it totally burns down, but it’s a major, major damage.\nI believe the insurance claim resulting from this was at the time the largest insurance claim in Swedish national history. But I think this is really part of the culture of IKEA, the company, and certainly Ingvar’s mindset, is every challenge is an opportunity.\nWhen they reopen the store a year later, it’s got the full customer self-service checkout that you know of IKEA today where, yes there are co-workers there helping you check out, but like you’re wheeling the stuff up, you’re scanning the stuff you’re putting it through. It’s got more capacity for more and larger flat-packed items in the warehouse.\nThis is really the beginning of the end of the mail order business here. It still exists obviously for a long time, but the share of the business that is mail order versus cash-and-carry in the stores goes way, way, way down.\nTwo, they add a children’s playroom at the front of the store with a ball pit for kids to be entertained while your parents shop, because Lord knows how on earth are you going to do your IKEA shopping with your crazy little kiddos running around.\nBen: Which is also a genius way to prolong time in store. You’re just going to buy more stuff if your kids are looked after. I will say the Småland at the Seattle store, the idea is a little bit better than the execution. It was a two-hour wait once you get there to get your kid into the Småland. They only allowed five kids at a time. It was this odd, I was all built up for, oh Småland’s going to be this amazing thing.\nDavid: I suspect this is something that, a different era when we were growing up, like things worked a little better and you can’t get away with these days.\nBen: Totally, like one person watching 40 kids or something.\nDavid: Drop your kid off, go knock yourself out. Come back with 10 fingers, 10 toes. Can’t do that today. Then finally number three in the newly redesigned Stockholm store, yes they had opened a restaurant at Älmhult at the showroom a couple of years ahead of time.\nBen: But this was the real cafeteria.\nDavid: The real cafeteria like we know and love it today with the traditional Småland-style menu.\nBen: Yes, and this is basically it. There is a lot that happens after this, but the core concept of the store and why the business model works and all that is pretty baked here by the mid-60s.\nDavid: Yup, and certainly by 1971 in this v.2 of the Stockholm store.\nBen: Yup, so across the sixties they opened more Denmark and Norway stores. In the 70s they opened in Japan, Australia, Austria, Canada, Germany, Hong Kong, and Singapore. In 1975 they enter Japan for the first time. They try real hard for 12 years to make it work, but it fails and they withdraw in 1986.\nA few of the reasons are the furniture’s too big, they just didn’t understand the needs of that market well, self-assembly was an anathema to Japanese culture, and the delivery industry hadn’t really been built out in the way that they need it to be.\nThere’s a necessary precondition to IKEA entering a market, which is there are robust delivery services to make it work if you’re going to rely on the catalog model. Otherwise people have to be able to drive to the stores and use this store concept where you grab it off the warehouse, put it in your big car, drive home.\nIn these dense urban areas in Japan, that’s not really possible. So they pull-out after 12 years. They did eventually go back in 2006 and make a bunch of changes to make it work today. But I think Japan was, after they saw success in all these other markets, a little bit of humble pie for them not seeing it work there. I think it spooked them a little bit for further global expansion.\nDavid: It is amazing. In the 70s, really until they go to Japan—I’m laughing using the word, well, we’ll come back to another reason why I shouldn’t be laughing using the word—it’s almost like they did blitzscaling across Europe and even beyond Europe in the 70s.\nThey went all throughout continental Europe, they expanded to Canada, Australia, Singapore. Ingvar totally got the conviction that the newly redesigned store in Stockholm was it. We were going to copy paste it and bring it everywhere.\nBen: And they’re rapidly scaling with profit dollars.\nDavid: They’re not raising money to do this.\nBen: As we’ve talked about, they have very thin profit margins. What it means is they’re just doing tons and tons and tons of volume to enable them to do their future growth with their current profit dollars.\nDavid: It’s hard to get consistent revenue data on the company because it’s a private company—still is a private company—but by the 1980s they’re doing $2 billion a year in revenue. So call it 15–20 years to scale from $20 million to $2 billion. It’s incredible.\nBen: It’s interesting. It’s a company that is rapidly scaling at the same time that in their DNA they’re unbelievably thrifty. You wouldn’t expect both of these things to be true of the same company.\nDavid: Totally.\nBen: This is the same guy, just to quote The Testament of a Furniture Dealer. This is one of my favorite paragraphs. Ingvar writes, “It is not all that difficult to reach set targets if you do not have to count the cost. Any designer can design a desk that will cost 5000 krona. But only the most skilled can design a good, functional desk that will cost 100 krona. Expensive solutions to any problem are usually the work of mediocrity. We have no respect for the solution until we know what it costs.\nAn IKEA product without a price tag is always wrong. It is just as wrong when a government does not tell the taxpayers what a free school lunch cost proportion before choosing a solution set it in relation to the cost. Only then can you fully determine its worth.” It’s amazing that this level of thriftiness and paying attention to the details is also the same company that is in a decade expanding all over the globe.\nDavid: It’s totally what enables it to happen because it’s almost like Warren Buffett in the Berkshire Hathaway episodes, where as a young man he’s like, I cannot spend any money because any money that leaves my bank account will not compound. It’s the same thing here with IKEA. They view all of the profits that they are making as compounded value of future investment here.\nBen: That’s an interesting way to think about it.\nDavid: So in the 70s during this decade of blitzscaling (if you will) for IKEA, Ingvar is in his early 50s. For a couple of reasons, as the company is doing this massive scaling outside of Sweden, he starts to become really concerned about succession and what will happen to IKEA when he inevitably dies. Although he would live for another 40 years after this; he lives to be 91.\nSweden at the time had high and rising wealth and inheritance taxes. Inheritance taxes for large estates, of which the Kamprad estate and IKEA as an asset would definitely be one, was over 60%. On top of that, there was an annual wealth tax in Sweden at the time, which was 2.5% of your calculated wealth annually. Your calculated wealth included all of the working capital in any companies you owned.\nBen: Whoa, really? It’s the illiquid ownership of the company plus the working capital in it?\nDavid: Yes, especially sitting there in the early 70s, knowing you’re about to embark on this journey from (call it) a couple of hundred million krona revenue business to a multi-billion dollar revenue business.\nBen: His net worth would eventually rise to something around $60 billion.\nDavid: Yup. There it wasn’t even just going to be enough capital to pay that 2.5% annual tax. Side note by the way, in the mid-2000s, Sweden ended up abolishing completely both the wealth tax and the inheritance tax. Actually, at the end of his life, Ingvar moves back to Småland, moves back to Sweden.\nBen: Oh wow. I didn’t realize that was part of it.\nDavid: Yeah, and he dies in Sweden. Anyway, this kicks off for Ingvar and the Kamprads, a whole saga of wealth succession corporate planning that ultimately has a huge impact on the company.\nIn 1973, which is the first year that IKEA expands outside of Scandinavia, Ingvar and his family immigrate to Denmark first to avoid the wealth tax. Then a couple of years later in 1978 they settle in Switzerland.\nNow, Ingvar actually has multiple goals here though. It’s not just avoiding taxes, although he’ll be the first to admit, taxes was the first and primary motivation here.\nIn addition to that—I think this really, really was genuine—he’s concerned with ensuring IKEA’s continuity and survival. And there are multiple parts to that. (1) He wanted IKEA to be completely independent from any one country’s political fate. The political history of Europe that Ingvar lived through and that we’re going to talk about later is case in point here. He has lived through not knowing that countries are going to continue to exist, and he doesn’t want any of that to risk IKEA.\n(2) He also doesn’t want anything that would happen within his family to risk IKEA. By this point, he has three relatively young sons, and he doesn’t want to set up a dynamic where the three of them are fighting over control or selling off IKEA or et cetera, tearing it apart.\nThen I think (3) he also wants to ensure that IKEA keeps its focus on the long-term and not the short-term. For him that meant specifically having a huge fear of what would happen if it ever were a publicly-traded company. He thought that it was just wholly incompatible to be publicly-traded and have shareholders and be long-term–focused.\nBen: I heard a funny quote indirectly from someone who told me that Ingvar once said going public is a little like wetting your pants. It’s warm and comfortable for a few minutes, but then after that…\nDavid: Oh my god, what a folksy dude. Wow. Ultimately, after a lot of international lawyers get involved, they decide that what they’re going to do is set up a self-owned foundation based in the Netherlands. This is like echoes of our Novo Nordisk episode here.\nThe reason they choose the Netherlands is that Dutch foundations are at least according to the lawyers, the most bulletproof and hardest to change the bylaws of. They’re going to divide IKEA into two “spheres,” one of which is going to be the physical sphere and company, that is the actual stores.\nBen: The operator of the stores.\nDavid: Yup, operator of the stores, and the other one is going to be the “mental” sphere, which is the brand and concept of IKEA. This is where you end up with this crazy structure where IKEA is two companies today. It is Ingka Holdings, which is the physical sphere, the technically largest franchise operator of IKEA stores. They own and operate 400 of the 476 IKEA stores in the world today. That is owned by the Dutch Ingka Foundation, which is a charitable foundation. It is an actual charitable foundation.\nThen you have the mental company , the brand company, which is Inter IKEA Systems. Inter owns the IKEA brand, the concept, and then they license the IKEA brand and concept to everyone else who operates the stores as a franchise operator, of which today Ingka is by far the largest. And in return for that licensing of the brand and concept, Inter IKEA gets a royalty of 3% of gross sales from every store.\nBen: I’m going to say all of this again in different words just because it is impossibly hard to parse the first time, you can essentially think of it as a franchisor-franchisee relationship. The franchisor who owns the brand, the IP, all that, is Inter IKEA Systems. They work with a company called Ingka, who has the privilege of operating the stores and getting access to the intellectual property in exchange for a 3% royalty on their revenue.\nEvery year Inter IKEA Systems, and this changes a little bit over time, the parent company, designs furniture, works with manufacturers to have it made, upkeep the brand, and all the corporate stuff.\nDavid: Designs the catalog, et cetera.\nBen: Sells that furniture to Ingka or any of the other franchisees. The reason there are other franchisees is because you want specialized franchisees in different markets where you don’t understand the local culture.\nThat’s why there’s Ingka for a lot of the Western Europe and English-speaking world, then there are specific franchisees that are not Ingka for other parts. But just simplify it for now because Ingka is 90% of the stores. Then Ingka buys that furniture from Inter IKEA holdings, pays 3% of revenue, and then runs the stores.\nNow David, I simplified out the part about the foundations that own each of them. I think we should come back to that later because there are some interesting nuances there. But that’s the structure they devise here.\nDavid: Then ultimate foundation owners for both of these two separate companies, they get set up the Kamprad family, at least after Ingvar dies, the Kamprad family will be involved but does not have ultimate control or voting power over either of these companies.\nToday, certain of the brothers are on the board of certain companies, all three of them are on the board of one company or the other. But they are far from a majority and they cannot, even if all three of them get together, influence or control the decisions of either company. That was super important to Ingvar.\nBen: It’s pretty interesting.\nDavid: And I believe the Ingka company and foundation still rolls up to a Dutch parent, and the Inter holding company (I believe) is a Liechtenstein foundation that owns it. It’s all spread around to ensure this political continuity of the company. It’s almost like bitcoin maximalist people who have ripped up their keys into different parts and put it in different safe deposit boxes all around the world. That is exactly what Ingvar is doing here.\nBen: That’s a good analogy. Yes, you are correct. Ingka, the franchisee who operates the stores, rolls up to a Netherlands-based charitable foundation, where Inter IKEA Systems, that parent that owns the IP, rolls up to a Liechtenstein-based enterprise foundation.\nDifferent, non-charitable is an enterprise, self-owning foundation based in Liechtenstein, which for those wondering what Liechtenstein is, it is a country that is landlocked and sandwiched in between Austria and Switzerland with a very small population, but it happens to be very good for establishing entities like this from a tax and treaty perspective.\nDavid: Yup, and you said to just an enterprise foundation I think is the word you used, not a charitable foundation. This is like a circular function in computer science. The stated purpose and goal and activities of that foundation is to ensure the continued operations and success of IKEA.\nBen: To secure the independence and longevity of the IKEA concept and the financial reserves needed to ensure this. That is the purpose of the foundation.\nDavid: Which is so interesting. Again, the Ingka Foundation is a charitable foundation, and they do disperse, I think now €200–€300 million a year in charitable donations around the world.\nBen: And it’s to things you would expect. It’s climate, it’s poverty, it’s charitable causes. But yeah, to your point, the Inter IKEA holdings, the foundation at the top of that is literally to ensure IKEA’s continuity.\nDavid: It is like a Fort Knox for IKEA.\nBen: Fascinating. Okay, the structure is going to shift a little bit. As I mentioned, they’ll rename things, they’ll break some things apart, they’ll shift who’s responsible for what on the edges. But that’s largely the structure that is in place going forward.\nDavid: Yup. So once this is all done and Ingvar and the family no longer directly own the company, in 1976 he writes this document that is intended to serve as a forever operating system of the company.\nBen: It’s almost like the Bezos leadership principles.\nDavid: That’s exactly what it was like. He titles it The Testament of a Furniture Dealer as we’ve talked about. It’s literally like he’s treating this it’s his last will and testament, even though he stays involved in the business for another 42 years and hands-on the whole time.\nIt’s an amazing document. We’ll link to it in the show notes. You should go read it. It’s on the IKEA website. It’s really cool. It has nine testaments or commandments, and you already read one which was the mortal sin of wasting resources at IKEA.\nThe first one though, number one, “The product range – our identity. We shall offer a wide range of well-designed, functional home furnishing products at prices so low that as many people as possible will be able to afford them.” Talked about that earlier. “Our products must be functional and well-made, but quality must never be an end in and of itself. It must be adjusted to the consumer’s needs.” This is fascinating.\nHe continues. “A tabletop, for example, needs a harder-wearing surface than a shelf in a bookcase. In the first example, a more expensive finish offers the consumer long-lasting utility. Whereas in the latter it just hurts the customer by adding to the price.\nQuality must always be adapted to the consumer’s interests in the long-term. No effort must be spared to ensure our prices are perceived to be low. There shall always be a substantial price difference compared to our competitors, and we shall always have the best value for money offers in every function. Every product area must include breathtaking offers.” This is before the hotdog analogy in 1995.\nBen: It’s great. It makes so much sense.\nDavid: It’s so great.\nBen: The analog to software companies is engineering for engineering’s sake. There are many examples of architecting the perfect system that’s wildly overkill. Anyone who’s put together IKEA furniture knows anything that’s not seen, like things that on the bottom that face the floor or that face the wall are not finished.\nOftentimes, the back of shelving units or the back of cabinetry is thin, flimsy. You don’t need it to be structurally stable. It’s not because they wanted to cut a corner there and make it as cheap as possible because they view that as a value for you the customer.\nDavid: It’s not that they don’t care or that it’s sloppy. They care a lot.\nBen: It would be insulting to spend money on it.\nDavid: Exactly. This is the polar opposite viewpoint of the Apple, Steve Jobs, the insides must be beautiful. But it’s actually a lot closer in philosophy than you would think. It is intentionality about it.\nNowhere in either company is their sloppiness, but at IKEA we are going to intentionally make the backside and the insides not beautiful so that it is a higher value to you as a customer.\nBen: There’s so much good stuff in this document just to illustrate Ingvar’s personality. The fact that he wrote this is, well here it is. “Bear in mind that time is your most important resource. You can do so much in 10 minutes. Ten minutes once gone are gone for good. You can never get them back. Ten minutes are not just a sixth of your hourly pay. Ten minutes are a piece of yourself. Divide your life into 10 minute units and sacrifice as few of them as possible in meaningless activity.”\nDavid: I’m so glad that you brought this up. I wasn’t going to put this in the episode, but I totally highlighted that reading it and I was like, wow. I need to think about that in my life.\nBen: Totally. There are so many times where we’re 10 minutes away from a call that you and I are jumping on, or 10 minutes away from recording an episode, and I’m amazed at the amount I could get done in those 10 minutes when I really was forced to. It’s such a good point. If you actually force yourself, hey just go focus and get 10 minutes of work done, you can be astonishingly productive in 10 minutes.\nDavid: Totally. I hadn’t thought about this, but maybe IKEA and Apple are more spiritually aligned than I even realized.\nBen: IKEA and Apple are very similar in a way that I will get to later.\nDavid: Ooh. Okay. I love it. And then another similarity analogy, the last testament number nine is just so early Jeff Bezos shareholder letter-like that we can’t not read it.\nThe title of the testament is ‘Most things still remain to be done. A glorious future!’ He writes, “The feeling of having finished something is an effective sleeping pill. A person who retires feeling that he has done his bit will quickly wither away. A company which feels that it has reached its goal will quickly stagnate and lose its vitality.\nHappiness is not reaching your goal. Happiness is being on the way. It is our wonderful fate to be just at the beginning in all areas. We will move ahead only by constantly asking ourselves how what we are doing today can be done better tomorrow. The positive joy of discovery must be our inspiration in the future too.”\nBen: Oh, I share this affliction.\nDavid: 100% me too.\nBen: I feel for Ingvar that this is his view on life because anytime anything awesome happens, I’m like immediately onto the next thing and unwilling to acknowledge, like it doesn’t give me happiness that something great happened. What gives me happiness is working toward the next great thing. If we ever just decided all right, we made all the good episodes, we’re done, I’d be miserable.\nDavid: I was going to laugh. I’d be like this is the story of Acquired too. I think it’s so funny. But more on the personal life advice from this too. Ingvar (I think) is living proof of this. The man lives to be 91. He clearly didn’t think he was going to live to be anywhere near that age. The stories we heard of him visiting stores, being super engaged in board meetings, making decisions, making product decisions up until the last weeks of his life at 91 years old are (I think) he is totally right.\nHe writes “A person who retires feeling that he has done his bit will quickly wither away.” No more perfect example of that exists than Ingvar himself.\nBen: Happiness for him was making things a little bit better. If he has nothing to make better, what’s his reason for being?\nDavid: Totally. This is the mindset that Ingvar and the company are going into the 80s with, and the 80s is just continuing this compounding. 1981, they open stores in France and Spain, 1983 they go to Saudi Arabia, 1984 they go to Belgium, 1987 they go to the UK, 1989 they go to Italy, and along the way in 1985 as we talked about, they opened the first US store outside Philadelphia, in Plymouth Meeting, right by King of Prussia, frequented it often as a child, outfitted my bedroom and my family room and everywhere else.\nThe interesting thing about the US, though, which I was so surprised reading, because again IKEA has just been part of my life forever, it actually doesn’t work that well for a really long time.\nBen: It opens with a bang. In 1985, they do this incredible marketing campaign in the Philadelphia area. Part of it actually was figuring out how it should be pronounced because in Europe it was IKEA, the way you would pronounce it as a Swedish person is IKEA, and the ad campaign they decided Americans are just going to pronounce it IKEA, so let’s lean into it. It was an I, a picture of a key, dash UH, so coming soon, IKEA.\nPeople knew about it because it had been in Canada for nine years. I think it had started in Nova Scotia. Actually I happen to know the founders of Costco made a special trip up to one of the Canadian IKEAs even before the founding of Costco, because they had so much respect for IKEA as a brand they admired. They wanted to go and see it and experience it.\nDavid: Oh that’s amazing.\nBen: Isn’t that crazy? So people in the US, especially merchants and people knew of IKEA from its Canada presence, it’s opening the pent up demand in Philadelphia from the cacophony of factors leading to the excitement around it was insane. There was over a one mile long line to get into the store. They ran out of merchandise on opening day and they actually had to run radio ads apologizing and announcing that they were restocking the store as fast as they can.\nDavid: Whoa, that’s wild.\nBen: That said, a failure of IKEA corporate as they were expanding around the US was assuming that the US was homogenous. I think they expanded to 10 or 12 stores and it wasn’t going great relative to their other markets. I think it’s because they misunderstood that the US has really different needs in really different parts of the country.\nDavid: That would make sense. In Europe, not to say all European countries are homogenous, but any given European country is a lot more homogenous than all of the United States of America. There was also some just basic US market-specific stuff. I love this softer sofas. Americans like to sit in the sofa, whereas Europeans sit on the sofa.\nBen: Oh really? Is that part of it?\nDavid: Yup. The sofas are softer in America, you sink into them, whereas in Europe, you know, yeah.\nBen: Funny. Around this time, I think when they were observing, the US stores were not in great shape. They were open to the idea of individuals franchising IKEA stores. Now they had this structure in place, they thought maybe this is an interesting thing for former longtime IKEA employees to do to open up a store.\nThey did an experiment starting in Seattle. The idea from Ingvar was, if you have your own wallet on the floor, how do you do compared to the corporately-owned stores. It was essentially like a bake-off and a test to see if the bureaucracy was hurting them, or if they had too many layers of management, or if they had more innovative marketing ideas, which the independently-owned stores, specifically the Seattle one absolutely did, created their own marketing campaigns.\nIt became pretty divergent. The Seattle store was actually a leased old Boeing warehouse that ended up being laid out pretty differently than other IKEA stores. You get what you ask for. If you want different ideas, the concept is going to end up being pretty different. They only opened one or two more despite the fact that the locally-owned stores, well the Seattle store, actually did way better. We think it was the highest-performing US store and beat all the corporate owned ones.\nDespite doing another deal in San Diego and another one in Houston, eventually they wanted to bring the learnings back to the mothership, to have them all be homogenous, so all the US stores are now operated by Ingka. But for anyone in Seattle that during the 12 years of independent ownership visited that store, it actually was a pretty different thing with very different marketing materials than anyone else in the US was getting.\nDavid: Was it in the same location that the current one is down in Renton?\nBen: I think that where the original IKEA was is now the parking lot and they’ve shifted and built this new shiny building next to it.\nDavid: Man, I spent so much time in that store when I first moved to Seattle to work for Madrona. I was moving across country as a young person on my fourth and fifth apartment since graduating from school three years earlier.\nMan, I was so squarely in the sweet spot for IKEA at that moment in my life. It was almost a weekly pilgrimage that I did to that IKEA store. I used to love going to the as-is section. I would always start there at the end and be like, okay, what can I get a deal on here?\nBen: Because as-is is returns and…\nDavid: Yeah, broken stuff or showroom floor stuff that they’re getting rid of.\nBen: It’s like when I enter a Lululemon. I always go right to the back and look at the clearance rack. Even though Lululemon’s clearance is horrible, they’re 15% off or something.\nDavid: Oh man. Sometimes in the IKEA as-is section, you can get some screaming deal. They would argue everything is a screaming deal.\nBen: But to this point of, the reason they were doing this Seattle-specific thing, the individual franchising, Ingvar was obsessed with reducing bureaucracy. I get the sense this is still an ongoing battle today now that they’re a bigger company in figuring out how to be as lean and scrappy as they were. When you have more committees and more lawyers and more traditional corporate leaders from other companies and all that coming in, this sort of thing is a helpful antibody against that.\nDavid: Totally. There’s one other thing that happens in 1985 in IKEA land.\nBen: Meatballs baby. It’s the final piece of the puzzle.\nDavid: They add meatballs to the menu. Now this is what’s funny. You would think this would be the capping of his career, the end of the story. It’s 1985, they add meatballs. The concept is perfected. In 1986, Ingvar is 60 years old. He steps down as president of the IKEA store operation of Ingka.\nBen: It’s the reverse Morris Chang. Isn’t that the year he started TSMC? He was 59, something like that.\nDavid: That’s right. Yes, he steps down as president in 1986. I don’t think anything changed whatsoever in his daily activities. I think he was doing exactly the same things that he was always doing.\nHis successor, a guy named Anders Moberg, does stay there I think for 12–13 years, maybe. He would leave at the end of the 90s to become president of Home Depot’s planned European expansion, which then ends up not happening until he would leave Home Depot. But yeah, I think he was constantly clashing with Ingvar about like, hey, I’m the president here. No, no, no. There’s only one president at IKEA, even if not in name, and that was Ingvar.\nBen: Do you know what Anders Moberg is doing now?\nDavid: Ooh, I do not.\nBen: Anders is on the board of directors for the IKEA Foundation.\nDavid: Interesting.\nBen: Yup.\nDavid: Well, there couldn’t have been that many hard feelings then.\nBen: Yeah, which is the foundation on the Ingka side of the tree, the franchisee side.\nDavid: Amazing.\nBen: With two of the sons, two Kamprad brothers.\nDavid: And I think the third son is on the Inter board.\nBen: Exactly.\nDavid: So that takes us into the 90s. Basically the compounding story continues unabated. In 1994, they enter Taiwan. In the spring of 1998, they enter China. They expect that China will become an obviously huge, huge market for them, which it does. By the end of the 90s, IKEA is a $10 billion annual revenue business. They’re rocking and rolling.\nBen: Seriously. There is another thing that happens in the 90s that we have to talk about on this episode and happened way earlier in Ingvar’s life. But this is the moment where it really intersects the IKEA story.\nThe news comes out that in his youth, Ingvar was a part of a Nazi and fascist movement in Sweden, which in some ways is not surprising. His grandparents had immigrated from Germany, had very strong feelings, had lived this horrible life. Ingvar very much looked up to his grandma and looked to her for political, moral, social guidance.\nUnfortunately, Ingvar was a part of this Swedish fascist movement. It was provable that he was attending meetings, helping to organize, raised funds, recruited members. He stayed close to this Swedish leader even after the war. In as late as 1950 wrote a letter that he was proud of his involvement.\nThe net of all this is in 1994 when this came out, he immediately came out and said that his fascist activities were a part of my life which I bitterly regret, and the most stupid mistake of my life. He was direct about it.\nIn fact, the first employee of IKEA was a Jewish refugee who had fled Austria in 1943. There’s a lot of complex stuff going around here. But the thing that is definitely admitted to proven is that he was a recruiter-organizer for this Swedish fascist movement during the Nazi regime.\nDavid: The extent of his involvement in the Swedish fascist movement after the war actually didn’t come out then in the 90s, came out later in the 2000s. Ingvar, I think rightly took a lot of flack for not fully disclosing how long that went on.\nBen: He had a friendship with the Swedish fascist party leader who would go on to be this pretty horrible vocal holocaust denier. Ingvar maintained that friendship and even at the end of his life went on the record and said this person was a great man.\nOn the one hand you want to say, look, he apologized and it was 50 years earlier and he was 17 at the time. Can’t a person make a mistake when they were younger and admit a mistake and move on? On the other hand, you could imagine wanting to give him more forgiveness if he hadn’t continued to stand by the Holocaust, deny or [...] maintain that friendship.\nDavid: Or just came clean about that whole thing initially.\nBen: Or with his vast, vast resources made a big contribution to a Holocaust museum or the families or something.\nDavid: This is one of these things that covering these old European companies. You can’t avoid this.\nBen: Totally. My heart dropped and was also not surprising when we first started doing the research and had no idea and came across. It’s not hard to find this. You come across it for the first time and you’re like, ah, crap.\nDavid: Yup.\nBen: So coming out of the 90s.\nDavid: Coming out of the 90s. In 2000, IKEA starts their next big geographical growth initiative, which is Russia. They reach a deal with the Russian government that IKEA is going to enter Russia and they’re going to use the market, which they expect to be really big for IKEA, to also pilot the “MEGA” shopping center concept, which I think was actually the brand name of this shopping center, that they then later roll out to other places around the world.\nThe idea is IKEA writ large has so much capital and so much resources at this point. We’ve always owned our own real estate and we think that’s a key part of securing that future. We have so much more cash resources now. What if we also invest in large retail centers around the IKEA store, which they hadn’t really done before.\nThe idea—this is genius and not novel now because so many other folks do it—we surround the IKEA with lots of partial competitors. Because IKEA sells so much stuff in its range that yes, there could be a Home Depot there, or yes, there could be a Bed Bath & Beyond there—I’m using American terms here; obviously, these are not Russian stores—and we compete with them partially.\nBen: I didn’t realize Russia is where they started the strategy.\nDavid: Yeah, Russia’s where they started. But because it’s now this retail center, if even only (say) 10% of the people that are coming go there for (call it) Bed Bath & Beyond, might also visit IKEA, well then that’s a found extra 10% customers for us.\nThey pilot this in Russia, which is interesting, and I think it works pretty well. Unfortunately for IKEA and everything that would happen in Russia over the next 20 years, they end up completely exiting the market in March of 2022 after Russia invades Ukraine.\nThey had 17 stores total in Russia, 14 of which were these MEGA complexes. They close all the IKEA stores. They sell off the 14 MEGA complexes to the Russian (I think) supermarket chain Gazprombank. They end up fully exiting the market after 20 years. But it does become pretty large for them and pilots this MEGA retail center idea.\nBen: As much as 20 years later they had to sell it all off, or in some cases I imagine they didn’t get a return. They just had to close up shop.\nIt does lead them to this insight, which is we’ve been building these disneylands out in the potato fields—I’ve a few people refer to the potato fields and I read it in a few places—and then everything springs up around. We should probably benefit from the fact that everyone is springing up around it to try to take advantage of the fact that people are driving out for their day at IKEA. Tthey want to be everyone’s landlords who are drafting off the success of IKEA, creating a whole bunch of traffic to this area.\nI think it’s a pretty major strategy of theirs now whenever they open a new store to own as much real estate as possible around it and help develop it.\nDavid: Yup. Gosh, I think about here in the Bay Area, the Emeryville store across the Bay and the East Bay. I don’t know how much of the Emeryville complex they own, but there is so much retail all around that. Yes, it would be genius for IKEA to participate in it.\nBen: Another thing that happens around this era—it’s the mid- to late-90s—is they really codify these principles with what they call democratic design. They had always believed in optimizing form and function, like they wanted things to have beauty but also incredible purpose. But they added three more pillars. They now have these five pillars. You’ve got form, function, quality, sustainability, and low price.\nWe’ve talked about the quality. We’ve talked about again, quality is not maximum quality, it’s appropriate amount of quality for the object. Low price. We’ve talked a lot about sustainability. They weren’t extremely early. This is before anybody’s mentioning ESG. Most people are mentioning climate.\nThey are making heavy investments. Even in the late 90s when it was viewed as heretical. They probably wouldn’t have been able to do it if they were a public company, but starting to invest in renewable energy and other things. Now this is huge. If you go to ikea.com, it gets a lot of real estate and everything they do is their sustainability efforts. But their goal is to optimize across these five vectors and weigh the trade-off in between them.\nTheir idea of democratic design is that everyone, regardless of their income, can access well-designed products to improve everyday life. Every time they iterate on a product every year, they should be further optimizing some set of the products in the range to get a little cheaper, or find a little better way to manufacture it, or develop some way to serve more customers with the same product to get a little bit better scale economies, or to do something in a slightly greener way.\nYou could imagine a five point diagram where they have a score on each of these five. They want the total area to be as high as possible for everything they do across those five vectors.\nDavid: You sound like a McKinsey consultant now.\nBen: I am confident that diagram has a name and I’m proud that I don’t know it.\nDavid: Yes, me too. I’ve seen them before and I don’t know what it’s called and I don’t want to know.\nBen: But yeah, that is democratic design.\nDavid: Jumping forward to 2007. They hit $20 billion in revenue in 2007 up from (call it) $10 in 1999–2000. Growth is really still going here. Then they hit a rough patch.\nPart of that obviously is the financial crisis in 2008 and onwards, but it’s also e-commerce. IKEA makes the considered and deliberate decision here in the mid two-2000s as e-commerce is taking off not to participate or at least to participate only as minimally as is required.\nBen: Which, you can understand, is against every other element of their DNA.\nDavid: Totally. And I’m sure still to this day very much less profitable for IKEA than in-store visits.\nBen: I bet e-commerce is not a profitable business for them.\nDavid: I suspect that is right.\nBen: If you just think about all the ways in which they whittle price down, every single place they could make a deal with a customer and say, hey, how about you do a little bit of work and we don’t, we will give you a better price, and the customer says, okay.\nIt’s picking it out yourself in the warehouse. It’s assembling it yourself at home. It’s driving it to your house. It’s, oh, I don’t need the back to look good. It’s every single way in which the customer makes the deal with IKEA to yeah, lower the price a little bit.\nE-commerce blows it all up. The overhead, the cost structure required for e-commerce—shipping things to your house, having the delivery network figuring out a whole new supply chain—should it come from the store every time? Should it not come from the store every time? Should we box them differently?\nDavid: Should we use third-party logistics? Should we use our own, et cetera.\nBen: It goes in the opposite direction as everything they’ve been trying to optimize for the last 50 years.\nDavid: And even more than that—we alluded to this much earlier in the episode—it also breaks the beautiful closed loop ecosystem of controlling both the demand and the supply chains. In an internet e-commerce post-catalog world, IKEA no longer controls the demand chain in the way that they did before.\nSo for the next four years, between 2007 and 2010, revenue is basically flat. Growth falls off a cliff, zero growth for four years. In 2011, they do start growing again. Revenue hits €25 billion. They enter Latin America. They’re starting to open up new markets again.\nBen: But 2014 they decide to shift strategy, but not to start doing e-commerce. The strategy shift is to start opening small stores in cities, starting in Hamburg, Germany. They have now embraced this and launched in dozens of cities.\nDavid: Including San Francisco.\nBen: It’s this smaller set of products. It’s pretty interesting observing this trend toward urbanization and trend toward buying online. As of 2014, they still don’t really have e-commerce.\nOn the one hand, maybe that’s the right strategy. Maybe they never should have done e-commerce. I don’t really know. Because they’re not a public company and because they don’t break out segments, we don’t really get to know if e-commerce is a profitable business for them.\nWhat we do know is that over time, their revenue keeps growing. At least if you look at Ingka, the operator of these stores, their operating profit does not. In fact over the last several years it’s been declining. As a percentage of their revenue, the operating profit of these stores is going down.\nDavid, I think where you’re going with this is they really start going down, once IKEA does meaningfully start investing in e-commerce, starting in 2018 is when they really put their foot on the gas.\nDavid: And today, 2024, e-commerce is 26% of revenue.\nBen: It is what their customers want. You can’t bury your head and say, look, forever, we’re not going to do e-commerce because it doesn’t really fit with our model. If it’s what your customers want—the fact that 26% of people are doing it today—clearly you do have to go do that. But I’m not sure yet that they have a profitable way to do that with their model.\nDavid: Simply just inferring from the financial statements, they don’t, because revenue is growing, e-commerce share is growing, and operating income is flat to declining.\nBen: My only skepticism on it before truly issuing judgment there is maybe there’s something we’re missing since we don’t have full financials and we’re just looking at Ingka, which is the franchisee that operates the stores. Maybe there’s, I don’t know, but yeah, you and I ran the numbers, I’ll pull up the spreadsheet real quick.\nStarting in 2017, revenue continues to grow on the order of 5%-ish per year. But their operating margin drops from 8%, 6%, 5%, and hovers in this 3%–5% range the last few years. So something is happening that is making them less profitable.\nDavid: And seems like a fair assumption. It’s e-commerce. 2018, two big things happen. (1) They enter India, (2) Ingvar passes away in January, 2018 at age 91. Like we said, he’s working right up to the end.\nOne poignant story we heard in the research is after one of the last board meetings that he was part of, he took the rest of the board members and management aside and said, I’m so jealous of you—he knows he’s coming to the end of his life—that you get to keep working in IKEA and running this business, and I don’t. This was his life.\nBen: Absolutely. So 2021, they finally discontinue the catalog. It’s a sad, sad time. At peak, 220 million copies were printed across 69 different versions, 32 languages, and 50 markets. They really used to have their own proprietary relationship with customers.\nIn this new era on the Internet, anytime that I have a thought, oh, I need to go buy something, I Google it. I look at a bunch of retailers. I am not specifically IKEA’s customer in the way that in 1970 you would’ve been an IKEA catalog subscriber. And they don’t really have a way to engage people as strongly as they once did. Email marketing is just not the same as what the IKEA catalog was.\nDavid: Not the same catalog.\nBen: Now, on the one hand, they’re competing on equal footing. On the other hand, I’ve spent thousands of dollars at IKEA over the last few years since moving to a new house, having a baby. Yesterday morning, I bought $700 worth of IKEA merchandise in part to prepare for this episode, but in part I needed stuff.\nDavid: Hell, I’ve got the IKEA high chair that have used across two kids now.\nBen: Oh yeah. My son’s crib is IKEA. Oh, and by the way, that $700 was spent on e-commerce.\nDavid: Oh, you didn’t spend that on your trip to the store?\nBen: No. I had two big IKEA transactions in the last week. I wouldn’t have gone to the store if I wasn’t preparing for this episode, but the stuff that I bought online, that was stuff I needed and I probably wasn’t going to go to the store to buy it.\nDavid: Man. You willfully and intentionally cost IKEA margins. Literally took money out of their foundation’s profits.\nBen: I could have taken more time and gone to the store, but this episode would’ve been worse. I wouldn’t have had as much time to research.\nDavid: Oh there we go. This is like the version of when you google for products you want click on the organic results, don’t click on the ad result even though it’s the top of the page to save your favorite company’s money. Don’t buy IKEA online. Go to the store if you love IKEA.\nBen: At some point it’d be great to talk to somebody at the company about this. I’m sure they don’t lose, but they don’t make as much money. I don’t know. Maybe they do lose money on online orders. I don’t know.\nDavid: I don’t know. Ingvar isn’t alive anymore. I don’t know.\nBen: It’s true. I will say a thing that illustrates every point we’ve been making on this episode really, really well is, so they bought TaskRabbit for a small amount, $50–$75 million somewhere in there A few years ago.\nDavid: Yup, 2017.\nBen: And I checked the little box, like provide me an estimate of what it would cost for a TaskRabbit to come to my house and assemble all this stuff. $350 on a $700 order.\nDavid: So half of your purchase.\nBen: Yeah. That is the perfect encapsulation of how much money customers save by the IKEA flat-pack, pick up yourself at the warehouse model. In fact, it’s more than that because I think it was like $30 or $50 in a delivery fee. Call it $400 that you’re saving by buying something the IKEA way versus a fully-assembled delivered-at-your-house thing. I’m saving over a third of the total purchase price by doing it the IKEA way versus the traditional way.\nDavid: Which I’m laughing, brings up for me was the ultimate IKEA hack for many years of my life. I think I talked before on the Meta episode about how much I love Facebook Marketplace and Craigslist before that.\nI decided, probably, I don’t know 10–15 years ago, hey IKEA furniture, despite the fact that you have to assemble it yourself and whatnot, it actually is pretty durable. On the one hand it gets the rep of disposable, but if you take care of it, it’ll last a long time\nBen: Even through a disassembly and a move?\nDavid: Oh, I can attest to that. Not just through the move.\nBen: Really? Because my whole thing with it is, to me it feels like once you assemble it, it is good. But then when you disassemble it and put it together somewhere else, it always feels like it’s a little wiggly.\nDavid: Well my hack for quite a number of apartments and houses was just buy second-hand IKEA on Craigslist in Facebook marketplace and be cool with it.\nBen: Oh, so you could successfully move the IKEA and it wouldn’t…\nDavid: Yup. Not so much to save money, but more to save on the assembly. That was the reason I was doing it. And they hold their resale value pretty well.\nBen: Well first of all, they can’t really go down in value. They’re fully depreciated when you buy them for a $10 LACK table.\nDavid: I was not buying LACK tables on Craigslist.\nBen: But there are some things that are super durable and some things that aren’t. A lot of the press board stuff, once you pull it apart, I wouldn’t expect to be able to put it back together. But they do now sell $1000 dining tables made out of solid oak.\nFirst of all, I didn’t realize you could get just the materials to make that for $1000. That’s a $4000 or $5000 table at other retailers. But something like that, I expect to survive moves very well. I think it’s just unfair to say everything from this retailer is throw-away or everything from this retailer is infinitely durable. Neither are true.\nDavid: What I really used to do my hack with was the HEMNES line, HEMNES bookcases. We have had so many HEMNES bookcases in our homes over the years. Jenny did a PhD, so she has lots of books. Lord knows I have tons of books now as my vocation, our vocation. And HEMNES bookcases will last if you take care of them, and you disassemble, reassemble.\nBen: Fascinating. All right, should I take us through to the state of the business today and then we’ll get into the analysis?\nDavid: Let’s do it.\nBen: Awesome. But before we do that, we have one more of our favorite companies to tell you about. The climate-aligned AI infrastructure company, Crusoe.\nDavid: Crusoe is the vertically-integrated cloud platform built specifically for AI workloads, and was recently named the gold standard of AI cloud providers by Dylan Patel over at SemiAnalysis.\nCrusoe is just such a cool story. They build and operate enterprise-grade GPU data centers that are specifically designed for AI workloads, and each one is powered by low-cost stranded energy that otherwise goes to waste, or worse, gets emitted as greenhouse gasses.\nBen: They’ve totally reimagined the traditional data center architecture to support the huge power-cooling and compute density needs of AI. Like IKEA, they’ve done it all with a focus on getting the lowest cost of inputs possible—in this case energy—which enables them to offer better prices to customers, which leads to signing more long-term contracts, which leads to Crusoe building more capacity faster, which just makes the whole flywheel spin over and over again.\nAnd it’s not just better on cost, it’s also super fast and reliable thanks to innovations across virtualization, networking and other areas of the stack. They can do things like boot up a VM in under 90 seconds.\nDavid: Power demand in GPUs is increasing dramatically, which means that (1) the traditional data center design and engineering of the hyperscalers is no longer optimal, and (2) energy, not compute, is actually becoming the limiting factor in scaling AI.\nBen: Crusoee’s infrastructure, unlike the hyperscalers, is built from the ground-up for GPUs with elements like high density racks and direct liquid to chip cooling, which enables them to support the most demanding AI workloads that traditional data centers just cannot.\nDavid: And because Crusoe can build with this unique access to stranded energy, they’re able to bring massive amounts of compute online all at once. They currently have 15 gigawatts in their development pipeline, and their coming Abilene, Texas facility alone has over 1.2 gigawatts planned, which will make it one of the largest clusters in the entire world.\nBen: It’s just an amazing company. The net of all this is Crusoe can provide nuclear levels of power for less costs than other cloud providers, with low or in some cases actually negative emissions, David and I are super proud to be working with them and also to both be investors.\nTo learn more about Crusoe, go to crusoe.ai/acquired or click the link in the show notes, and just tell them that Ben and David sent you our thanks to Crusoe.\nAll right. The IKEA business today. We’ll start with a quick refresher on structure. There are two branches of IKEA to think about. There’s Inter IKEA Systems. This is the corporate entity that owns the brand and the IP. As of 2016, they also do all the product development, supply chain, all that stuff. They own all the inventory and the franchisees take possession of it almost on a real time basis as they need it.\nInter IKEA does three things: franchise; the range, which is the products; and supply, which is supply chain. The way that I would think about this is there are like two things in one: (1) they’re a company that designs and makes products to sell to franchisees, and (2) they’re a licensor that takes a 3% rake effectively on all sales, which it’s pretty fair.\nDavid: Totally, 3% of your revenue for the IKEA brand and concept. That seems very fair.\nBen: But also if you’re selling razor-thin margins, it’s actually a huge percentage of your profit pool. It’s like payment processing. You’re like, oh, what’s 3%? And then you look at the profits on a retailer and you’re like, whoa, I’m shipping half my profits to…\nDavid: Yeah. What did you say? Operating income margin is these days are like 6%–7% if I remember right.\nBen: That’s high. It’s like 4%–5%.\nDavid: Okay, yeah. They’re taking basically half of your operating income.\nBen: On the other hand, are these really different companies? There’s not really a deal between the two.\nDavid: And there’s actually a specific tax reason why it’s a royalty on sales.\nBen: From what I could tell—I’m not a tax expert—I think royalties are tax-deductible. By shipping money around between two entities instead of having it just be one simple C-Corp that runs the whole company, they are actually able to deduct those royalties off their taxes. Yeah, it is helpful for tax purposes.\nThat parent company did $27 billion in sales of goods and they made $1.4 billion from franchise fees. That number pencils pretty well. IKEA as a whole did $47 billion in revenue. When you think about it, the parent company sells $27 billion of goods to the franchises who then have their own top line of $47 billion. You can start to understand the margin structure a little bit\nDavid: And then they get that (call it) $1.5–$2 billion-ish effective cash flow back in the royalty of that $47 billion total revenue.\nBen: That’s exactly right. Okay, where does money go when it comes up to the Inter IKEA Foundation? This is again the parent company, the one who owns the IP, the one who develops the product range, all this stuff, but they don’t operate the stores.\nThat company is owned by the Inter IKEA Foundation in Liechtenstein. The main purpose, as we talked about, is to ensure the independence and the longevity of the IKEA concept and to own and govern the IKEA group. The Inter IKEA Foundation is a self-owned entity. That’s a new thing that I didn’t know existed.\nDavid: Is the Novo Nordisk Foundation also self-owned? This is sounding familiar to me.\nBen: Maybe, yeah. And there is no, nor can there be any individual beneficiary. Funds held by the foundation can only be used in accordance with the foundation’s purpose, which again, the purpose is ensuring the future of IKEA.\nDavid, you were doing some napkin math on this. What cash do you think is held by the Inter IKEA Foundation in Liechtenstein?\nDavid: It was reported around 2011 that it had roughly €15 billion in assets, and that does not include the value of the company. That’s just cash and marketable securities (call it) sitting on the balance sheet of this foundation.\nIn the 13 years since then, if you can infer from the financial statements—I think they actually do disclose now how much the operating holding company sends in cash up to the foundation every year—it’s like €1 billion in cash every year that gets sent to the Inter IKEA Foundation.\nJust add €13 billion more in cash every year, you’re up to (call it) close to €30 billion in assets there. That’s assuming no investment return compounding.\nBen: But 2011 to today is among the best investment returns in history, assuming they were just at market beta.\nDavid: Totally. That is like, like €50 billion-ish. Seems like a wildly conservative estimate for the amount of assets in this foundation. Arguably closer to €100 billion, but we don’t know.\nBen: It’s not a charitable foundation. Let’s be super clear. This is an enterprise foundation and their purpose is to ensure the continuity of IKEA. What do you do with $50-plus billion?\nDavid: Well, you start investing in retail centers.\nBen: This is not including the ownership of Inter IKEA itself, the company. This is in addition to the value of your ownership of that enterprise.\nDavid: Remember we were joking at the arena show that the Forbes net worth estimations of Taylor Swift are laughable because they’re just looking at what is her bank account and they’re not enterprise valuing Taylor Swift. This is like the bank account of the foundation, not valuing Inter IKEA the company at anything.\nBen: It’s fascinating.\nDavid: Yes, one of the largest entities in the world by assets. Then if you include the value of IKEA, I mean, my God, what do you value IKEA at as a company?\nBen: It’s funny. I had done some napkin math on if I were to buy all of IKEA including Inter and Ingka, what would I value it at? Maybe now’s a good time to share that. The whole company does something like $45 billion a year. It’s growing at about 5% per year.\nDavid: But operating income, at least for the moment, is not growing.\nBen: Right. There’s another company out there that grows at about 5% a year, that has a net income margin that bops around the 3% range, that’s also a retailer. And that company is Walmart.\nWalmart is valued at about 1.1x sales. you could value all of IKEA. Again, this would be Inter plus Ingka plus the other franchisees at about $50–$60 billion.\nDavid: That feels low to me just given the durability and defensibility of IKEA. But you could also make an argument that it’s fair.\nBen: Yeah, but call it $50–$100 billion. I don’t really care about slicing it Inter versus Ingka. I think this is all silly. But it is interesting to think there’s a cash pile that the Inter IKEA Foundation has to ensure the continuity of IKEA that is approximately equal in value to all of IKEA itself.\nDavid: That cash pile is almost certainly between €/$50 and €/$100 billion, whatever you want to say. Similarly, the value of IKEA is somewhere between €/$50 and €/$100 billion.\nBen: Totally fascinating. Then flipping over to the Ingka side of the house, this is the largest franchisee with 90% of stores. That is the 400 different IKEA stores out of the, what’d you say? It was 470 total?\nDavid: 476, I think.\nBen: That they operate. They also have what they call Ingka Centers, which is this shopping center concept we talked about. They have 44 of those experience-oriented shopping centers across Europe and China, and more are on the way.\nDavid: And they’re also applying that concept to the small city stores here. Interestingly in San Francisco, the IKEA here in downtown San Francisco, IKEA bought the building. It’s not just they leased some space in downtown San Francisco. It was actually an empty building. It was empty for a long, long time on Market Street.\nThey bought the whole thing, they put IKEA in, and now they’re putting other tenants into this complex. IKEA is participating in San Francisco downtown urban renewal, which is wild. But I think it’s all part of this, hey, we need to make some investments with all this cash.\nBen: Yup. They have this arm Ingka Investments that basically allows them to invest in other companies that they think will in some way be additive to their core business. It’s effectively super large scale corporate venture. Then their owner—this is again the franchisee that operates 90% of the stores—is the Stichting Ingka Foundation based in the Netherlands.\nThe other one was Liechtenstein, this one’s the Netherlands. This one is an actual charitable foundation that has a specific focus on climate and poverty. With this one, Ingka sends about 15% of their net income up to that charity, and then they use the other 85% for reinvesting in the business. Call it €200-€300 million a year that Ingka actually ships up to their charitable foundation.\nFrom what we can tell, it seems like the charitable foundation then does about €200 million of grant-making every year. Hard to know exactly what the endowment size is of the Stichting Ingka Foundation’s net of the asset itself. Any estimates that float around include the enterprise value of Ingka. But there exists some cash pile there that probably grows modestly because they’re doing so much donating out of the endowment.\nDavid: All that reminds me. There’s another big cash pile that we forgot about.\nBen: Oh, the actual balance sheet?\nDavid: The balance sheet of Ingka. Ingka has $25 billion in cash on hand.\nBen: Cash is not the constraint here.\nDavid: No, and that cash again is at Ingka, totally separate from that (call it) $50–$100 billion of cash and securities. We can estimate that is over at Inter. Anyway, one way to think about this company is basically like the Berkshire Hathaway of Europe.\nBen: Yeah, if you wanted to sum some things together and just pick some mid points. Let’s say you got $75 billion for the enterprise value, the whole kit and caboodle, then you’ve got another $25 billion on the balance sheet, call it $100 billion for the IKEA business.\nThen let’s say another $75 billion for the Inter IKEA Foundation’s cash pile. That’s $175 billion. Then the question is what is the cash size of the endowment that the Stichting Ingka Foundation has? I’m going to guess it’s smaller, $10-ish billion, but we’re still approaching $200 billion here in value, all created with no equity investment.\nDavid: No debt investment.\nBen: This is just 81 years of selling things, that provide value to customers, and reinvesting the dollars to do that again on a grander scale.\nDavid: I truly don’t think there is anything like this in the entire world.\nBen: I wonder if that’s true that this is the only business like that, and if we define it as a $200 billion scale built from nothing with no investment, exclusively investing the cash flows of the business for growth. There has been no inorganic growth. No material inorganic growth.\nWith Berkshire, they traded a paperclip for a house many times. With LVMH, they did the same thing. He had three years where he turned some small amount of money into $600 million to get the whole thing started if I’m remembering our LVMH episode correctly.\nDavid: Yeah, but LVMH, certainly capital both from Bernard and the family and other sources went into the business. Berkshire, maybe you could make more of an argument it was trading paperclips, but either way it was all inorganic growth.\nBen: Hermes is pretty good. I mean it’s been around twice as long.\nDavid: That’s a good point. Doesn’t have as much cash, is worth the same or maybe arguably more, but doesn’t have the ludicrous cash pile that IKEA has.\nBen: Meta didn’t use much of their cash, otherwise you could say Meta is this example. But they have a lot of other. Mark is not the only shareholder the way that Ingvar was.\nDavid: And it took venture capital to build that business and debt capital as we talked about.\nBen: That to me is the most impressive thing about this whole business, is that it was just one foot in front of another. Take your money, keep plowing it into the next thing.\nMore stats on the business today. They have 216,000 employees, they call them coworkers. It’s a slight decrease year over year from last year. IKEA is in 63 markets worldwide. Last year they welcomed 860 million people to the store.\nSometimes they say store visits, sometimes they say visitors. I don’t know if it’s 860 million unique people or 860 million times a person walked into the door, but whatever. Either way it’s crazy.\nThe demographic of their customer base is 20–36. There is an age where you churn out of IKEA, and they know this. This is measured in a bunch of external surveys.\nDavid: I’m surprised to hear you talking about how you’re doing so much active buying right now. Perhaps because you have your first child.\nBen: Nursery.\nDavid: I’ve totally aged out. As much as I love IKEA—it’s been such a huge part of my life for a long time—now that we’re onto kid number two, we’re reusing a lot of stuff. I don’t actually buy from there that much anymore.\nBen: There’s a great study that Earnest did that we’ll link to in the show notes, that shows IKEA’s peak customer age is 24. They start churning after that. It’s interesting to see the distribution like Crate & Barrel’s peak age is 31, West Elm is 33, Williams Sonoma is 33. Then you start to get into Restoration Hardware is 44, Pier 1 Imports is 45, Home Depot is 48, Lowe’s is 54. This is like the cycle of life.\nDavid: I love it. You go from the IKEA semi self-construction or believe self-construction, to then the I’m just buying consumer furniture, to then no, I’m actually building this stuff myself.\nBen: Exactly. Well you go from furnishing your apartment to furnishing your home to fixing your home.\nDavid: That sounds right.\nBen: Geography, Europe is still their core. 71% of sales even still come from Europe, even with the US is a huge and developed market.\nDavid: And Germany is still bigger than the US, I think.\nBen: 71% is products in stores, 26% is e-commerce, 3% is services to customers. I assume that basically means TaskRabbit.\nDavid: I assume so, yup.\nBen: The majority of the revenue is still product sold in stores. Growth is pretty slow, 5% or so. Not so different from Walmart. I decided I wanted to do a sales per foot analysis the same way that we did in our Costco episode.\nIt’s a private company. They don’t break it out and they’re limited in what they have to report to you. But if you assume all their revenue is spread over their 473 stores and you estimate it’s about 300,000 square foot per store, that gives you €320 a foot, which is like, I don’t know, $350 a foot or something like that.\nRestoration Hardware is $900, Williams Sonoma is $1300. But if you’ve ever been at a Williams Sonoma store, that makes sense. It’s overpriced and it’s very small.\nDavid: These are also small stores too. Well, Restoration Hardware is huge complexes but few of them.\nBen: And they’re these weird palaces. It’s a crazy business.\nDavid: Have you been to the one in San Francisco?\nBen: No.\nDavid: It’s freaking wild. You would think it’s a tech company headquarters. But no, it’s the Restoration Hardware building.\nBen: Really? They’ve been on quite the transformation going up market over the last couple of decades. La-Z-Boy is $157 a foot. None of this is on a spectrum of bad to good because IKEA is intentionally not trying to maximize their dollar per foot here. There are trade-offs they’re willing to make instead of maximizing that.\nNow let’s compare it to the companies we mentioned on our Costco episode. Costco is $1800 a foot. They are trying to maximize their dollar per foot. Walmart is about $600, Target is about $450, then these crazy businesses, just to compare it to the all-time greatest, Tiffany is $3000 a foot for jewelry, and Apple is $5500, a much smaller footprint.\nDavid: I should remember this from our Hermes episode. Do they report sales per square foot?\nBen: I don’t remember. I don’t think we talked about it.\nDavid: I don’t think we talked about it either.\nBen: It doesn’t feel like a thing they would report.\nDavid: But I got to imagine, though, that it is as high if not higher than Apple.\nBen: You think it’s higher than Tiffany?\nDavid: Yeah.\nBen: You might be right.\nDavid: We’ve spent a lot of time in Hermes stores recently.\nBen: We have, yeah.\nDavid: Can attest to some of the behavior that we have observed in there.\nBen: You’re raising their price per foot.\nDavid: No, I think I’m lowering their price per foot.\nBen: It’s interesting. I don’t really know how to think about this $350 number. They have a huge amount of square footage. They intentionally try to sell things as inexpensively as possible. The ultimate maximization function is almost like it’s not margin dollars. I think it’s number of items sold profitably at all. They want to sell more things to more people.\nDavid: I think it comes back to this concept of the many, which again maybe is a little hokey, but I actually think it is true.\nBen: They’ve built a $100 billion business on the idea of the many. It’s not hokey at all.\nDavid: It is the many that is the optimization. I think you’re totally right. I don’t think they’re trying to optimize sales per square foot at all. I think it’s just the square feet are all in function of the many. And they own all the real estate. It’s not like they’re paying rent. They choose the location strategically, and then they become a landlord to other people in these new MEGA shopping centers.\nBen: Their optimization function is they want to provide as much value to as many people in the world as possible.\nDavid: Here’s another reason why this metric doesn’t make any sense at all for IKEA. With the exception of Costco, which is its own thing, none of those other businesses also have their warehouses in their stores.\nBen: Then the last thing in the snapshot of the business today is the market. Today in 2024 with $47 billion in revenue, IKEA holds only a 5.7% market share. This is an astonishingly fragmented market. It was when Ingvar started the company and it is today still.\nDavid: Which is so wild and they are by far the largest player.\nBen: Even if you look around, where else do people get furniture that gets the job done, looks good enough and is a good value to them? Target, Amazon, Wayfair. But then you start to get quickly into more expensive—CB2, Pottery Barn. I get Walmart sells furniture, but.\nDavid: Oh yeah. I’ve been chomping at the bit all episode to talk about this. This is the craziest thing to me about this whole story. IKEA has proved beyond a shadow of a doubt that furniture and home furnishings is an extremely large, extremely global, very attractive market. One.\nTwo, IKEA and a whole set of other retail companies—Costco probably being foremost among them—have also shown that becoming a scale global player in a consumer market is a good position to be in. IKEA has no competitors in the Venn diagram of those two things. They are the only globally-scaled furniture and home furnishings company. That’s crazy.\nBen: Yeah. Okay, I’m foreshadowing power. As we move into analysis here—power is going to be our next thing we examine—just to name it, this company is scale economies.\nNow that they have reached escape velocity, like they’re through the take-off phase in Hamilton’s parlance, you can’t compete directly with them because there’s no chance that you could beat them on price or on quality for price. It’s almost like if there was going to be an IKEA competitor, they would’ve needed to start 50–80 years ago. A direct IKEA competitor. The most credible way to compete with them is doing something different.\nProbably the best competitive strategy is Wayfair, something that’s born on the Internet, that does something with a completely different cost structure than they’re capable of. Wayfair is not a high-margin business, but they have built the whole business around the idea that they sell online, whereas IKEA needs to figure out how to do that.\nDavid: Which, as we’ve talked about, e-commerce is a challenge for IKEA. If you make it your strength, yes. But you really got to squint today to see Wayfair becoming a global business on the scale of IKEA.\nBen: Wayfair’s a $5 billion market cap company.\nDavid: A long way to go. Now it’s interesting as I was saying that part of me is I’m thinking like, that’s so crazy. But you’re right. Let’s think through how would you actually compete with IKEA if you wanted to build a globally scaled furniture brand?\nWell, an obvious one that pops out to me is, okay, give the low- and low-medium–ends to IKEA and then compete at the top-end like Restoration Hardware is doing. The issue with that though, about going global is that tastes at the high end are way more heterogeneous and fragmented, especially across geography, than they are at the middle and low ends.\nBen: That’s a great point. You can’t have a narrow product range. You have a more expensive overhead in producing a wide variety of SKUs.\nProbably the most credible competitor from my perspective with me as a customer is Target. I probably would look at target.com and see if there are, because they partner with all these designers. They have a reasonable sense of taste. It’s not high-end furniture and never will be, and it’s not the best designs, but it’s like, okay, this is going to get the job done for a commodity thing in my house.\nThey don’t just sell furniture, but Target’s a $70 billion company. I don’t think it’s global in the way that IKEA is. Again, to your point, it’s competing on just furniture and competing at global scale. That’s a tough nut to crack.\nDavid: I totally agree with you that within the US or in North America, Target feels like the closest competitor to IKEA. However, exactly that. Target is a North American company. It is not a global company.\nBen: We’re pretty squarely in power here. Normally when we try to assess power we say, what is it that enables the business to achieve persistent differential returns, or put another way be more profitable than their closest competitor, and do so sustainably. We’re asking a slightly different question here, which is what enables this business to own this market?\nDavid: To almost uniquely exist.\nBen: Yeah, when no one else is really competing with them directly or at least competing with them across everything they do.\nDavid: I’m trying to think if we’ve encountered a business like this before.\nBen: You would have to counter position them because no one else can outscale economies them. Maybe Amazon would be the most credible because they have the scale if they were to make a real run at it. I assume there’s an Amazon Basics line of furniture.\nDavid: Yup, Amazon definitely has furniture.\nBen: There’s not switching costs from a customer perspective.\nDavid: It’s funny. I’m thinking through that now. Yes, Amazon definitely has furniture. Amazon is more or less global, more so every day. But there’s a supply side scale economies moat here for IKEA, which is if you’re Amazon, even if you’re just a retailer, you’re not designing or sourcing any of this furniture yourself, how on earth are you going to do the logistics around the world in the way that IKEA does?\nBen: Not to mention, at this point, IKEA, I think 10% of their furniture is actually made in-house at IKEA. They own their own manufacturer.\nDavid: Specifically they own their own manufacturing for their highest volume and most strategic products, for the hotdog products.\nBen: Normally when we do a power analysis, we’re looking at the competitors.\nDavid: There’s nobody to look at here.\nBen: I guess we should assess it versus Target in North America.\nDavid: I think it really is just local competitors in any given market.\nBen: They’re not in the same segment as William Sonoma or Restoration Hardware, any of these other furniture companies.\nDavid: Who, by the way, also are not global.\nBen: Ultimately it’s scale economies. Everything about this is the same scale economies as Costco. They take every dollar that they’re not shipping up to one of the two foundations, they’re not using to try to figure out e-commerce, and they try to deploy it in how do we further increase our fixed cost base to reduce variable costs. What are the ways in which we can design it better, or manufacture it better, or invest in another factory, or something to reduce the price for customers over time.\nDavid: I think that really is the only one that matters. I was tempted to say, oh, brand’s important here too. Yeah, the IKEA brand. Great. But compared to scale economies.\nBen: Well and the definition of branding is that you’re willing to pay more for it because it’s from that brand.\nDavid: The definition of the IKEA brand is you’re paying less.\nBen: It’s scale economies. It should be cheaper every time because of scale economies.\nDavid: That’s it.\nBen: And the interesting thing is cash really isn’t the constraint. This is a lot like the big tech company. It’s like what we were talking about with Meta. They have way more cash than they could ever strategically deploy.\nThe way for them to obtain more power is just grow even more. But they’re already using their cash maximally to the extent that they can grow without ruining some part of the business. So time is their constraint because time needs to march on in order for them to grow at whatever the rate they feel they can optimally.\nDavid: Which also comes back to their wackadoo crazy structure that Ingvar set up.\nBen: To make it as durable as possible.\nDavid: There’s a method to his madness here. Time is arguably the thing that the company is most optimized for.\nBen: So one question I have for you before we move to playbook is, what is IKEA? Is it primarily a store like a retailer or a merchant, or is it a furniture brand that happens to have vertically-integrated stores?\nI always thought about it as like, oh, it’s kind of Costco-esque because they’re in locations like Costco, and in some ways their business model, their obsession with thin margins, and serving many people in high volume is Costco-esque, but they’re not a merchant, really.\nDavid: I think they’re a merchant at heart. Ingvar was a merchant at heart in the same way that Sam Walton, Jim Sinegal, Sol Price, and Jeff Bezos were and are. It’s the whole P.T. Barnum aspect that we were talking about with the early days. It’s the showroom.\nBen: Shop the competition, incorporate their best ideas.\nDavid: That was the ethos. I think also that’s where this focus on value for the many. It is a very merchant retaily–type idea.\nBen: You’re right. But the way that it actually manifests is this vertically-integrated furniture and homewares brand that happens to have a really great experience for you to go and buy their products.\nDavid: Which is funny. Most merchants that are vertically integrated are focused on higher margins. They are not.\nBen: That’s an interesting point. Like Apple. This is the way in which IKEA is a lot like Apple. An Apple store sells Apple products and a few other things. An IKEA store sells IKEA products and a few other things. But IKEA is focused on minimizing margins and Apple is focused on maximizing margins. Super interesting.\nOkay, playbook. We’ve talked about some of this already, but just to underscore, this crazy corporate structure basically only helps them. When I was first digging into it, I was like, oh, this is going to have lots of trade-offs and pros and cons.\nIn the way that it helps them, it minimizes taxes, protects them from takeovers, ensures their durability. They have the benefits of being a non-profit corporation. There are no shareholders to appease, which enables longer term thinking. They’re protected from transitions of government power—the tax savings, the European Parliament, Green Party, estimated that they saved $1 billion in taxes between 2009 and 2014 alone. There are these benefits,\nDavid: Not to mention it neutralized what probably was realistically the biggest risk to the business, which was now or future family squabbles in generations to come. That’s just off the table.\nBen: Absolutely. The only way in which it hurts them is access to capital, but they don’t need money. Can you come up with another way that the corporate structure is a con? I mean it’s a con for society, I guess. It deprives people from the tax dollars that they would’ve to pay otherwise.\nDavid: Or the participation as an index fund holder or equity holder in the building of this business.\nBen: Oh, that’s true.\nDavid: That’s where my mind was going of, well, maybe there’s some reputational hit to the company by having this crazy structure. For a long time, people believed it was a tax dodge, which it may also be, but at the end of the day with IKEA’s customer, it doesn’t matter. Nobody knows or cares about that.\nBen: It’s true. Imagine they’re 10 times more successful and they are worth $1 trillion. Well that’s a real shame that the public is deprived from being an owner of all that value creation. Fascinating.\nThe other big playbook theme here is all of this is basically only possible because Ingvar built a business by reinvesting solely the business’s own cash flows. All this other stuff does rely on that.\nDavid: If there had been external capital and thus de facto external stakeholders, even if it was debt capital along the way, it’s hard to imagine history playing out like this.\nBen: Costco managed to make it work even though they raised a bunch of money.\nDavid: But they’re not structured like this.\nBen: But they can make a lot of the same long-term thinking decisions. In fact, Costco even runs on thinner margins. IKEA’s gross margins are mid-30% and Costco’s are 13%.\nThere’s definitely this thing that we’ve talked about a few times, frugality as an edge. They originally built in the potato fields as a way to save money, but it ended up creating and inspiring their business model that they need to create this destination experience.\nThe culture of frugality is interesting. Trying to buy materials at a discount, minimal sales staff, no finishes on unseen services, flat-packing, no one has assistance, I think actually the CEO is the only person at the company with an assistant, no one flies first class, they print on both sides of the paper.\nDavid: The assistant thing, the CEO may have an administrative assistant these days, but for years Ingvar had an assistant. But it wasn’t an assistant like an administrative assistant. It was like his chief-of-staff, like COO.\nBen: Didn’t he become CEO after?\nDavid: Exactly.\nBen: But it does actually beg this frugality as an edge, but could they run leaner? Why is it that Costco can have 13% gross margins, but IKEA marks their goods up more. Is IKEA bloated? Is the fixed cost of running the business, has it just gotten high to the point where you need high gross margins in order to pay for all that overhead?\nDavid: I think there’s an explanation here, which is that Costco—let’s put Kirkland aside—is selling other company’s products. Therefore, at least with the non-Kirkland products, Costco can take a lower margin because they’re reselling those products.\nBen: They don’t have to develop them.\nDavid: Whereas IKEA is designing, developing, producing.\nBen: So they should have a lot higher overhead, they should have a lot higher fixed cost base.\nDavid: Exactly.\nBen: Still feels like a big gap.\nDavid: Whereas in Costco, there’s actually—again, Kirkland aside—third-party products in Costco, there are two margins happening. There’s Costco’s gross margin, but then there’s also the supplier’s gross margin.\nBen: That’s the right way to think about it. We’re looking at the sum of two margins when we’re comparing…\nDavid: IKEA and Costco.\nBen: You’re right. Fair. This is a funny one. They lean into Sweden.\nDavid: Super hard.\nBen: Most companies that go international try to embrace the local market and let their origin fade into the background. But that’s just the opposite of the strategy that IKEA runs. In the meatballs, there’s this little Swedish flag that sticks out of the top of them. Every time you buy them, you walk into the store and it says, Hej!\nDavid: Which is so funny. IKEA has become the greatest Swedish ambassador.\nBen: So true. David, you’re going to love this because it’s from the complete other side of the spectrum. Here’s what IKEA does. They sell a sense of place.\nDavid: Oh wow. Hermes and IKEA separated at birth. There we go. For\nBen: Listeners that haven’t listened to LVMH and Hermes episodes, this borrows from the luxury playbook. Luxury companies sell a sense of place and mark their goods up 10x–13x on the cost of materials for that sense of place. IKEA does the complete opposite.\nDavid: Ben, you got a mic drop there. We should just end the season right there. It’s not going to get any better than that.\nBen: No, it is not.\nDavid: IKEA sells a sense of place. Amazing.\nBen: I do have one more, which is not nearly as poetic, but I’ll just finish my section off. They have a very contrarian view on working capital. This didn’t really come up in the story because I couldn’t really find the right place for it, but most companies, common wisdom is you should keep your inventory low and you should minimize the amount of your capital that’s locked up in working capital.\nIKEA has a very different optimization function. Theirs is about cost for the end consumer and ensuring availability of products at all times to keep customer confidence high. They’re willing to do things like build up excess inventories during certain periods if it means getting a favorable rate from a manufacturer who might have extra capacity, as long as it means eventually their customers will save money when they do buy it.\nI think a huge part of this is the foundation ownership, and the other part of it is the scale and the timelessness of their product lines. They sell these things forever, so they know they’ll eventually sell through that inventory. If there’s a good price on it, yeah, give me 1000. Sure.\nDavid: The BILLY bookcase is never going out of style.\nBen: Right. Honestly, if I describe a BILLY bookcase to you, there’s not a simpler way I could describe it. It is straight lines with no facade. The simplest bookcase that you could draw on a piece of paper, that’s the BILLY bookcase. That’s the LACK shelf. That’s the LACK table.\nIn their reporting, you dig into it, you see pretty high levels of working capital tied up, but they just don’t care. Capital is not a problem. They can’t deploy the capital that they have, so they may as well use it strategically.\nThe other benefit that dovetails out of this is they get to be really, really supplier-friendly. They can do things like net 30 terms when the rest of the industry is on net 60 or net 90 because they’re just not cash-constrained. they invest in the relationship with their manufacturers and that’s why they have, what is it now? 1600 suppliers, 55 countries, and the average supplier relationship is 11 years long.\nDavid: To pick up on that point, I was just thinking about what is my biggest complaint about IKEA? And as a customer over several decades of my life, when have I been most frustrated with the company? It’s when I go to the store and they don’t have what I want in stock.\nI’m sure they know this, too. That is my number one biggest complaint, biggest negative experience I would ever have as an IKEA customer. Yeah, tying up more working capital and inventory for the sake of the value to the customer, very worthwhile investment.\nOne more I wanted to add on this same vein that similarly didn’t have the right place to put it in the story, is their supply chain and just how really, really smart and strategic.\nBen: Didn’t you read the whole book? There were three or four books that we read. But you read a whole book on their supply chain.\nDavid: Yes. There’s a book called Strategic Outsourcing and Category Management: Lessons Learned at IKEA by Magnus Carlsson. Magnus was a senior executive in IKEA supply chain for 25 years. This book is awesome. This is the luxury strategy for supply chain. I haven’t read that many supply chain business school textbooks.\nBen: But you hadn’t read that many luxury books before either.\nDavid: I hadn’t read that many luxury books either. I can vouch, this thing is amazing. If you are at all interested either for your own edification or if it’s relevant to your business in supply chain, buy and read this book. It is so good.\nIt talks a lot about how they became more and more strategic in their supply chain and specifically their sourcing over time at IKEA. It’s the stuff you talked about, hey, you would think ordinarily we want to squeeze our suppliers on terms. But actually what we really care about is continuity of supply, depth of a relationship with these manufacturers. Let’s do the opposite and embrace them. That was like one level.\nThen the next big transformation is when they stopped thinking about sourcing and supply chain in terms of individual products and moved instead to product packages, suites of products, and then whole categories, they could say like, oh, rather than sourcing the POÄNG armchair—that’s a bad example because I’m sure they make that in-house now, but whatever product—let’s take a whole set of armchairs that are pretty similar and let’s bid that out globally rather than in individual markets.\nThat’ll let us (a) sure get the best price and then pass that on in value to consumers, but (b) build the deepest and most strategic relationship with the suppliers who are going to make that for us. Then we can also transfer technology to them too.\nStuff like the board on frame construction, they’ve done dozens and dozens of these technology advancements in fabrication, factory layouts, and all sorts of stuff over the years, and they transfer that to their supplier partners. It’s super cool.\nThen stuff like their distribution center strategy, so you would think totally logically almost like Costco, the stores are the warehouses. Well, over time they found that, oh, actually it doesn’t totally make sense that we keep 100% of our products stocked at all of our stores. Instead, let’s focus to what I was talking about my complaint, let’s make sure that the 50% of our products that account for 90% of our sales are really in stock at all of our stores.\nThen for the second half of our product catalog that accounts for the tail end of the power log 10% of sales, let’s do that across pan geographical distribution centers and keep actually a minimum of that in the stores with constant restocking, so that we can maximize the space for the products that we know people are going to want. Anyway, lots of really, really, really great stuff.\nBen: Fascinating. Stuff you can only do with 81 years of history and a lot of scale.\nDavid: And a lot of money. A lot of cash.\nBen: Yeah. All right, David, the quintessence?\nDavid: Woo, the quintessence. I’ve been thinking about this one. This is our new…\nBen: Yeah. For anyone who didn’t listen to the Meta episode, David and I renamed this section because we’ve been struggling with how do we land the plan, what’s the end of an episode look like? And David, you came up with this term, the quintessence.\nDavid: We boil it down after all this work we’ve done on the company, this long recording, like what is the essence? What is the quintessential factor of this company?\nI had been planning to say this idea of the many, and I think that there’s a reason Ingvar had it as testament number one, in The Testament of a Furniture Dealer. But man, the more we talk about this, I really think it’s something a little more “Meta,” which is this is an n-of-1 company. There is no other company in the world like this. It is so esoteric in so many ways. There is nothing else like this out there.\nBen: Or put differently. I think mine is the combination of never taking a single outside shareholder plus Ingvar’s personality and the desire to serve the many equals this company. All of those are necessary conditions, and there are many more too, but those are really necessary in order to create what IKEA ended up becoming\nDavid: And the structure that it ends up with. I guess maybe to put an even finer point that this is an n-of-1 company. The n-of-1 term is a little overused post–0-to-1. We make the argument all the time, like every company we cover on Acquired is unique. Meta is an n-of-1 company, Amazon is an n-of-1 company, et cetera.\nBen: But that’s the point.\nDavid: That’s all true. I think this is even another level. All the big tech companies, yes they’re all unique, yes they’re all individual, but they’re all big tech companies. There just is no other IKEA. There’s nothing like it.\nBen: That’s interesting. No other vertically-integrated retailer brand of this scale in any category. It’s Apple, but if they serve the many instead of the few.\nDavid: Well I guess arguably they do serve the many, but they have very high margins.\nBen: Well, but they specifically could serve five times more people than they do serve if they were willing to forego margins. Maybe eventually they will. They might be on a path to that.\nDavid: That’s a good point. This company is Apple if they decided to also be Android, essentially. We are going to own the whole market.\nBen: It seems like your definition is a brand that is vertically integrated, that is at $50-billion-a-year scale and serves philosophically the many. In some ways that’s what Tesla is aiming to be. These are not high-margin cars. They’re sold at the price where they can be the best-selling car in America. It’s hard to compete globally on EVs since the US and China are becoming pretty fragmented ecosystems.\nBut everything about Tesla is rate manufacturing, drive prices as low as you can, vertically-integrated. They don’t sell through any analysis. There’s no channel, there are no middlemen. But a brand of consumer good that is vertically-integrated and sold at low margin to the many.\nDavid: Globally. I’m just having a really tough time thinking of any. I can think of retailers for sure.\nBen: Yeah. Super fascinating. All right. We have reached it, the quintessence of IKEA.\nDavid: I think so. I’m so glad we did this company. It was, in many ways, off the wall. It’s this private, weird structure. Nobody can invest in it.\nBen: Totally. And I will tell you, for some reason I’m just not as fired up about it as compared to a Costco or an Hermes. But you study it, it’s really interesting, and it totally is n-of-1.\nI think the future to me is not quite as clear as some of these other companies. I think there are certainly a lot of question marks around what do they look like in an e-commerce world, a world that’s shifting to urbanization, and a world where they’re now a big company.\nDavid: What are they going to do with all this cash, et cetera.\nBen: That’s the reason watching them is going to be fun over the next decade or two.\nDavid: All right. Carve outs.\nBen: I’ve got two. One is a show on Netflix called Detroiters. I think a previous carve out of mine was the show I Think You Should Leave with Tim Robinson. This is his first show with his buddy who’s the, I think, co-producer. He appears in I Think You Should Leave also.\nIt’s a little bit more story-driven and less skit-driven than I Think You Should Leave, but it is totally the same Tim Robinson sense of humor. It has me dying laughing. So I highly recommend Detroiters.\nThe second one, I have a device I just recently bought. The new super thin 11-inch iPad Pro.\nDavid: How is it?\nBen: It is awesome.\nDavid: It’s so sexy.\nBen: There’s something really amazing about the promotion scrolling on a big screen when I’m just sitting there, and it feels impossibly thin. I know that’s a marketing slogan, but you feel it in your hands and you’re like, how? How is there an all-day battery life in this? And the screen is much more enjoyable to sit and read things on there than looking at my computer.\nIn fact, in particular, for each of these episodes now, I read the Worldly Partners research on the company we’re covering from front of the show, Arvind. I was able to read the whole thing, take it in, in a much more enjoyable way when reading it on the iPad versus sitting on my computer scrolling. It just feels really good. By the way, we’ll link to that research in the show notes for anyone who wants to go read 50–100 pages analyzing in a very structured way, the business of IKEA.\nDavid: Listen to four hours and then read another 50–100 pages.\nBen: But yeah, I love it. This iPad is so great.\nDavid: I’m so tempted because we both have the iPad minis that we got for when we do things live with guests.\nBen: Yeah, this is too big to use on stage.\nDavid: Oh, no, I was going to say, the iPad minis suck, and the thing that’s worst about them is the screen.\nBen: It’s awful. Apple doesn’t love it at all.\nDavid: They really suck. It’s a terrible product. We need it for that specific use case.\nBen: And it was fine when it came out, but it just feels like the leftover parts bin now. I almost bought the new one and I’m like, it’s the same screen. It’s last year’s dead-end processor from the iPhones. It’s just a weird franken device. The size is very compelling. I wish it had the iPad Pro screen. I wish it was thin. It doesn’t have to be thin, but try. I wish it had a new processor. I don’t know. It’s a bummer. They don’t care and it’s clear.\nDavid: They don’t care. I don’t even know why they make it, but I’m glad they do because we can use it for our use case.\nAnyway. I also have two carve outs. My first one is a re-carve out admittedly, but I’ve been enjoying so much this season, The QB School.\nBen: I thought that was where you were going.\nDavid: Man, it is so awesome to have The QB School specifically, but stuff like this on YouTube where, for folks who don’t know, this is a YouTube channel called The QB School, JT O’Sullivan who was a journeyman NFL quarterback for a decade.\nHe breaks down film of quarterback performances every week, breaks down the actual film from the whole as they would do it in an NFL quarterback’s room or the all 22 “camera angle” where you see all 22 players on the field, as opposed to what you see when you’re watching highlights or watching a game.\nWhen I first started watching and I had it as my carve out the first time, I was like, oh, it’s just cool to see this. I don’t understand 90% of what he’s talking about. I now understand a lot more, and it’s so awesome that consumers, I’m never going to play football again and certainly never going to play in the NFL, but being able to appreciate and understand what quarterbacks are doing and what teams are doing and players are doing at this professional level just increases my enjoyment so much more.\nEspecially this season when there are so many quarterback narratives going on. I don’t even listen to the talking heads anymore talk about Anthony Richardson or Bryce Young or whatever, because even if those talking heads were NFL players and they know what’s happening, they need to dumb it down for the mass audience. I’d rather just watch the film with JT.\nBen: Oh dude, I feel like that with Tom Brady. He just sits there in silence. Whatever is going on in his head is not at the right level for what needs to be said.\nDavid: I want to know what’s going on in your head. Anyway, really enjoying it. It’s been great this season.\nThen my second carve out, another sports media–related one was, did you watch Ice Cube’s performance during the World Series at the Dodgers game ?\nBen: I did not.\nDavid: Oh man, it was so good. I’m a Giants fan, so it pains me to say this, but Ice Cube, I think it was Game 2 of the World Series at Dodgers Stadium, performed at the start of the game. He just walks out from the center field fence, and then performs two songs, raps two songs while walking to home plate. It’s just him and a cameraman.\nYou and I now have performed in an arena, and we know what that is like. One person, Ice Cube, with no backing vocals, live on a mic, walking the length of a baseball field up to home plate, and just holding the stadium in the palm of his hands, it’s one of the most incredible performances I’ve ever seen.\nBen: I got to watch it.\nDavid: In broad daylight. Yeah, it’s awesome.\nBen: Ice Cube.\nDavid: Ice Cube.\nBen: Well, listeners, thank you so much for going on this journey with us. A huge thank you to our partners, J.P. Morgan Payments, Statsig, and Crusoe. Please check out the link in the show notes to learn more about any of those companies and their fantastic products that we talked about earlier in the episode.\nWe want to give three special thank yous to Jim Sinegal, the co-founder and former CEO of Costco for his chat about IKEA as we were doing the research; to Bjorn Bayley, the former president of IKEA US; and to Lars-Johan Jarnheimer, who is the chairman of the board of Ingka Group. Is that right, David? Or I guess it’s the IKEA group within Ingka.\nDavid: Yes, I think that’s right. Is of IKEA group, which I think is the operating entity within Ingka Holdings. The Ingka side of the company.\nBen: And you read all of Leading By Design, right? That’s the most canonical autobiographical book.\nDavid: Ah, yes. This is the confusing one. The updated version of the book is called the IKEA Story. The first edition of the book is titled Leading By Design, but it’s the same book.\nBen: It probably has the best detailed account of the blow-by-blow that we went through. Anyway, if you like this episode, go check out our episodes on Costco, on Walmart, or on Amazon.\nDavid: Or Hermes.\nBen: Or Hermes, that’s true. That wasn’t on my piece of paper here because I did not expect it to come up that way. After this episode, come discuss it on Slack.\nCheck out ACQ2 with Louis von Ahn from Duolingo. It would be super fun. Find ACQ2 in any podcast player. Seriously, I’m sending it to anyone I know running a consumer startup. It’s just so many practical lessons.\nIf you haven’t taken the survey yet, please do. We’d really appreciate it. It takes 3–5 minutes. acquired.fm/survey and you might win Meta Ray-bans, or an ACQ dad hat, or David might mail you a POÄNG, perhaps with some assembly. Thank you, David, for volunteering that on air.\nDavid: I’ll truck it across country.\nBen: Awesome. Well, with that listeners, we’ll see you next time.\nDavid: We’ll see you next time."
}