{
  "url": "https://www.acquired.fm/episodes/joe-montana-interview-live-from-modern-treasury-transfer",
  "title": "Joe Montana Interview Live from Modern Treasury Transfer",
  "heading": "ACQ2 Episode",
  "date": "August 20, 2024",
  "description": "We sit down with legendary quarterback Joe Montana to discuss his transition from one of the greatest athletes of all time to… one of the great venture investors today. Joe shares some of the lessons that he learned winning Super Bowls with the 49ers that he applies to his investing career at Liquid 2 Ventures. Joe also goes into their firm’s strategy and performance, finding and investing in dozens of unicorn startups at the seed and pre-seed stage.\nThis interview was recorded live at Modern Treasury’s Transfer conference in May 2024.\nAcquired’s arena show at Chase Center in San Francisco is just a few weeks away! We hope you can join us. acquired.fm/sf",
  "transcript": "Ben: Hello, Acquired listeners. We have a great ACQ2 episode for you today. An interview with the one and only Joe Montana recorded live at Modern Treasuries Transfer conference.\nBefore we dive in, if you are in San Francisco September 10th, or you are thinking about being in San Francisco September 10th, we would love to see you at our Chase Center show that we are partnering with our good friends at JP Morgan payments to put together.\nIt’s going to be a great night. Mark Zuckerberg is joining us on stage, we have a few other surprises up our sleeve, and it’s going to be an amazing evening of thousands and thousands of Acquired fans getting together for the first time, really at this scale for a night of fun and a live recording. It’s acquired.fm/sf to join David and I, and we hope to see you there. Now onto the interview.\nJoe Montana needs literally no introduction. But as a refresher, Joe played college football at Notre Dame, leading the team to a national championship. He played 16 seasons in the NFL, which included leading the 49ers to four Super Bowl victories. He was the Super Bowl MVP for three of those. He’s a member of the Pro Football Hall of Fame.\nWhile there is a deep bench of impressive football stats that we can share—we only have 45 ticking down minutes today—Joe has quite the post-football career that we’re going to spend most of our time talking about.\nIn 2015, Joe founded Liquid 2 Ventures, a pre-seed and seed investing firm. Liquid 2 has been wildly successful in their six funds that have invested in 800-plus companies. Their aggregate portfolio value is now well over $100 billion. They invested at the earliest stages in companies like GitLab and DUREL, Rippling, Rappy, Mercury Retool, and of course Modern Treasury.\nWe’ve got a great conversation today from football to investing and everything in-between. Please welcome Joe Montana.\nDavid: Our first question, I think it’s fair to say you are a top 0.1% venture capitalist at this point in time. You’re obviously also a top 0.1% football player.\nBen: Not sure how many zeros we have here, but…\nDavid: This isn’t supposed to happen twice in a lifetime at two very competitive, very difficult professions. What’s your secret? How do we do this?\nJoe: I learned a lot of things from Bill Walsh, but the one thing I took to heart is I watched him put together the 49ers, how to build a good team, and right from the start whether it’s our advisory board, including people like Ron Conway and Paul Graham, Jessica Livingston from YC, two of the founders there, and then just assembling the team.\nWe have a large team for the size of our funds. Most funds our size are run by one or two people, and we have five partners. But I just think the diversity behind everyone’s background really allows us to invest agnostically across all sectors. As early as we possibly can we try to get in, and sometimes there’s even a really true idea. I just think that the guys do a great job in hunting down the deals these days. We made a lot of good connections.\nThe nice thing about where we invest, it’s not always super competitive. We’re more of a friendly foe than anything.\nDavid: A friendly foe.\nJoe: We don’t try to run in and take and lead. We don’t mind being the second biggest check. Nobody likes to say that. You see, a lot of times the two of the big guys will come down and they’ll fight over a deal. One wins and then the other one won’t invest at all. Well, we don’t really care. We’ll jump in there behind you. We’re not proud. We’ve had a lot of success doing it that way. Like I said, the guys are great at the areas that they specialize in.\nBen: I feel like we’re going to go back to your football career here a little bit to start. You said the phrase “we’re not proud.” I feel like you built a whole career on not being too proud. I want to go all the way back to your draft moment.\nEveryone knows you were far from the first overall pick in the draft, and yet four-time Super Bowl champion. Can you take us to that moment where the draft is going on, you’re deeper and deeper in the draft, what is your psychology in that moment as you’re thinking about your football career?\nJoe: Well, it’s kind of crazy. You don’t really think about it or I didn’t really think about it, but what makes you think about it is that you have teams telling you they’re going to take you in the first round. They’re going to take you in the second round. Otherwise, I was just happy to get a chance to play in the NFL.\nThey put a lot of emphasis on a lot of things I think don’t always make a lot of difference. If you put 225 pounds on my chest, I might still be laying there on that bench back then. They’re so into size. If you look at the combine, have you ever seen a lineman run a square in a game? I haven’t, unless you’ve been hit too hard. But other than that, why you run the square? Just block that guy in front of you. That’s just all you needed to do.\nI just think that there’s just no real method to it that they figured out. You can go through the first rounds and see as many first round busts as you can go to the Purdy’s little world and see success stories from way down below. I just don’t think they have that out.\nBut yeah, I was thinking, well, okay, everyone goes the first round, goes the second round, I’m going, oh no, it’s going to get through the third and I’m going to be, but I got lucky and got snatched. I got a great opportunity, got with a great team, great organization, and was lucky to get Bill Walsh on as my first coach. Didn’t really want him to be anything other than only having one coach, but that didn’t work out.\nDavid: We’re going to come back to Bill Walsh, but to stick with the draft for a minute. I’ve been thinking about this. We’re living it again now with Brock here in San Francisco. Why is this so hard? Especially, it’s one thing, it shouldn’t have been this hard back when you were drafted, but now the NFL is the biggest media business in the world. There are so many billions at stake. How does Brock Purdy get picked last? How do teams get this so wrong despite investing so much money, so much time, so many resources? Why is it so hard?\nJoe: Well, if I knew that I could make that money.\nDavid: You’d be a GM.\nJoe: I’d have a startup in reference for the NFL. Sometimes they just lose sight of turning on the video and watch a video. They want to interview you and talk to you. When I played with guys who were lucky could speak, but they could play football. It’s just hard. It’s hard to tell who's going to make that transition.\nIf you look, you can do the same thing in high school. Go watch the guys they pick for what they had that Elite 11 for the quarterbacks. Just watch how many of those guys make it in college, and then you’ll see that again happening for that transition.\nI didn’t get forced into playing early. A lot of these guys get forced into playing and they’re not really ready for it. And especially in today’s game because if you watch, the thing that drives me crazy is they don’t teach the kids today how to read defenses. When you watch a college game and you see this happen and then back to the field, they’re telling them everything from the sideline. When you get to the NFL, you can’t be trying to learn how to do that. You have to know how to do that.\nIf you look at a lot of the read option guys, they make it for a few years because they run around. People finally figure it out that just make them run all the time. Make the quarterback run all the time, because he’s not made for running all the time. That’s what I would do. I would even say, okay, make him run and then I’ll pay the first fine for the late hit.\nDavid: That’s why you’re not a GM.\nJoe: That’s why I’m out of football. It’s just hard the transition that’s there. I think some people get caught up in it mentally, and sometimes they think too much of themselves, especially in the first round. Instead of just going out and playing football, I was hoping and hoping, the kid who was taken first from USC, I was hoping they passed on him just because he was so arrogant about, I’m only thinking about being the first quarterback taken. I just wanted him to go second.\nDavid: It’s probably the best thing that could happen to him.\nJoe: Yeah, but there’s a lot of pressure on that when you get up there because he’s going to play right away. They’re going to make… and those guys—\nDavid: I just watched the Netflix series, Quarterback. The pressure. Tell us about the pressure. You handled it better than anybody in history.\nJoe: Well, I was fortunate because I didn’t get forced into plane real early and I had a chance to get an understanding of what Bill’s offense was all about. He was on the forefront of what they call the West Coast offense, so to speak. But basically what it was—\nDavid: Why did you just roll your eyes at that?\nJoe: I don’t know. It’s more Bill Walsh’s idea than the West Coast.\nDavid: Should be the Bill Walsh offense.\nJoe: Yeah, but if you watch a lot of these games, these guys, like I watched in the 49er game at one point where I couldn’t see one person on the screen on TV. This is at the end of the game.\nNow, this poor guy’s standing back there and he’s got everybody 20–30 yards down field and nothing to do with the ball. He’s got those guys that he has on the team like what I had at the end of my career in San Francisco with John Taylor, Jerry Rice, Brent Jones and those guys. Jerry could do it, but John Taylor was the only one of only two receivers ever in one game to go 90-plus yards for touchdowns in the same game. They were very elusive.\nWhat Bill’s offense was about is I’m going to give you somebody down there, but you know what? If it’s first down or second down, I don’t need you to force it down there. I’m going to give you this guy and this guy down here too. You have a progression to go through.\nOffense was actually very fun and very easy to run. Not always did it look that way, but actually everything was built-in. There was a built-in hot receiver for every blitz that was coming. Your first thing you do, your eyes come up from the ball, you look for that hot guy, and then back to your reads.\nIt was just fun, especially towards the end there. Like I said, when you got guys like John and Jerry made my job easy, just get the ball. It was like a mailman. This doesn’t belong to me, put it in the slot. Here you go.\nBen: I’ve heard you in previous interviews talk about how the play calling for the West Coast offense was different, especially how college ball typically was called. Can you walk us through simple, straightforward play calls versus what you had to learn in this new innovative system in the West Coast offense?\nJoe: Well, when I came out of Notre Dame, we were running a numbered system. If we were running a pass, the number that you would start on the left, you would say 789. You had a route tree and they were all numbered.\nThis guy would run seven, he’d run at eight, and that guy would run a nine, and so forth. When we got to San Francisco, Bill’s offense was numbers and words. The numbers really meant nothing but protection. How you were protected and where the tight end would basically, what side of the ball he would be on.\nIt also would tell you which guy was hot. The second number told you which guy was the hot guy and where you had to look first. Then the words came after it told you the play. we would say 20-red, 20-halfback read. Red was the formation, 20 was the type of protection, halfback read, we only told the halfback what to do. Everybody else had to learn, when they hear halfback read they all had to know what their route is because we didn’t tell them. Well, sometimes I had to tell a lot of guys almost every play.\nDavid: Again, if you watch the Netflix series, making the quarterback on the field having to make executive decisions, was this the beginning of that with Bill?\nJoe: The only time we really were put in the position is when you would line up and there was just a blitz that you could not handle and you had to change a play. Otherwise, he wanted you to go with the play he called.\nThe main reason is we had so many plays in our offense. We would typically have 125 passes in a game plan, maybe 130, 35 more runs, and all those had 2 and 3 formations. You had to memorize the order of those and that he wanted them in because the only thing you got signaled was the number, the play. You got 20 halfback reads, you didn’t get all the rest of that stuff and didn’t have time to tell you what the formation is because we didn’t have the earpieces that they talked to in now these days.\nSo for me, it was from Monday until Saturday night, I was studying to learn and memorize those formations. But on top of that, I had to understand the play at the same time. It was very, very difficult from Monday to Saturday. I did not have time or would I have had enough time to go on and study down in distance for what the other teams do during those periods.\nA perfect example where we lost to the Redskins in the championship game. Bill, back then, the losers coach in the Pro Bowl. We’re in the Pro Bowl and Joe Theisman was there who I’ve known for a long time since he went to Notre Dame also.\nFirst day of practice, Bill puts in 35 pass plays and Joe looks at me and goes, well this is awesome. Bill gave us all our pass plays in one day. I go, you’re crazy. I go, he is going to install until Saturday. He goes, what do you mean? I go, I’m not even studying.\nTypically, we get 60 or 80 on the first day of practice, and he continues to put in install until Saturday. He goes, there’s no way. Sure enough, he installed all the way until Saturday and Joe goes, I don’t know how you do it. I go, oh, this is easy. I told you I’m not even studying. That for me was easy back because it is nowhere near the pressure.\nBen: So your job was just as cerebral as it was a physical one.\nJoe: Yeah, and then on top of that, you had to watch a video of the defense because you had to understand, you had to find out there was always a little key. Usually, there was one player that would tell you and give away, it’s a blitz or it’s a different defense than what they’re lining up. It took hours and hours of film watch.\nBen: That feels like an AI opportunity. Just find the correlation between…\nDavid: Find and tells.\nJoe: You know what? It probably will be if it isn’t already, but—\nDavid: The Surface tablets on the sideline are all on.\nJoe: Oh yeah, that’s a great story, tablets. You know what we had? We were in New Orleans and there was a wire that came from way up in the boxes. And you know those metal paper clips? They would take a Polaroid of the play and a Polaroid right after the ball was snapped, pin it to that thing and slide it down the wire to us on the field.\nDavid: Above the fans?\nJoe: And then, it got down to us and then we got a chance to look at it. I would’ve given anything for an iPad.\nDavid: Oh, that’s amazing. We want to transition and talk about leadership and teams and investing, but maybe a good way to do that is just tell us a little bit about Bill. What was it about the team that he built? He was such a maverick. What was playing for him like?\nJoe: It was great, honestly. We always have our disagreements in the way things are done or the way you’re being treated sometimes. But in most cases, we had a blast. He was fun to work with. He had a crazy sense of humor, real dry, but he was very ahead of his time.\nGuys would come up to us during the season and go, okay, seriously, you guys don’t wear pads for two days in training camp. Yeah. You don’t wear pads during the week in practice. Yeah. Why? No way. And they would say we hit from Wednesday, have tack full pad practices all the way until Friday. What Bill saw was that our lineman—you could watch it—they never wore sleeves. Their arms were always just a mess of bruises.\nHis philosophy was, if I see the effort from you guys that I want, we don’t have to put pads on. And I want you fresh on Sunday. I don’t need you fresh on Wednesday. As long as you do that, I won’t make you go back in and put the pads on. Of course he made us go back and do that a couple of times just to prove we could do it. But he was always ahead of his time and the things that he did.\nIt helped with Mr. DeBartolo too because he was very generous to us. As long as things were going the right way and working in that organization and the things that they do that don’t seem to make a big difference, made a huge difference.\nMost of you probably don’t remember the old DC-8. They were a big flying pencil. Long, skinny thing. We were the most traveled team. Going there is never an issue. It’s when you come back after the game because there are ice bags, IVs and everything.\nOur first away game in—I think it was 81—the DC-8 broke down. We had a DC-10 and everybody was so excited. We go to the game, we win, and Mr. DeBartolo comes into the locker room. Everybody’s happy, then they see Eddie and they start going DC-10, DC-10. He goes, make you deal. You keep winning, you can have the DC-10. We went undefeated in the—\nBen: What is the Charlie Mungerism? You show me the incentives…\nDavid: …I’ll tell you the outcome. Oh, that’s amazing. Well to transition over to your post-football greatness, maybe this is too obvious to even ask, but what role did playing in San Francisco have with you doing what you do now?\nJoe: Well, I’ve done what I would call the Bill Walsh kind of way. The guys won’t agree with me, but this is what Bill would do. In the beginning of 79 when I got there, we were 2 and 14, and I swear every Saturday it was like a revolving door.\nAs soon as we left practice, 50 more guys came in to work. He was trying to build a culture that he knew he wanted and he knew he didn’t have it. It didn’t matter how good you were. If you mess with that culture, you would be gone. He didn’t put up with the interfering in the locker room and making that a mess.\nI did the same type of thing when I first found my first two partners. I made them work for almost three months without pay.\nBen: You show me the incentives and I’ll show you the outcome.\nJoe: They laughed about it and now they laugh about it. But as things grew and I realized that, I mean I warehouse 26 deals and then once we figured out we could work together.\nBen: Just for non-investors in the room, that means you personally invested in 26 companies that you then put into the fund.\nJoe: I dropped back into the fund at cost. As my wife reminds me, one of them was GitLab, so she’s not really happy about that one.\nBen: Do you recall the order of magnitude valuation that you invested in GitLab?\nJoe: Oh, we were pretty close first money in, yeah.\nBen: So not a bad early investment.\nDavid: Not bad.\nJoe: Still not a bad return, but it would’ve been better if it was all mine.\nDavid: So you’re saying they got a good deal by working three months for free.\nJoe: Yeah, but eventually these guys never invested before. They both had started companies. One’s company was in the mobile feedback space, and got bought by Google.\nBen: This is Michael, your partner?\nJoe: Yeah, Michael Ma. He was a Yale grad and Harvard MBA guy. Mike Miller, I give him a hard time because he’s a Notre Dame, Michigan State always had this thing going. He’s a Michigan State undergrad, but he’s a PhD in experimental particle physics out of Yale, MIT fellow. Both these guys went through YC. His company went through YC when it was still back in Boston. There were only 12 companies in the batch, unlike the—\nBen: Yeah, and Reddit was probably his batch mate, or maybe Dropbox back then.\nJoe: Yeah. His company that he started ended up being bought by IBM and basically started IBM’s cloud service as it is today. Then my son, who Ron Conway started taking myself and him to Y Combinator when Ron spoke to the batches, we were doing individual investing together. Then Nathaniel caught onto a startup like real, real early. They went on a crazy runway rate, and got bought by Twitter. He went to Twitter for a year-and-a-half and then came back to the fund.\nBen: Did your interest in startup investing come from Nathaniel’s plugged-inness in that world?\nJoe: Yeah. I think Nathaniel’s the one that got the idea going because of my family relationship with Ron. He said, oh yeah, you guys can come with us. We followed the SV angel guys around, trying to figure out what their secret sauce was, listening to the questions they’re asking and looking at the companies they’re looking at. He was happy once he left Twitter and he came back.\nNow we brought on one other partner who was one of the original investing partners at CO2 in the pre-seed area, and then became a partner at Eclipse. He’s been a real close friend to the family. He and Nathaniel were both walk-on quarterbacks at Notre Dame. Matt had a little different track than Nathaniel did to the fund, but—\nBen: Wait. What percentage of your employees were quarterbacks at Notre Dame?\nJoe: Sixty.\nDavid: Sounds like 3–5 partners.\nBen: Well there’s the answer. We figured out how to be a top 0.1% investor.\nDavid: How did you first meet Ron Conway?\nJoe: I can’t even remember. It’s been so long. Just by being in the valley. I originally got into the venture space by Ronnie Lott and Harris Martin. When we started a fund of funds in the venture, basically all our friends and neighbors were all guys who ran Sequoia, Kleiner, Excel. We just leveraged our friendship to access the funds.\nBen: And you raised a fund of funds that became an LP in those venture funds. That’s what HRJ was.\nJoe: Yeah. After a while, we had venture leverage, buyout, hedge, and real estate funds, and all we did was raise money. So the fund to funds was no fun. That’s when, I don’t know, reconnect with Ron. He’s going, oh, this is a lot more fun. You get to meet with the founders, you get to see all the new technology and things that are coming up. It was a lot more fun. He just forgot to tell me how much more work it was going to be on top of it. But yeah, I’ve known Ron. We actually travel with Ron almost every summer and his family together.\nDavid: So staying in San Francisco after your playing career, what was that decision like?\nJoe: Well, we keep trying to think we want to go somewhere else. We just can’t figure out where we would go that would match where we are. But it helped by staying here because what a lot of guys tried to take advantage of it while we were playing, I just didn’t have that wherewithal and time. I had too many things that I had to work on—\nDavid: You’re spending seven days a week with the West Coast offense.\nJoe: Yeah, I wanted to play football. I knew that eventually I was going to retire and I could find another way to do something that would be fun and maybe as exciting, but not quite, except on IPO days.\nBen: You got to humor the audience a little bit.\nJoe: IPO days are good. But yeah, I just realized that I’d missed a lot of stuff while I was playing. When Ronnie and Harris, I really wasn’t looking for another job, wasn’t a full-time job at that point because I really had just retired, I said, okay, why not? Off we went and just grew into where we are today.\nI think I’ve done one of the things that drive a lot of people crazy. I love the team I have, so I made everybody equal. We all get paid the same, we all get the same carry. I make them buy lunch and breakfast. Can they make more salary somewhere? Probably. Can they get the carry I’m giving them? No, they can’t get that as at another fund. Unless they start their own.\nDavid: We’ve spent a lot of time doing Acquired episodes on the big venture firms. This is always the big topic is how do you split up the carry.\nJoe: Fund I and fund II, I made them earn. I gave them a certain amount of carry, then I made them earn more. Fund from fund III on, I said you know what? I think we’re doing a great job. We’re working well together. I want to make everybody equal. You guys have a problem with that? And they said, no. I said, I didn’t think so. So off we go.\nActually I make less than they do because I’m paying two other people—a head of finance and a head of operations. I took the cap money from me and not from them.\nBen: What are the trade-offs? Give us the pros and cons, because it sounds great, but in practice, what do you actually see that do to the organization?\nJoe: Well, that’s the one thing that Bill said from right in the beginning. He said, I just want to tell you guys because there’s no rookie hazing here. He says, when somebody walks in that door and in that locker room, they’re part of the 49er team and organization. You treat them and you treat the people upstairs. No matter the people who work on the field, you treat them with the same respect you treat everybody in the locker room.\nI just think that he had the hammer, though, so I had to find a way to get the hammer because I gave up a lot of the things. I just owned the management company, that’s my control where all the money goes.\nBen: But separating economics and control is a great structure for that.\nJoe: Yeah, and we do majority rules on things. We try to get at least two partners on every deal and usually try to get as many as we can, get eyes on deals. There’s no bickering over, well, I brought in more capital, well I brought in more companies. What’s more? How do you weigh those?\nI couldn’t figure that out. And how you put a price on either one. I just said it just makes more sense to me just to say, look, it doesn’t matter. If I bring a deal in and it’s not really what Mike Miller should see, I just give it to Mike Miller. It’s not an issue of, okay, it’s my deal or is it your deal? It’s our deal. That’s the way we operate. So far, we haven’t had any issues with it. Everybody’s still off and running.\nDavid: It’s so rare in venture firms—period—that there’s this model. We’ve done several episodes on Benchmark. They famously have this model and very few others do. I imagine you must be the only venture firm, a providence like yours of there are many other athletes, celebrities, et cetera, former athletes who have venture firms now, that have an equal partnership model.\nJoe: I think a lot, but I think one of the things that the other athletes didn’t realize is that it’s a day-to-day world. It’s not put your name on something and let somebody else run it. I just can’t. I don’t operate that way.\nDo I stick my face in there and say, hey, this isn’t right? When it’s time, yes. Other than that, I just let them operate and I just oversee that right now. If you look at success, Fund I was $28 million. We returned the Fund I 0.8 times X, and we still have 21 unicorns in the fund.\nBen: Do you want to share what the current multiple is sitting around?\nJoe: It’s sitting somewhere between 8 and 10.\nBen: It’s not bad.\nDavi: That’s pretty good.\nJoe: Fund II was we raised $53 million. We returned about (I think it’s) 0.8 of that and have 13 unicorns sitting in that. Fund III we already just closed less than a year ago, and we have one sitting in there.\nI think we’ve been fairly successful with the model and in our ability to pick companies. Part of that reason is that our guys are so good and understand the growth pattern from what we call zero to one. Because they’ve all been there and understand that. They’ve had exits to large corporations, and they understand what’s necessary and what needs to look like.\nFrom there, we’ve gotten so many accolades from our portfolio companies saying, hey, you guys punch way above your check size. Our check sizes now are between 250 and 500. I just think that we’re onto something good and I want to try to keep it that way as long as…\nBen: Yes. You have this new problem, like the initial problem for any startup or Fund I is does our idea work? And you’ve now proven with the numbers that you just shared with us, okay, it works. Your new problem is we have this magic thing in our hands. What do we do with it? How do we harness it? What things are different as you look forward to making sure that you don’t (a) kill the golden goose, but you can (b) lean into it as much as you can?\nJoe: We’ve solved that problem, but because of the SEC, I can’t talk about it.\nBen: Understood.\nDavid: Understood.\nBen: We won’t push you.\nJoe: We’ll be able to follow on. That’s what it [...]\nBen: Great. Completely different question in a completely different vein. Your fund is not called Joe Montana Ventures. It’s called Liquid 2. What was the logic there and where did that come from?\nJoe: To me when I first was trying to figure out a name, I came up with all these ideas, and then I was going, oh, liquid. It’s like an oxymoron. It’s not liquid at all.\nBen: It’s one of the [...] asset classes in the world.\nDavid: Preseed is about as far away as you could get.\nJoe: And it’s funny how things fall together because I said it was liquid and it was taken. Liquid 1 was taken, Liquid 2 wasn’t taken, so I got Liquid 2. Then I was sitting around and I drew up the—\nDavid: I was like, was this a play call or something? Like where did this come from?\nJoe: I drew up the logo and it was just an L and a 2 like that. Mike Miller, our resident PhD, says, how’d you come up with that? I go, well, I was just playing around with the L and the 2 and it looked good. I go, why? He goes, well, because I did a thesis on that and it’s someplace in outer space that is trackable, but it’s hard to find. I go, perfect. Sounds like venture to me. Things have fallen in place so far.\nBen: It also could be named after the L2 cache on a processor, if you’re really into deep tech investing.\nJoe: Everybody keeps trying to, for the longest time, wanting to change the name. I go, okay, so here’s the problem. Right now, everybody knows us as Liquid or L2. Why do you want to mess with that? You’re going to change the name and then no one’s going to remember. I said, they already know, it sounds like a crazy name, but we’ve built something behind it.\nWe’ve been going through some exercises to try to update it a little bit, but we’ll probably stick with the name. I think I got him convinced that it’s not worth the effort of changing it.\nDavid: Other than the obvious Ron Conway connection, you learning from him, and this is what he did this, this type of investing, was there any draw to be like, well, hey, maybe you should pick a little easier style of investing? All the jokes about the anti liquidity early on, pre-seed and seed is hard. You’re talking to two former seed and pre-seed investors here. It gets hard.\nJoe: It is hard, and I think one of the things we looked for is—obviously you guys understand that—when you get down to that down there, you’re looking at people. In a lot of cases you’re betting on people. Because our portfolio is so large, we get repeat founders now. We get, hey, my head of IT is leaving and he’s starting something new. You should look at it.\nOur deal flow comes from almost within our universe that we put together, and it helps us get in earlier. Getting those types of returns, if you’re in pre-seed or in some cases friends and family, everybody says if you can get to 3X you’re doing well. If you can get to 5X, you’re doing extremely well. We try to aim for 5X, but in real honesty, the thing that sticks in my mind from Doug Leone from Sequoia, if it’s not 10X, we don’t want to look at it.\nBill’s philosophy always was, hey, if you aim to be perfect and you miss, you can still be pretty good. And if you aim to just be mediocre and get by and you miss, we won’t be on this team very long. Our bar, we set high for ourselves. If we miss down there, we’re still in the top tier. All of our funds are either top 5%, top 25% of venture.\nBen: That’s awesome. Well, David, you’ve got the closing question?\nDavid: Yeah, we have one. I don’t think you know we’re going to ask this. Fun question to wrap up here and transition back to Dmitri from Modern Treasury. We were looking up, we do a lot of research on Acquired, and we’re like, okay, we go all through Joe’s history. We found this one thing and we’re like, okay. You can’t make this up. After football but before Liquid 2, you co-founded a bank called Modern Bank.\nJoe: Yeah. I had a friend of mine who I met when I was at HRJ Capital. We stayed friends for a long time and he just came to me one day and said, hey, I want to start this bank. Actually, we were trying to do what First Republic did. As you know, they had offices in to where Sequoia and all they were, but we could only get a charter in New York. We couldn’t get one out here in California. We ended up finally giving up.\nAt that point in time, it’s still there. It went from a personal bank to a commercial bank now, and mostly on the East Coast. I left the board. I said, I can’t help you back here. Coming back and forth to New York every month. It just makes sense for me to get off the board. But yeah, we were having fun. I was only on our board. I was only out-banked by, I think it was 250 years to 300 years of…\nDavid: Banking experience. yeah.\nJoe: …on our board.\nDavid: Clearly it predestined you to founding Modern Treasury\nJoe: Yeah, but it’s crazy. It was fun to do while we were working on it and I totally forgot we had founded it. I get checks. I guess it’s good, right?\nDavid: Well, that’s great.\nBen: All right, Joe, I’m sure on the live stream and here in the room, and for any Acquired listeners, a lot of founders, any advice after working with so many founders over your venture career?\nJoe: There are a lot of things you have to go with your instinct and your gut, and a lot of people are afraid to ask for help. I think that’s where the problems always seem to arise, is that when you know there are issues and you let them simmer too long. You have people who invested in you early that are there, that you let invest early, because most of the cases they decide who gets to invest in the startup. Lean on them as much as you can, and they’ll help you through it.\nOur approach is we’re not Sequoia, we’re not Excel, we don’t come in there and try to run your company. But you have an issue on your monthly statement to us. just put an ask section. As soon as we see that, we go to work as fast as we can. If there are 10 of them, we’ll pick the top 3 or 4 that we know we can go after and we can help on and we’ll try to do.\nI always say, we’re in the boat together. You’re driving. If you need help, just let us know. We will help you steer and get to the right place that you need. If we can’t do it, we’ll help you find the right people to help you do it. Most and almost all founders are really proud of what they’re doing and what that, and sometimes you just get afraid to really say, hey, I need some help until it’s too late. Then help can’t come fast enough.\nDavid: Well, Joe, this has been a great conversation. Thank you so much. Thank you, Modern Treasury. Thank all of you for being here. To close out the day, please welcome Dmitri back to the stage.\nBen: All right, listeners, that is our show for today. We hope to see you at the Chase Center, September 10th. If you can make it, acquired.fm/sf is the link, or you click the link in the show notes. I’d say I’ll see you next time, but for many of you, we will see you very soon."
}