{
  "url": "https://www.acquired.fm/episodes/mars-inc-the-chocolate-story",
  "title": "Mars Inc. (the chocolate story)",
  "heading": "Fall 2024, Episode 4",
  "date": "December 15, 2024",
  "description": "The Complete History & Strategy of Mars Inc.‍\nM&M’s, Snickers, Milky Way, Double Mint, Ben’s Rice, Pedigree, Whiskas, VCA, Banfield… all the brands you know, owned by the company you know nothing about: Mars, Incorporated. And Mars itself is 100% owned and deeply intertwined with the Mars family, who are currently the second wealthiest (and perhaps first most secretive!) family in the United States. Tune in for one of the 20th century’s most incredible entrepreneurial stories across candy and pet care, and one that’s all the more incredible because it’s so little-known!‍",
  "transcript": "Ben: Okay, David, how many current varieties of M&M's can you name?\nDavid: Wow. Okay, plain, peanut, peanut butter.\nBen: Actually, plain is technically now called milk chocolate.\nDavid: Interesting. There’s dark, right?\nBen: Yup, which I’ve got right here.\nDavid: They had mint for a while. Did they discontinue mint?\nBen: Mint is a holiday-only theme, so that’s a seasonal one.\nDavid: What else? At the end of the day, it’s only plain and peanut that matter, right?\nBen: I think in sales numbers.\nDavid: Are there pretzel ones?\nBen: There are pretzel ones. There is also almond.\nDavid: Oh Almond, yeah. See, I’m allergic to almonds, so I never think about almonds.\nBen: There are also some weird ones. Caramel. I don’t want that at all, but they make it. Crunchy cookie, which replaced Crispy of our youth. Do you remember the blue packaging Crispy M&M's?\nDavid: Yeah, I remember the crispies.\nBen: Then there are some specialty ones, dark chocolate peanut, which I really want, fudge brownie, campfire s’mores, and caramel cold brew.\nDavid: I don’t know about any of these.\nBen: Then there are these really wild limited edition ones in addition to holiday mint—birthday cake, chili nut, and pumpkin spice latte.\nDavid: That sounds disgusting.\nBen: I know. But yes, I think you are right. The milk chocolate and the peanut are the sales drivers.\nDavid: Yup.\nBen: All right, should we do it?\nDavid: Let’s do it.\nBen: Welcome to the Fall 2024 season finale of Acquired, the podcast about great companies and the stories and playbooks behind them. I’m Ben Gilbert.\nDavid: I’m David Rosenthal.\nBen: And we are your hosts. Listeners, we were thinking. What episode would be fun to do before the holidays? We picked M&M’s, thinking this’ll be just some nice light hearted fare about the candies and the characters on commercials that remind us all of our childhood.\nBut as we dug into Mars Incorporated, the parent company, we realized that the story is totally thrilling. It’s got World War I, World War II, new technologies and inventions, and serious family drama. Their corporate strategy over the years is just as clever as companies like LVMH, Walmart, and Costco. You don’t get to be the second wealthiest family in America without it.\nDavid: Seriously. Maybe it’s because we just did it, but I feel like there are a lot of echoes of IKEA in this one, too.\nBen: Absolutely, and the Mars family is way more quiet and reclusive than the Kamprad family, too.\nDavid: They’re way more quiet and reclusive than anybody.\nBen: Yeah. Mars also owns way more than you think. You may know that they own the world’s most popular candy, Snickers, in addition to M& M’s, or perhaps you know they’re in the pet food business. But they also own everything from Ben’s Original Rice to now Kind Bars, and they have one massive deal in the works that we will talk about later on this episode.\nDavid, here’s one crazy stat to illustrate their sheer size. Do you know Mars now does more revenue than the Coca-Cola company?\nDavid: I know. Wild.\nBen: Mars crossed $50 billion in sales last year, and they’re still completely privately owned by the Mars family, making it one of the top five largest private companies in America. This really is an incredible American and global story.\nListeners, after this episode come listen to ACQ2. We just had one of my favorite conversations ever on the show, in part because I just love talking computer architecture, with Rene Haas, who is the CEO of Arm Holdings, the chip design company that makes the designs and the instruction set architecture of everything inside your smartphone, your car, your laptop, and now even massively in the data centers.\nDavid: Between Synopsys and now Arm, we’re going to have to rename ACQ2 into Acquired Semiconductors.\nBen: Totally. It was a great computer science lesson and history lesson all rolled into one. Go subscribe to the ACQ2 feed in the podcast player of your choice to check it out.\nWe’ve got a survey winner. Thank you to everyone who took our survey. It is Kirti from Boston. We will email you with details on how to claim your free Ray Ban Metas, and 10 other folks in addition to Kirti will also receive free ACQ dad hats. Keep an eye out and your email if that is you.\nBefore we dive in, we want to briefly thank our presenting sponsor, J.P. Morgan Payments, for an incredible year.\nDavid: Yes, just like how we say, every company has a story, every company’s story is powered by payments, and J.P. Morgan Payments is a part of so many of their journeys, from seed to IPO and beyond.\nBen: Yup. With that, this show is not investment advice. David and I may have investments in the companies we discuss, although not Mars, obviously, and this show is for informational and entertainment purposes only. David, where do we start our story?\nDavid: We start in September, 1883. There’s some debate about whether it’s in Pennsylvania or Minnesota. There’s a lot of legend, shall we say, about the Mars family, which we will get into as we go here.\nBefore we start, I have to say a thank you to Joël Glenn Brenner, who wrote the amazing book, The Emperors of Chocolate. Mars, as we’ll talk about, is an incredibly private company and private family. She’s the only journalist that ever got real access to the company ever.\nBen: It was in 1991, almost a century after founding, that she actually got access for a Washington Post article, and then that turned into the book. Is that right?\nDavid: Yup. She was a young reporter at the Post, called the company every day for a year, and finally got access. That became a piece in the Washington Post magazine, and then she turned it into a book, The Emperors of Chocolate.\nBen: Yup.\nDavid: Okay. Back to 1883 and let’s just call it Minnesota. One Frank Clarence Mars is born. Frank’s father is a flour gristmill operator, and his mother, Elva, is a housewife. Both of those trades are going to become very important here.\nFrank, sadly, when he’s very young, and in what I think was also very sadly commonplace at the time, contracts polio. He has a mild case. Luckily he survives, but it does affect his legs, and he has to wear orthopedic braces all growing up, which means that Frank can’t play outside. He can’t play sports. He has to stay home after school with his mother.\nWhat does he do after school with his mother? His dad would bring home extra bags of flour. Somebody had to put that to use, so Elva and Frank do lots and lots of baking. They’re baking bread, they’re baking pies, they’re baking cakes, and most enjoyably, for Frank, they are baking candy.\nBen: What was candy at this point in time?\nDavid: I’m glad you asked. It’s not chocolate. Chocolate is basically not a thing in America yet. Candy, though, was big. Specifically, we’re talking about penny candy—gumdrops, licorice, all sorts of sugar-based sweets.\nThey were typically unbranded. There were no big national or really even local brands of candy at this point in time. They’re sold wholesale by small regional bakers to local retailers and drugstores who stock them for kids. The main market here is selling sweets to kids, and that’s what Frank is doing.\nBen: You can think about the candy industry at this point in time like the baked goods industry today. You’ve got some local baker that’s making them, distributing to a bunch of coffee shops, and you don’t really know, except in really bougie ones, who the baker of that particular scone is. It’s just, oh, I go to that coffee shop, and they have scones there.\nDavid: Exactly. This is what Frank and his mom are making in their kitchen. Fast forward to high school, and Frank has become the local candy chef extraordinaire. He’s mastered all of his mom’s recipes, he’s experimented with some of his own, people are liking them. After high school, he does the natural thing. He becomes one of these candy entrepreneurs.\nWhen he’s 19 years old in 1902, he establishes his own candy company there in Minneapolis and goes into business, selling his creations and other people’s creations, wholesale, to these local retailers, merchants, drugstores, et cetera, for kids to buy.\nIn that same year, in 1902, he would also briefly marry a woman named Ethel Kissack. Remember this Ethel. She will come up much, much, much later at the end of the story. For the moment, the two of them have a son named Forrest Mars.\nBen: Our real protagonist in this story.\nDavid: Yes, but put a pin in Forrest. We will come back to him in a few minutes. His dad, Frank, starts this candy business. He’s like, yup, this is it. This is the company—Mars, Snickers, M&M’s, Milky Way. It’s all to come here.\nBen: Out of this one company named Mars.\nDavid: Well, not yet. We mentioned a minute ago that chocolate was not a thing yet in America. At this point in time in 1902, that is not technically true. Milton Hershey has started selling his Hershey’s chocolate bars in Pennsylvania, which he started in 1900.\nBen: The notorious 5¢ just chocolate. I don’t even think they have made Hershey’s with almonds yet. It was just a single 5¢ slab of chocolate bar called the Hershey bar.\nDavid: Yup. There weren’t even any Kisses yet, nothing. It was just the very beginning. Hershey had not yet figured out how to scale production. It was regional, it wasn’t popular around the country, and certainly not in Minneapolis.\nBen: Hershey had just figured out by the skin of his pants, production and the recipe at all. He almost built an entire factory to produce milk chocolate without knowing how to produce milk chocolate. That was a lucky diving save at the last minute right before they needed to turn everything on.\nDavid: Totally. What Frank’s selling, this penny candy stuff, it’s fine. Like I said, the target market is kids, which is a good market, but kids turn into adults, and then they stop eating penny candy. The market is not that big.\nThere’s also another problem with the penny candy business, a bigger one, which is, in those days, it was all pretty highly perishable.\nBen: There’s no air conditioning yet.\nDavid: Exactly. Most candy producers end up having really horrible inventory problems, and a lot of them end up going out of business, which, after a couple of years, is exactly what happens to Frank.\nIn 1910, Frank’s now bankrupt, his wife Ethel divorces him, takes their six-year-old son Forrest, and sends Forrest off to live with her parents in a remote mining town in Saskatchewan, Canada. Ethel stays in Minneapolis, takes a job as a department store clerk, and just hits reset on her life. It’s wild.\nBen: Do you know why?\nDavid: I think because nobody had any money to support him.\nBen: In particular, Frank actually owed her $20 a month for child support for Forrest when he was six years old but was failing to make payments. She just couldn’t support him and needed to send him to the grandparents.\nDavid: You got to remember, we’re in the early 1900s here. This stuff happened all the time.\nBen: Yup.\nDavid: Frank, undeterred by bankruptcy, divorce, being a deadbeat parent, not paying child support, marries another woman also named Ethel.\nBen: Unbelievable.\nDavid: Specifically, they move to Seattle, where Frank does what else? He sets up another candy business and starts hawking his candy again. This Seattle candy venture goes about as well as the Minneapolis one. Within one year, Frank is bankrupt again. The creditors are coming after him, so he skips town again, this time just down the road to Tacoma.\nBen: This is two failed candy companies under his belt.\nDavid: Yup. We’re now on number three. He sets up another candy business in Tacoma in 1914.\nBen: Out of his house.\nDavid: Yes.\nBen: He’s running the business out of his kitchen.\nDavid: That’s right, and that business also fails after a couple of years. Three down, three strikes. We’re now in 1920, and Frank and Ethel number two return once again to Minneapolis, figuring that ten years have gone by, they can now show their face around town again.\nFrank sets up, yet again, another candy company. Candy company number four now in total, if you’re keeping track at home. Against all odds, this candy company would go on to become the globally famous $50 billion annual revenue private family business, Mars Incorporated, sort of.\nBen: It’s not totally Frank that is the reason for its success.\nDavid: Yes. What’s different now about this fourth candy company that Frank starts? It’s chocolate.\nBen: Chocolate is a completely different universe than these penny candies, than caramels. The first thing you have to know is it uses cocoa. This is very, at this point in history, scarce and not very common in America. Very few people are importing it from South America where it originated. It’s a totally different and difficult thing to try and process. At this point in history, only Europeans really are doing it, except for one American entrepreneur, Milton Hershey.\nDavid: Yup. We got to rewind a little bit and tell the Hershey story because: (a) it’s also crazy, and (b) it is deeply intertwined with the Mars story. Milton Hershey had been also an actually successful candy entrepreneur. He had his own shares of failures, but he started eventually a caramel company that became quite big regionally in the Philadelphia area.\nBen: Yup. He sold it for a million dollars in 1900, which is $36-$37 million today with inflation.\nDavid: Yup. He is among the most successful of this generation of pre-chocolate candy entrepreneurs. Before he sold the business though, in 1893, Hershey traveled to Chicago, where at the Columbian Exposition, which I didn’t know was the precursor to the World’s Fair, he tries chocolate for the first time. He’s smitten in the German pavilion there. There’s a German company that is displaying chocolate and chocolate-making equipment.\nHershey is so taken by the rich complexity, deliciousness of chocolate that he buys from this German company, all of the equipment on display there, just on the spot. He says, I want this shipped back to my production facility in Lancaster, Pennsylvania, out in the Philadelphia countryside, and I am going to set up a chocolate making operation. This is not milk chocolate, this is just plain chocolate.\nBen: It’s worth noting too, this concept of solid chocolate is a pretty new thing, like a chocolate bar. Up until 15–20 years before this, basically all chocolate was drinking chocolate. This notion of a machine that makes chocolate as bars at the Columbian Exposition is quite novel.\nDavid: Yeah. Chocolate is a very rich, very complex food, very difficult to make. The history goes all the way back to Montezuma and the Aztecs.\nBen: And even before the Aztecs about 5300 years ago around Ecuador.\nDavid: Wow. I didn’t even know that. We’re talking about a 5000-year-old tradition here.\nBen: Yes.\nDavid: Like you said, until, call it the late 1800s, this is a drinking activity.\nBen: Yes, and it’s so different from the chocolate we think of today. There’s no milk chocolate. It’s not that nice breakable chocolate with a shine. It’s a very different and only barely enjoyable flavor. It’s better than everything else, but it’s not a bar of chocolate like you know today.\nDavid: Yup. You said milk chocolate, and I said Hershey at this point is not making milk chocolate when he first introduces it to his caramel company. As he gets deeper and deeper into the chocolate world, he travels to Europe and learns about milk chocolate, which had just been invented not too long before in Switzerland by the Swiss company, Nestlé.\nBen: Sort of Nestlé. We’re going to talk about how to make chocolate, and then we’re going to use that as a basis of understanding how to make milk chocolate and how the discovery of milk chocolate came about.\nFirst of all, how do you make chocolate? We have a huge thank you to Todd Masonis at Dandelion Chocolate, which is an excellent bean-to-bar chocolate company in San Francisco, for walking us through this entire thing. Not only giving us all the notes of how to describe it on air, but also taking us through their factory in San Francisco, which is unbelievably cool if anyone has a chance to do it.\nWhere does chocolate come from? There’s a cocoa fruit that grows on a tree, originally in South America, now very commonly in Africa where they’ve been transplanted. It’s a football looking thing. You pick it, you cut open the pod, and inside there are the seeds of the fruit.\nDavid, you and I ate some of it or sucked on some of it. It’s sweet, but it’s not chocolate. It has no reflection of a chocolate flavor. That all comes from the seeds or the beans.\nDavid: Yup. The fruit itself is actually quite delicious, but it’s like a pulpy milky type thing.\nBen: Yes. That fruit is actually the thing that people ate for thousands of years, but the seed ends up being the thing that becomes chocolate. You first ferment those beans in wooden boxes, the yeast eats the sugar that creates alcohol, and then the acid eats the alcohol. There’s fermentation that kills the beans, so after this fermentation you then dry it. All this happens at the site of production or of growth, typically in South America or in Africa.\nAfter the fermentation, you dry it out. This could happen in drying beds, in mechanical smoke dryers, or on banana leaves. All the different ways that you dry it can affect the flavor. How aggressively you dry it contributes to how much acid is in the beans. There’s a lot of fluctuation here in the flavor just based on the way that you are harvesting the bean itself.\nThe beans then go into sacks, they go on boats, they go at this point in history basically to Europe because that was the only place that was making chocolate. They then get sorted, sterilized, debacterialized. I suspect not a lot of this was happening in the old days, but it is what happens now. They get roasted. You remove the shell, which is a process called winnowing, so now you have nibs.\nDavid: Just like the core meat of the bean after it’s been roasted.\nBen: Yes. You can press those nibs to create two separate things, cocoa powder and cocoa butter. Both of those come from the nib, but there are many reasons why different chocolatiers will first separate them out and recombine them in different ratios later. You grind the nibs down to the right particle size and then go through something called conching.\nDavid: Conching is awesome. It’s basically these big cylinders that spin around and smooth out all these particles.\nBen: Yeah, and there’s a great story back in 1879 that Rudolph Lindt, which is another name you may recognize the Swiss chocolatier, discovered it by accidentally leaving his cocoa in a roller grinder over the weekend instead of shutting the machine off. It accidentally pressed the beans for three full days, which created this silky smooth flowing texture.\nYou could do cool stuff like add more cocoa butter in to get that Swiss chocolate texture that we all know of today. If you’ve had it, you’re like, how is this so unbelievably creamy? You separate the nibs into cocoa powder, cocoa butter, and then you add a bunch more cocoa butter back in, and it’s that delicious Swiss chocolate.\n1879 is when conching is first discovered. David, there, to your point, specific conching machines that will do this as a part of the chocolate production process.\nDavid: Still not done yet.\nBen: You now have this great, conched, liquidious, wonderful chocolate sitting there. If you just let it dry, it’s actually not shelf-stable. It will bloom. For any of you who ever left a chocolate bar in a hot car and it melted and then resolidified, it gets that white, gross stuff on top, and it doesn’t have that shine to it. It doesn’t snap nicely the way that you’re used to a chocolate bar snapping.\nThere’s actually some pretty complicated chemistry that happens, where you are taking this conched chocolate and you are tempering it. What tempering it does is you are aligning the crystals in the cocoa butter to make it so that it forms into that shiny breakable chocolate that you know of today.\nDavid: This is an incredible process. You take this liquid chocolate after conching, you heat it up to super liquefy it, and then you cool it down to like just the right amount of temperature where the right seed crystals form, then you heat it back up again, and then you let it cool. If you don’t do that second step, all the bloom will happen. You want to get just the right seed crystals to set the right crystalline structure for how it will come together.\nBen: That’s exactly right when you’re superheating it, you’re eliminating all crystals, so then you can start from scratch with this seed crystal, and then you’re trying to let the rest of the chocolate form around that seed crystal so they’re all lined in that nice, shiny break.\nDavid: Believe me, I appreciated chocolate before doing this episode, but now, knowing how it’s made—and we haven’t even gotten to milk chocolate yet, which is even more complex—this is more complex than wine, this is more complex than coffee.\nBen: Shots fired on wine and coffee. You’re going to hear something.\nDavid: At least in terms of like stages of production. Let’s take coffee. Coffee looks pretty similar until you get the beans there roasted, but then you grind the beans, and you just put the beans in liquid. You’re not getting any of these steps here.\nBen: Chocolate is remarkably hard to make. I think that is a huge takeaway. The fact that I’m looking down here at all these bags of M&M’s and the Snickers bar, we just assume, oh, this is an industrial thing that just comes off the line. It’s an agricultural product that then has to go through a variety of different processes, developed on different continents many decades apart in order to create something very uniform, predictable, and desirable out of that pure agricultural product.\nDavid: Yup.\nBen: That’s all the way from the fruit through the fermentation, through the processing of the beans, through the conching, through the tempering.\nDavid: In those last steps of the process in the conching and the tempering, you’re also adding sugar. Unless you want to make 100% dark chocolate, which is very complex but very bitter.\nBen: No one’s going to eat that. Most people max out at 85% chocolate and the rest, the 15%, is sugar. Or you’re getting a 70% bar and the 30% is sugar. Or if you’re getting a milk chocolate bar, it’s more in that 30% to 50% cocoa, and the rest is sugar and milk.\nIn reality, most of the time you’re eating chocolate these days, unless it’s a bean-to-bar producer like a Dandelion or something, you’re ending up with all sorts of stuff added in that process, more cocoa butter, sugar, soy lecithin. Oftentimes you’ll get vanilla that’s added in part of this process to create a chocolate taste you know of.\nDavid: Yup. We’re still in the dark chocolate world here. Let’s talk about Nestlé and milk chocolate.\nBen: Which is a funny misnomer. Dark chocolate. It’s just chocolate. It’s chocolate that doesn’t have milk, so we needed to retronym it something. We needed to come up with a name and we’re like, oh, it’s dark chocolate. Okay, it’s chocolate that’s chocolate and sugar but doesn’t have milk. Okay, anyway, dark chocolate.\nWhat is milk chocolate then? We need to flash back 35 years before Milton Hershey sells his first caramel company. This is before he started the Hershey chocolate company, 1866. Henri Nestlé, David, to give some credence to your comment, is researching infant feeding as a means to solve infant mortality. He invents a new type of food for babies who are unable to breastfeed there in Switzerland.\nRemember, at this point in time, something like one in five babies died before their first birthday, so infant mortality is a massive global problem. He’s researching alternative infant feeding methods. Milk would quickly turn rancid, so there was this question of how do you keep milk fresh.\nHe eventually solved it. It is hard to condense milk without burning it, but he figured out this method of using an air pump at low temperatures to concentrate a milk powder, and then he added a bunch of cereal, a proprietary cereal mix he created. This is effectively the first baby formula. In 1867, he demonstrated that a baby could drink this formula that he made, rehydrated, and it was effectively a miracle to keep babies alive.\nDavid: Totally. This is one of many mind-blowing things in the research that I learned. Nestlé was a baby formula company. That’s how it started.\nBen: Totally. It’s great. It’s in the same way that Hermes, the Birkin bag, was a bag for baby bottles.\nDavid: Right. Who knew that baby formula literally leads to the modern chocolate industry?\nBen: Yup. Incredibly, one of his neighbors who desperately needed this formula because his baby was rejecting breast milk, happened to be a chocolatier, a guy by the name of Daniel Peter. He had this idea for milk chocolate in 1867 by combining the dehydrated baby formula with cocoa and sugar to create a creamy drink. We’re still in the drink era. People at that time were already pouring milk in with their drinking chocolate, but he said, can I create this as a pre-made product?\nDavid: Yup. Again, to the issues with creating baby formula and then now here the issues with creating milk chocolate, milk is not a stable product. Milk goes bad fast, so how are you going to put this in a product?\nBen: Milk chocolate is something that sits on a shelf for six months, you can eat it, and it’s not spoiled. It’s unique in that way.\nDavid: Totally.\nBen: The issue that he kept running into—this is Daniel Peter—was that the mixture was grainy, the water in the milk didn’t blend well with the cocoa’s bean oils. It was a mess. When he tried to dry the milk on his own, it was really easy, David, to your point, that it was spoiling, and the chocolate would be rancid by the end when he finished it.\nEventually, Daniel Peter walked away from Henri Nestlé’s powdered milk entirely, and instead he tried condensed milk, which is more like a concentrated syrup, not actually dried powder. When he tried this, plus the final step of spreading the milk chocolate mixture on these big trays to slowly dry them and slowly add a little bit more heat to turn it into these milk chocolate flakes, that is the thing that worked.\nHe finally was able to create this marketable milk chocolate, flaky stuff that would turn into a drink, and then later, especially over at Cadbury and other European chocolate companies, would turn into milk chocolate bars that Milton Hershey would try to emulate.\nDavid: Interesting. I didn’t actually know that it was condensed milk, not the formula milk that ended up working for Nestlé.\nBen: That’s my understanding. There’s a descendant of the Cadbury family, Deborah Cadbury, who wrote this book called Chocolate Wars. Two chapters out of 20 or something are about Mars, but it was this great primer on the history of the chocolate industry to learn all this.\nDavid: Interesting. Yes, you’re deeper on this part than me. You might be asking yourself, why was everybody going through all this trouble to combine milk and chocolate? It’s the perfect combination.\nChocolate is so wonderful, complex, and delicious on its own, but it’s heavily bitter. When you temper it, not tempering in the chocolate process but temper that flavor with the smoothness and the creaminess of milk, anybody who likes chocolate knows it’s just absolutely delicious.\nBen: Yeah. By 1879, once you have milk chocolate in solid form and then you have conching, you now go from bars that are really gritty and hard to bite to this amazing mouth feel that just massively increases the market 10x. It’s hard to get a number on it, but the market for what chocolate would be from 1879 onward is way bigger than before.\nDavid: Totally. Back to Hershey. He, of course, learns about all of this as he’s building his new chocolate company there in Pennsylvania, and he decides that he’s going to make milk chocolate too, except he’s not a chemist. He doesn’t employ any chemists. He basically has no idea what he’s doing. For years, he just experiments via trial and error to try and find a way to produce milk chocolate.\nHe builds a huge new factory in what would become Hershey, Pennsylvania, like the town of Hershey, Pennsylvania. He’s basically betting it all of, I am going to figure this out, and I am going to bring chocolate and milk chocolate to America at scale. Finally, after a couple of years, he does hit on a method that works for producing milk chocolate.\nHowever, it’s not quite as scientific as what you were just describing, Ben. In the process, effectively, the milk does spoil a little bit, which is why I’m sure all of our European and other international non-American friends who are listening to us here and are saying, Hershey’s, that is so disgusting. I have no idea how all you Americans eat Hershey’s chocolate and why it tastes sour if you’re not used to it, this is why. It is sour.\nBen: There are two versions of the story, and we don’t know which one is true. Either way, David, it leads to this thing that you’re talking about, which is there’s a little bit of a funk or a little bit of a sourness in Hershey’s chocolate. That is just what Americans are used to. To Americans, that’s chocolate.\nAccount number one, and this is all in the Cadbury book that I just mentioned. \"After a series of laborious failures, Schmalebach, who was a scientist working with Hershey, seized on the initiative and tried a slow evaporation of non fat milk over low heat. He succeeded in reducing the water content of the milk and added the sugar to create a sweet, creamy concoction with no hint of a burned flavor. Better yet, they found that the mixture could be blended with the ingredients of the cocoa bean without spoiling to produce a smooth milk chocolate. Hershey was thrilled. Slightly sour, but distinctly original. The perfect American chocolate bar.\"\nThere’s a second view, which is that Hershey happened to acquire a large batch of milk powder from Europe, which has slightly soured by the time it crossed the Atlantic. Reluctant to waste such a large amount, he used it to make chocolate and found that it sold well. Company officials have always denied that soured milk powder played any part in the company’s formula.\nDavid: Amazing.\nBen: Thank you, Deborah Cadbury, for all of that.\nDavid: If written by a member of the Cadbury family, you can imagine why that story is preferred. Regardless, here’s the amazing thing, though, that this illustrates. When it comes to candy, and specifically when it comes to chocolate, the most important thing in the business is being first to market and setting the taste of a specific regional area.\nAgain, Europeans think that Hersey’s chocolate is disgusting and Americans are like, this is chocolate. When you’re a kid and you eat this stuff for the first time, your taste gets associated with, oh, this is what this is.\nThere’s also a nostalgia element to this too. Because the tastes are so strong, so powerful, so complex, you bite into a Hershey’s bar and subconsciously or not, your brain is going right back to childhood when you first ate that.\nBen: Yup. Actually, today, 75% of candy is eaten by adults. In fact, it accounts for 90% of total purchases, a complete departure from the pre-chocolate world you were talking about with the penny candies at the checkout counter.\nDavid: Totally. Hershey was crazy in believing in the potential for all this, but because he invested so much money, he set up the only scale chocolate production facility in America. He was able to set this taste for the country, which basically locked him in as what chocolate was in America.\nBen: Fascinating.\nDavid: He’s smart about this too from a business perspective. Ben, you mentioned the nickel Hershey bar. He intentionally sets the price at a nickel. He totally could have charged a lot more. This is this great, delicious, luxurious item. He wants it to be ubiquitous. He prices the bars at a nickel, and he pushes distribution everywhere, Five and Dime stores, grocery stores, gas stations, news stands, Standard Oil stations. He’s pushing everywhere. He basically invents the modern candy industry by doing this.\nBen: Hershey’s uniquely positioned to do it. Imagine you’re walking around today with $40 million from the sale of your previous company. You realize there’s something going on in Europe, you know it’s going to work in America. You can’t get your hands on the formula, but you’re going to try and reverse engineer it. Your competitors can’t self fund to the degree that you can.\nHe decides, I’m rich, I’m going to go big immediately. He builds out this huge factory to start production before he’s even finalized the formula. It’s really like a go big or go home strategy where if it works, boom, mass production, mass distribution, I set the flavor profile in America, and I set the brand in America for chocolate. If it fails, it fails pretty catastrophically.\nDavid: Yup. Putting the final pieces on this initial Hershey success story, right after Milton Hershey figures out milk chocolate, starts this production, and is expanding distribution nationwide, World War I happens. The American military, as they have seen European armies do, they source chocolate as ration bars for the troops. Hershey’s is the big supplier. Millions and millions of American GIs now get introduced and hooked on the slightly sour Hershey’s chocolate.\nBen: And it’s great. It’s a super dense store of energy. It triggers an emotional response in the brain. Everybody who eats sugar today knows that if you’re eating sugar, it is triggering, I don’t know if it’s dopamine or serotonin, but there’s definitely a stimulus of a happiness release. If you’re a soldier in World War I, you could use a little of that.\nDavid: Yeah. It’s got caffeine. Totally. These soldiers then come home. Right after the war is prohibition in America, so you can no longer buy alcohol, at least legally buy alcohol. All these adults are now like, you need some social lubricant here. What’s the natural alternative? It’s chocolate, which brings us to the candy bar.\nAll of these former penny candy entrepreneurs all around the country, they’re like, wow, chocolate is amazing, we can market to adults, et cetera. It’s expensive. Hershey’s selling their own bars. What if I take just some chocolate, some other stuff, and also make a bar?\nI could make that a lot cheaper because the other ingredients, whether it’s nuts, nougat, sugar, or whatever, are cheaper. I can develop my own unique taste that people in my region might find appealing.\nBy the end of the 1920s, there are more than 40,000 different candy bars being made in America, almost all of which are these regional entrepreneurial operations. The most infamous of these is, Ben, do you know the story of the Baby Ruth candy bar?\nBen: No.\nDavid: It’s still available today. Baby Ruth candy bar named, I think, for President Grover Cleveland’s baby daughter Ruth. To introduce the bar, the Curtiss Candy Company, which made it, chartered an airplane to fly over the city of Pittsburgh and drop bars down with paper parachutes over the city. It is a literal drop. It puts the Visa drop to shame.\nBen: Wow.\nDavid: Amazing.\nBen: We’re going to have to do that for an Acquired marketing stunt at some point.\nDavid: I know. Charter an airplane and just drop it. I think we would get in a lot of trouble if we did that these days.\nBen: I think so too.\nDavid: You might be scratching your head a little bit and being like, wait a minute, you just told me about how Hershey controls the means of production for chocolate, and nobody in America can make chocolate except Hershey. That’s right. Hershey is freaking loving all of this because they are supplying the chocolate to all of these entrepreneurs. They’re like the AWS of the chocolate business.\nBen: They’ve become the blue jeans and pickaxes company in this gold rush.\nDavid: Yes. If you’ve ever wondered how the heck Milton Hershey built a town and how to become like Rockefellers, Carnegies, or Vanderbilts, this is how.\nBen: This is when you start to see this separation of the different players in the value chain of chocolate. It used to just be, well, I buy beans, and then I make consumer branded chocolate bars.\nThis is the first time there’s an intermediation step where you say, Hershey makes the chocolate, and then other people buy the chocolate from Hershey for their consumer products. Yeah, Hershey also makes a chocolate bar, but in America, this is really the creation of the wholesale business of chocolate.\nDavid: Yup, and there’s one game in town at least when it comes to milk chocolate, which is most of the market, and that’s Hershey.\nBen: And the US Military loves it too, because you can put all these high energy density ingredients inside of the candy bar and then use the chocolate effectively to seal it in and keep it fresh. You put a wrapper around it, you send it off with the troops.\nYou’ve got eggs in the nougat, which has protein. You’ve got nuts, which is protein and fat. All of this, you’re delivering these \"complete\" meals, but it’s carbohydrates with sugar and other carbohydrates. It’s fat, it’s protein. It’s not a ton of protein, but they’re energy bars, and it’s all because the chocolate seals up the ingredients inside.\nDavid: Totally. This now brings us back to Frank Mars in Minneapolis, the fourth candy company, and what is different this time, which is chocolates.\nWhen Frank first gets back to Minneapolis and starts up the fourth company, he had seen out in Seattle and Tacoma that buttercream truffles were really popular. He brings the buttercream truffles. He steals from the companies out there and brings the concept back to Minneapolis. That’s quite successful. He calls them Victorian butter creams and I believe started coating them in chocolate using Hershey’s chocolate, which makes sense given everything that’s going on.\nThat becomes pretty successful. He adds another line called Patricia’s chocolates named after his new daughter, Patricia, that he has had with wife Ethel number two. After a couple of years, the business is doing call it $100,000-ish in revenue, so really well. We’re not talking Hershey levels of entrepreneurial ambition here, but that’s not the ambition that Frank has.\nIn 1922, he decides that he’s going to get in on this candy bar craze that is sweeping the nation. He introduces his first combination bar or candy bar called the Mar-O Bar.\nBen: Yes. Do you know the other name for these types of candy bars that are chocolate-wrapped something else?\nDavid: Combination bars, right?\nBen: The term I read was count lines.\nDavid: No. I didn’t come across that.\nBen: This is from the Cadbury book. Interestingly, all chocolate before was measured by weight. Once somebody rolls their first candy bar off the line, what we now know today, the Snickers bar, the Milky Way, all these things, you couldn’t really just measure it by weight because it’s got a bunch of much cheaper ingredients inside.\nTreating chocolate as one substance that has weight no longer maps to the consumer product. These lines where you’d manufacture these candy bars were measured by the count of bars, so they’re called count lines. These manufacturers are spinning up count lines instead of weight lines or whatever they were before.\nDavid: Amazing. It’s like the KD furniture from the IKEA episode. Here we are, the first candy bar, count line bar from the Mars company. 1922 comes out. I don’t want to say it’s a flop, but it’s not a success.\nBen: No one’s eaten Mar-O Bars today.\nDavid: Correct, indeed. The next year, in the summer of 1923, a fateful reunion occurs in Frank’s life, which is that his estranged son, Forrest Mars, reappears in highly dramatic fashion, and the two of them team up, father and son, to introduce a new candy bar, one that will take the nation by storm. That would end up being called the Milky Way, or at least that’s the legend, and we will tell that in just a second.\nBen: Yes, but first, this is a great time to tell you about our presenting partner, J.P. Morgan Payments. Everyone listening knows that we started working with J.P. Morgan earlier this year, and you can probably tell it’s going very well. David and I on this final episode of the year wanted to pause and tell you why.\nDavid: First is the team, the folks that we work with there. They are absolutely world class. Also, they really get Acquired. They’re huge Acquired listeners just like you. Just look at the Chase Center show. They took our vision and said, what if we did all of this times 10?\nBen: Deeper than that, our two products and brands just fit together like a glove. J.P. Morgan Payments is the world’s largest payments franchise. They power 18 of the top 20 corporations in the world and most companies we’ve covered on the show. In fact, 90% of Fortune 500 companies do business with them. They’re extremely trusted.\nDavid: At first, when we started working with J.P. Morgan, we were a little worried like, oh, this might only be for big companies, but it’s not. We’ve seen startups that heard about J.P. Morgan Payments on Acquired earlier this year for the first time become customers.\nOur goal in picking partners is to find the very best companies that: (a) create value for our audience right now, and (b) will scale with your success and be around forever. That is J.P. Morgan Payments. They do literally $10 trillion in payment volume a day.\nBen: Listeners, think about how insane that is. With J.P. Morgan processing over 50% of all ecommerce transactions in the US, their software and payment rails basically underpin our entire global financial system.\nDavid: Lastly, payments is a process that every single one of your companies needs. If you make revenue, you need payments. J.P. Morgan thinks about payments as a lever for growth, not just vanilla operational stuff. They’ve been investing heavily with products now for fraud prevention, foreign exchange, working capital, and more, all of course built enterprise-grade and with developer tools and APIs.\nBen: Thank you listeners for tuning in all year. You can learn more at jpmorgan.com/acquired, which itself is a very cool custom site they built just for this partnership. When you get in touch, just tell them that Ben and David sent you, or shoot David or I a message in Slack and we’ll get you connected with their team. Our thanks to J.P. Morgan Payments.\nAll right, David, Forrest emerges into his father’s life, and somehow we end up with the Milky Way. How does that happen?\nDavid: Let’s tell the legend. Summer, 1923, young Forrest Mars is 19 years old. On summer break from college—more on college in a minute—he got a summer job as a traveling salesman selling camel cigarettes.\nBen: Times sure were different.\nDavid: Times sure were different. It’s debatable how true any of this is, so we’ll roll with it. One night, he’s in Chicago in late summer, and he gets instructions from his boss that they really got to blow it out. They need to hit big time sales numbers here in Chicago. Forrest, you got to go blitz the whole city with posters marketing Camel cigarettes.\nForrest goes around, and he puts billboards up all over downtown Chicago. Supposedly every storefront window on State Street, he’s plastering with Camel cigarette posters, which certainly gets attention.\nIt actually makes the Chicago Tribune the next morning that this happened, but also if we were to do an Acquired marketing stunt like baby Ruth and drop stuff from an airplane these days, it’s also illegal. It lands young Forrest in jail.\nFrom his Chicago prison cell, Forrest makes his one phone call to the only soul that he knows in the area who could possibly bail him out, his estranged father, Frank Mars.\nBen: This is the legend, and this is the Mars company’s version of the story, this is the journalists’ version of the story, this has been in other books, but the guy hasn’t seen his father since he was six years old, and he somehow knows his phone number to call him from jail?\nDavid: By the way, his dad lives in Minnesota. There’s the whole state of Wisconsin between Minneapolis and Chicago. We’re giving you a flavor of who Forrest is here.\nBen: If Forrest was in charge of coming up with the story of how this all went, this is the story he would have come up with.\nDavid: Exactly. As we’ll see, Forrest is in charge of everything. Frank shows up at the jail. Father and son are reunited after 13 years, during which, yeah, Ben, like you said, they’ve had no contact with each other, but Forrest has his phone number to call him. Frank bails out Forrest. By now, it’s early afternoon of the next day and he says, all right, son, let’s go out for lunch. They go to a lunch net to share a meal, at which young Forest, who is selling cigarettes, orders a wholesome malted milkshake over this lunch reunion with his father.\nThey get to talking, they’re getting reacquainted. Forrest learns that his dad is now this middlingly successful candy entrepreneur. His dad’s telling him about this Mar-O Bar that he’s introduced. Forrest says, hey, I got an idea for you. What if you take this malted milkshake here, everybody loves a malted milkshake, and put that into a candy bar? I’m obviously pretty good at street marketing here. I bet I can go sell that all around the country.\nThey get to talking, jamming, father and son. With that, the Milky Way Bar was born, with the marketing of a malted milkshake in a candy bar.\nBen: This is the story. There is so much in between. I have an idea that you should put a malted milkshake in a bar and actually what a Milky Way is. It’s nougat and caramel inside of chocolate.\nIt’s a pretty different ingredient set than a malted milkshake. There had to be quite a bit of R&D, experimentation, flavor development, to figure out how to make the inside of your candy bar taste like said malted milkshake.\nDavid: Here is the exact quote from Forrest, as recorded in the family archives that Joel got access to as part of her access to the company. He says, \"I’ll be damned if a short time after our lunch, the old man has a candy bar. It’s a chocolate malted drink. He puts some caramel on top of it and some chocolate around it. Not very good chocolate. He was buying cheap chocolate back then, but that damn thing sold. No advertising.\"\nRegardless of how all this happens, Frank Mars does release in 1924, the Milky Way bar, and it does become a big hit. That year alone, the first year that it comes out, it does $800,000 in sales.\nBen: The Mar-O Bar company went from $73,000 to $793,000 in one year.\nDavid: That is all the Milky Way, undeniably huge success.\nBen: Effectively, what they were doing was they were the first ones who said, wait a minute, if we’re going to make a count line, we should do it in a mechanical way. Even though all these other people are selling these one-offs locally to different stores and hand-making them, they were doing it in factory quantities all under the same production process and brand.\nDavid: Yup.\nBen: It was early industrialization, but it was still much more industrial than the rest of the manufacturers at this point.\nDavid: Totally. First question you should be asking here is, wait, Forrest is in college now and ends up in jail in Chicago? What the hell happened here? When Forrest is six years old, as we said, he gets sent off to live in Saskatchewan, in Canada, in a hardscrabble, rural mining community with his grandparents.\nUnlike, I imagine, most of the folks around him, Forrest is a total outlier there. He’s super smart, super entrepreneurial, super ambitious, and he’s a super arrogant show off, probably because he’s so insecure from his deeply traumatic childhood.\nBen: Deborah Cadbury has a good line in her book, \"Noah’s flood wouldn’t have deterred Forrest Mars.\"\nDavid: Yes. When Forrest graduates, unlike everybody else there who goes off to work in the mines, he supposedly wins a scholarship to the University of California in Berkeley. How he wins a scholarship to UC Berkeley, which is the public University of California when he’s living in Canada and he’s from Minneapolis is suspect, but we’ll go with it.\nHe does show up at Berkeley though, we know that. He enrolls in the school of mining there with the idea that he is going to study to become a mining engineer and go back and run a mine instead of just being a laborer in a mine.\nBen: This all makes sense. He had an engineer’s mind. He also had a marketing mind, but he ended up building a company that ran at an incredible efficiency and thought it through as a systems thinker.\nDavid: Yes, 100%. While he’s at Berkeley in his first year there, to make money and support himself, he takes a job in the cafeteria. Supposedly he finagles a deal with the head cook that if Forrest can go source meat and other ingredients for the meals cheaper than budget from local wholesalers, he and the chef would split the savings and just pocket the difference.\nOf course, you might get a sense that Forest is a good negotiator here, this works like a charm. Supposedly, he’s soon taking home $100 a week, which if you annualize that to $5200 a year, that’s about double what the average American was earning at that point in time. He’s making bank.\nBen: Which, by the way, is a trend among all these entrepreneurs that we study. You look at Ingvar, you look at Sam Walton, you look at Buffett. All these guys, it feels like it’s a part of their childhood story that as a teenager, college student, or something, they were out earning the average head of household.\nDavid: Totally. And you know what? It is still true these days. Remember the Zuckerberg story of him and Adam D'Angelo coding upset apps and people want to buy it for a million dollars?\nBen: Yup.\nDavid: It just turns to software instead of candy bars. Anyway, this is all during forest freshman year at Berkeley. The summer comes and of course, the cafeteria closes down, so he needs to get a job for the summer. That’s when he joins the traveling Camel cigarette sales team.\nThat probably is when somewhere or another, maybe it was in Chicago, maybe it was in Minneapolis, he reconnects with his dad, Frank, and discovers that Frank had become a wealthy man.\nI think regardless of whether Forrest had anything to do with the Milky Way idea, launch, or anything like that, meeting his dad, seeing that there is a business in the family, starts recalibrating Forrest’s ambitions even higher than just being an engineer who can now go run a mine. He’s like, oh, I should run a business. I should run my family’s business, I should run my dad’s business.\nBen: I imagine seeing one of his dad’s businesses be successful is a different type of data point for him. He always knew, my dad starts a company and it fails, and just seeing an existence proof of a successful business has got to be a reorientation for him.\nDavid: Even when the candy company before the Milky Way was just making $100,000 a year, $100,000 a year, who knows what the margins are on that, but even if they’re 10%, he’s making 4x–5x what the average American is. This is eye-opening to Forrest. His literal words about this when he gets back to Berkeley are, \"The hell with running some mines in the backwoods.\"\nBen: I’m so glad you have these Forrest quotes.\nDavid: My God, they’re so good. Supposedly, in the Mars family archives, there’s a video of Forrest chatting with one of his longtime lieutenants from the company after he retired but before he died, and it’s in the family archives. Joel got access to go watch the video, which is where all these quotes are from. It’s amazing.\nHe does his sophomore year at Berkeley, but he’s got his sights set higher now. He, with his father’s help and presumably money, for Forrest’s junior year, transfers to Yale. He’s going to Yale with the goal of, I want to learn about business. He’s focused. It’s like the Zuckerberg story of going to Harvard. Yeah, Forrest wanted to go to Yale because it was Yale, but really he wanted to go to Yale to meet all the other people. It just so happens that his roommate, his first year when he shows up at Yale, is the nephew of Pierre S. du Pont.\nBen: Wait, really?\nDavid: Yes, really. Pierre S. du Pont, his nephew, is Forrest’s roommate at Yale. Pierre S. du Pont, at this point in time, is not only running du Pont, which is in and of itself one of the most important and biggest companies in America, Pierre is also running General Motors at this point in time because du Pont is the largest shareholder in GM.\nBen: That is a crazy story that we will save for a future episode of Acquired on how that came to be.\nDavid: We got to do du Pont. It’s an incredible story. Back to Mars, Forrest worms his way through his roommate into getting to know Pierre and starts just pumping Pierre for lessons on how he runs his businesses. How does he run du Pont? What is this du Pont planning system that you have?\nBen: How do you run a chemical industrial manufacturing process?\nDavid: Exactly. How do you do accounting? How do you do planning? I want to know everything about this business. It’s freaking unbelievable that here’s this kid from the mines in Canada, who, in a few short years, in the 1920s, has worked his way up through hook and crook that he’s rubbing shoulders with one of the greatest businessmen of that era right up there with Rockefeller and Carnegie.\nBen: Amazing.\nDavid: After a couple of years, when Forrest graduates from Yale, he’s ready to go put all this knowledge to work in his dad’s candy business. The first thing he suggests to his dad, Frank, is that, hey, we got to get out of Minneapolis. We got to move to Chicago. Chicago is the center of the candy industry at this point, but also it’s just a way bigger city, and it has way better freight distribution to the rest of the country.\nBen: If you want to go national, Chicago is a great place to do it.\nDavid: Yup.\nBen: Why else, David? You said it’s the center of the candy industry. Why else is that true?\nDavid: Definitely at this point already, the Wrigley Company is there.\nBen: Yup, you bet.\nDavid: If you want to know how good a business gum is, you should just ask yourself, why did the Cubs play in a building called Wrigley Field?\nBen: And why is there an entire neighborhood called Wrigleyville?\nDavid: Exactly. It’s like Hershey and the chocolate business. Anyway, we will get to that much later in the episode. Spoiler alert. Mars now owns Wrigley.\nFrank goes along with this idea that they’re going to move to Chicago. In his heart of hearts, he’s not the same man that Forrest is. He doesn’t have anywhere near the same level of ambition. He likes being wealthy now, he likes being comfortable. He’s like, I’ll go along with you to Chicago, but really, I want to focus on enjoying the fruits of our labor here.\nThe factory that he builds in Chicago, on the inside is really state of the art per Forrest’s designs. On the outside, he spends $500,000 in whatever this is, 1928–1929, buying attractive land next to a golf course to put a factory in. The outside of the factory is this beautiful Spanish style building with stucco, cupolas, and wrought iron ornamentation. It looks like a Hollywood studio building. Dude, you’re building a factory.\nBen: It must have been great margins on those Milky Ways.\nDavid: Exactly. Shows you the difference of where Frank’s head is out and where Forrest’s head is at. Probably, its differences over this factory, I would assume...\nBen: Start to chafe the relationship here a little bit.\nDavid: Chafe the relationship, yeah. He contracts the Austin company, which had built and designed all the Ford automobile plants and assembly lines to build the lines in the Mars factory. Forrest is pushing the workforce super hard. He’s like, we have this factory, we have these state of the art lines. We need to run these lines 24/7 with multiple shifts. Everybody else is just, oh, we run our lines during the day, hell no. We spent all this money investing in this factory, we need to crank out as many Milky Ways as possible.\nBen: Scale economies, baby.\nDavid: Totally. By 1929, which I think is the first year that the factory is up and running, they’re producing 20 million Milky Way bars annually. Forrest is just like, go, go, go.\nBen: Twenty million of anything at this point in history is massive.\nDavid: Yes. One thing that they are not making in the factory, of course, is chocolate. They’re buying all the chocolate wholesale from Hershey, which probably is another reason for the move to Chicago of like, hey, we need to be on a main train line, not only to get the product out, we need to be there to get the ingredients, including chocolate, in.\nBen: Yup.\nDavid: Very quickly, Mars becomes Hershey’s biggest customer. They are buying millions of dollars of chocolate every year from Hershey.\nBen: Which, to my understanding at this point in history is still that Hershey’s like, great, we love being an industrial wholesaler supplier to other candy companies. This is only good for us.\nDavid: I think the right way to think about Hershey at this point in time is like Amazon. They are both amazon.com and they are AWS. They’re very happy either way. As long as chocolate is being sold in America, they’re taking their tax.\nOnce this gets going and money really starts flowing into the company, Frank wants to spend it. He builds a 20,000 square foot vacation home on a lake in Wisconsin. He buys a $2 million horse ranch in Tennessee that he names the Milky Way Ranch. He buys his own airplane so that he can be flown around to all of these places. Forrest hates all of this.\nBen: He’s trying to reinvest as much into the business as possible.\nDavid: Exactly. He wants to be du Pont. He doesn’t care about a horse ranch or airplanes. Even he, I think, probably would have to admit that he’s thankful that Frank does these things.\nIn 1930, the next year, Frank creates a new chocolate bar that he wants to introduce to the market. He decides that he wants to name it after his favorite, beloved horse at his Tennessee ranch. Ben, you are opening it right now. It’s the most popular chocolate bar in America and I think in the world.\nBen: Yup.\nDavid: Yes. The Snickers bar, named after the horse in Tennessee.\nBen: Thank God they bought the horse ranch. I’ve been waiting for you to get to this part because I’m just trying to be satisfied. I just needed to grab a Snickers.\nDavid: Amazing.\nBen: It really is so good.\nDavid: It’s so good.\nBen: I massively prefer the bean-to-bar style chocolate, the Dandelion. I like dark chocolate more than milk chocolate. I might not even be able to finish a whole Snickers bar just because it’s so sugary, but, oh, my God, is that first bite good.\nDavid: We’re talking about two totally different products here of high end chocolate versus mass market chocolate, but Snickers are so good.\nBen: I feel like I’d go play in the NFL after a bite of this.\nDavid: Totally. There’s another potential story of the origins of Snickers that we heard, some wind of rumors in the Forrest legend canon here. Supposedly, Forrest was thinking about what would be an incredible product to build on the Milky Way success and market to all of America and the world.\nBen By the way, a Snickers is a Milky Way with peanuts.\nDavid: Exactly. Supposedly, he went to the library. He wanted to know, what did the Roman army feed their legionaries when they were out marching? Apparently he learned that it was peanuts, eggs, and sugar.\nBen: It’s a lot of energy. Super dense.\nDavid: The other story is that that was the inspiration for Snickers, was putting what the Roman army fed their legionnaires into a candy bar.\nBen: In practice, it’s actually a great energy bar. I was being tongue-in-cheek about the NFL because they’re a partner of the NFL today. There’s a whole industry around Clif bars and things like that being marketed as energy bars and Snickers being marketed as candy. But really, what’s the difference?\nDavid: Snickers launches in 1930. In 1932, they add 3 Musketeers to the lineup. 3 Musketeers originally was something very different.\nBen: Listeners, you are probably thinking to yourself, a 3 Musketeers bar is just that nougat and chocolate. It doesn’t have peanuts, it doesn’t have caramel. Why would this come after a Snickers? 3 Musketeers is actually a misnomer. I see you’re eating a 3 Musketeers. Way to be in theme.\nIt was actually sold as a package containing three separate bars, each with a different flavor, chocolate, vanilla, and strawberry. Due to restrictions during World War II, they had to cut production to just the chocolate version. I think part of it was also a spike in strawberry prices, so they just did away with the vanilla, and now it’s just called 3 Musketeers, even though it’s only the chocolate variant. One Musketeer doesn’t have the same ring to it.\nDavid: No, it doesn’t. If you’re paying attention here and thinking, wait a minute, they built this factory in 1928–1929, sales are skyrocketing, Frank is living large, in 1930 they introduced Snickers, in 1932 they introduced 3 Musketeers.\nWhat else is going on in America and in the world in the early 1930s? The Great Depression. This tells you everything you need to know about the resiliency of the candy business. Mars’ revenue goes up to $25 million in 1932. They’re just growing hugely. What did we say, Milky Way did $800,000 in its first year in 1924?\nBen: Yup.\nDavid: They go from $800,000 of revenue in 1924 to $25 million in 1932, all amidst the throes of the worst years of the Great Depression.\nBen: Candy may not be good for you, but when you really need a dopamine hit, it is there for you, and boy does it condition an addictive or addictive-like activity, where you incorporate it into your habitual everyday life. It’s a recurring purchase. At this point in time, between Mars and Hershey, both were laser-focused on keeping the price low to get as wide a distribution as possible.\nDavid: That’s exactly what I was going to say. I think it probably, really, Forrest here was closely studying Hershey in what they did and realize, oh, yeah, this is a scale business. If we get to scale, we can make profits while pricing our bars such that they are still accessible even for Americans that have lost their jobs and are in the middle of the Great Depression. By the way, they want a sweet treat more than ever because their lives are depressing. Brilliant.\nBen: Absolutely. The other interesting thing is nowadays, you’ve got all these variations of candy, M&M’s peanut, M&M’s almond, dark M&M’s. The Milky Way, the 3 Musketeers, and the Snickers are all just adding one ingredient to the same thing.\nBut they’re not labeling them that way, they’re building entirely different brands and franchises around each of these three products. I think that’s fascinating. They really didn’t get into this whole variation thing until way later in their life. That was not the standard practice then. This is a different product, it needs a different name and a whole different personality.\nDavid: And actually, I think to be fair to Frank, that is really Frank’s influence on the business and company there. Forrest, as great as he was at so many things, he was never a product innovator in the way that Frank was.\nBen: It makes sense.\nDavid: As evidenced by the fact that, here we are today eating the most popular candies in the world that Mars makes, and it’s still Snickers, Milky Way, 3 Musketeers, M&M’s, which we will get into. That was Forrest’s big contribution.\nBen: Depression. Sales are going great.\nDavid: Here we are, 1932, the worst years of the depression. Forrest totally recognizes all this like, we need to invest, pedal to the metal. We are going to use everything happening here to blow away our competition. We’re going to go compete with Hershey. We’re going to become huge. Frank, though, has no interest.\nAccording to Forrest, \"My father says we’re making enough money. We have an airplane, we’ve got the fishing place, we’ve got horses, why do we need any more?” And Forrest’s reply to that is, “I want to conquer the whole goddamn world\".\nHe issues his dad an ultimatum. Look, obviously you want to just go enjoy life, let me run things. Give me one-third of the stock of the business, you keep two thirds. You relax, and I will make you even richer. Frank turns him down.\nBen: I think he turns him down and insulted like, I built this business, and you came in recently and you’re just randomly asking me to give you a third of it? Go to hell.\nDavid: Yeah, and of course, there’s more behind this. Forrest was not liked within the company. He’s driving everybody hard. Frank is this...\nBen: Kind of a distracted leader.\nDavid: You can imagine, if you’re a line worker or even if you’re a manager within the company, which boss do you prefer?\nBen: Right.\nDavid: The company certainly sided with Frank here. There’s also the family element too. Frank’s got a new family now. He’s got his wife, the other Ethel. He’s got his daughter, Patricia. Frank’s like, yeah, hey, you’re my son too, you’ve helped me build this business, but I’m not just going to give you a third of the business. Either way, there’s quite a bit of animosity around this. Forrest walks out and in the process, tells his dad to \"Stick his business up his ass.\"\nBen: There are no mincing words in any of these direct quotes. It’s crazy.\nDavid: Literally. This is what he said he said. So Forrest leaves town not to Chicago, but leaves America entirely, goes off to a new continent to build his own business, his own way, leaves Mars Incorporated totally behind him, and leaves them in the dust.\nBen: Almost. He takes with him a right.\nDavid: Yes.\nBen: He has the right to what, David?\nDavid: He takes actually two things with him that his dad gives him as he’s heading out the door. (1) $50,000. (2) The foreign rights to the Milky Way recipe.\nBen: Yes, but I don’t think the Milky Way name.\nDavid: No, not the Milky Way name, just the recipe.\nBen: You can’t market this as Milky Way, but you can sell this recipe internationally.\nDavid: Yup. Forrest takes these two parting gifts, tells his dad that he’ll never hear from him again, and leaves America entirely. Super sadly, Frank doesn’t ever hear from him again.\nBen: Yeah, this is the last time that Frank and Forrest would ever speak.\nDavid: Yeah. The next year, when Frank is just 50 years old, he collapses in the Chicago factory and dies of kidney failure, and Forrest doesn’t come back for the funeral. That was it.\nBen: Granted, in the 30s, much harder to come back from Europe on short notice, but still.\nDavid: Yup.\nBen: Forrest is over in Europe. The set of events of what he does in Europe to build this ridiculous, almost Trojan horse, the set of skills he acquires, the assets he builds up, is crazy before he comes back to the US.\nBefore we talk about his European adventure, now is a great time to talk about one of our favorite companies, the climate-aligned AI infrastructure company, Crusoe.\nDavid: They build and operate GPU data centers for AI workloads, and each one is powered by low-cost stranded energy that otherwise would go to waste or worse get emitted as greenhouse gases. For this episode, though, we thought it’d be fun to talk about what actually goes into building and running a GPU cloud and how it’s different from traditional clouds run by the hyperscalers.\nBen: You might have been thinking, have Ben and David lost their minds talking about a new cloud provider in 2024? Isn’t it impossible to compete with the incumbent hyperscalers at this point? Yeah, if you’re trying to start a traditional cloud, but GPU clouds are different.\nDavid: Counter positioning.\nBen: Yeah. All the infrastructure that the hyperscalers have built up over the past two decades actually is not optimal for GPU clusters.\nDavid: Which brings us to crucial difference number one, location. Hyperscaler data centers need to be physically located where the Internet happens. Latency is really important when you’re powering an e-commerce website. But for 99% of AI training workloads, latency actually doesn’t matter at all. Instead, Crusoe puts their data centers in remote locations where \"energy\" happens.\nBen: Like where oil is being flared, and you can take that energy and use it to power your data center.\nDavid: Totally. This not only creates cost efficiencies, it also just enables way more absolute power density in a single location, which is super important when you’re trying to build a huge GPU cluster.\nBen: And that leads to big difference number two, cooling. AI training generates a tremendous amount of heat, and traditional cloud data centers usually manage that with air conditioning. Air cooling is not going to cut it when you’re running a massive GPU cluster full out for weeks or months on end. So Crusoe builds their data halls, which are the rows of racks within data centers, with direct to chip liquid cooling. This is where the liquid coolant gets pumped through the racks to cold plate heat exchangers mounted directly on each individual chip.\nDavid: It’s super cool. This is all state of the art stuff and impossible for the hyperscalers to replicate in their existing data center footprints, which means that Crusoe’s customers get AI infrastructure that just scales way better, bigger GPU clusters with less failures. When you’re trying to train cutting edge, large parameter models, that doesn’t just mean lower usage costs and better efficiency. It can mean the binary yes or no difference in being able to accomplish your workload at all.\nBen: It’s just an awesome company. David and I are super proud to work with them and also to be investors. To learn more, go to crusoe.ai/acquired, or click the link in the show notes and just be sure to tell him that Ben and David sent you.\nDavid: Thank you, Crusoe.\nBen: All right, Forrest’s summer in Europe. A little longer than a summer.\nDavid: Summer or close to a decade in Europe. We’re here at the end of 1932. Forrest and his young family now, by the way, with his young son, Forrest Jr., land first in Paris. Forrest tries a couple of little things, but eventually he decides that if he’s really going to build his own big company and stick it to his dad, he needs to learn the one critical thing that his dad didn’t know. He needs to learn how to make chocolate.\nBen: Yes. No better place than Europe to learn.\nDavid: Here’s his quote on it. \"You can hire lawyers. You can hire accountants. You can hire advertising men or financial types. But if you want to get rich, you have to know how to make a product, and you aren’t going to hire anybody to make a product for you to make you rich. They’ll only make it for themselves.\" Through that, Forrest is such a freaking G. If it hasn’t come across already on this episode, he is Hall of Fame, complete G.\nBen: You got to know how to do the scarce thing.\nDavid: Totally, so important. In early 1933, Forrest moves his family from Paris to Switzerland, to go learn from the chocolate masters. Forrest goes to work first at Johann Tobler, making Toblerone, and then at the original itself, Nestlé.\nBen: In the factories without disclosing to anyone who he is.\nDavid: When I say he goes to work there, it’s not like he calls them up and is like, I’m Forrest Mars. He doesn’t tell anybody who he is. His quote on this later is like, \"They never asked.\" He doesn’t get management roles. He goes and gets jobs on the line as a factory worker, learning directly how these machines work, how these chemical processes work, and how to make chocolate.\nBen: Amazing. Who would do this today? It takes a very specific type of person. If you’re sitting there thinking, only some European company knows how to do this well, and I’m someone who attended an Ivy League college, my family is wealthy...\nDavid: I’m friends with the du Ponts. Not only that, I basically feel like I’ve already built a $25 million business.\nBen: But I’m going to upend myself, my family, and my life and go be a line worker in a plant in another country? In this era, in the 30s, where it’s difficult to get over there, I imagine he went by boat, I imagine they didn’t speak English in the Swiss factory.\nWould you ever do this, listener? If you’re looking around at a pretty good life that you have and you’re saying, I’m going to go to a different continent, move my family, upend my whole life so I can go and learn this scarce skill that I know is the key to building a world-dominating business, it’s a big trade-off.\nDavid: Big trade-off and totally on brand for Forrest.\nBen: Because you couldn’t learn it in America, that’s the other thing. Hershey is super secretive at this point in time. No one knows their formula.\nDavid: I think not only is Hershey super secretive. The sense I get, at least from Emperors of Chocolate, is they knew how to productionize their recipe, but they didn’t actually know the science of how it worked. They got there through trial and error.\nThe sense I got is that the European chocolate manufacturers, probably Nestlé in particular, really knew what they were doing. Hershey, in an industrial sense, knew what they were doing, but nobody there really knew the science behind it.\nIn fact, there’s a story about how the first plant that Hershey expands to, their first second plant outside of Hershey, Pennsylvania, they can’t get it to work. They can’t get the chocolates to taste the same because they don’t exactly know how they get that specific sour note in the taste.\nBen: That’s so interesting.\nDavid: Anyway, back to Forrest. For most of the year of 1933, they’re just in Switzerland, and he’s working on the factory lines learning how to make chocolate.\nToward the end of the year, when he feels like he’s learned everything he needs to know, he moves the family to England, where he uses the $50,000 to open up a small factory in Slough, England, which is a small industrial town about 20 miles west of London. It’s right near where Heathrow Airport is today. He installs the family in a one room apartment above the factory. They start making a version of the Milky Way adapted to British tastes.\nBen: Which basically means more sugar, right?\nDavid: Yup. More sugar and less malt. Malt is not as big in British tastes. He has the recipe to the Milky Way that he’s adapted now for British tastes, but he doesn’t have the naming rights, so he names it the Mars Bar. This, of course, goes on to become the most popular candy bar in the UK, I think, still to this day.\nBen: The funny thing is, the lineage of this weird family split and this, you have the rights to the recipe but not the marketing, is the way that the world works today, even though they are, spoiler alert, one company now. If you get a Milky Way in the US and you go and you get a Mars bar in the UK, they’re a little different the way you just described, but those are effectively the same products they never unified the brand.\nDavid: There is also an important difference besides the level of sweetness and level of malt, and that is the type of chocolate that is used in the Mars Bar versus the Milky Way.\nBen: The Mars bar is Cadbury, right?\nDavid: In these early days, yes. Forrest has now learned how to make chocolate, but of course, with $50,000 in a new startup factory, there’s no way that he’s going to make his own chocolate.\nBen: Everything we talked about in chocolate making, it’s an insane amount of capex, really hard, easy to screw up, potentially low yield.\nDavid: Totally, and how are you going to get the supplier relationships for the beans. That requires a lot of capital, et cetera.\nBen: This part of the value chain really wasn’t well-established yet, where there are these companies specifically to go buy commodity beans from. It was starting, but it was early.\nDavid: Cargill wasn’t the massive giant with global liquidity for commodities buying and selling that it is today.\nBen: Speaking of gigantic US privately-held companies.\nDavid: Exactly. We’ll have to do that someday. As you said, Forrest goes and deals with Cadbury’s to supply the chocolate for the Mars bar, just like Hershey had supplied the chocolate back in the US.\nThis is also important because remember we were saying, their local tastes in each country market for chocolate and Cadbury’s chocolate is to the British taste. It actually is a pretty different bar, even though the core concept is very similar. But it’s just a matter of time in Forrest’s mind until the operation eventually grows big enough that he can and will make his own chocolate.\nBen: David, there is a Milky Way that you can buy today in the UK. Do you know what that is?\nDavid: I do, but I’m not remembering.\nBen: 3 Musketeers.\nDavid: That’s right. I knew it was one of them. I was like, it’s not Snickers.\nBen: That is the brand that they decided to use for 3 Musketeers overseas.\nDavid: Snickers originally was Marathon, I believe, in the UK.\nBen: Yes. But now, globally, Snickers is Snickers.\nDavid: Forrest is not making his own chocolate just yet, but of course, his goal is that he will. He has a great saying that he repeats often that I think this is maybe around the first time it starts coming up. \"I’m not a candy maker, I’m empire-minded.\" That’s his mantra.\nOnce they start producing the Mars bar, pretty quickly it becomes a hit and starts going really well. By 1939, five years-ish after they get production up and running, Mars UK has become the third largest candy company in Britain behind Cadbury and Roundtree’s. They go from nobody to the third largest player, big industrial scale, pretty quick.\nBen: In part, this is American capitalists coming into an industry. I don’t know if you know this or not, both of those families were Quakers.\nDavid: I didn’t know that. Interesting.\nBen: There was a pretty intense spirit behind the company of looking after your community.\nDavid: This is Cadbury and Roundtree, right?\nBen: Yeah. In particular, Cadbury built their Factory outside the city and this attempt at a utopia.\nDavid: Very Hershey-like.\nBen: In the same way that actually Milton Hershey was inspired by when he built Hershey, PA. There’s this very devout duty-bound religiosity to the existing UK chocolate companies, and in comes brash Forrest who’s like, we’re going to do things the most efficient we possibly can, we’re going to make the most profit we possibly can, and we’re going to distribute as broadly as we can as fast as we can. In many ways, it feels Bernard Arnault-esque, like, you guys, look what I learned in America.\nDavid: Yes, very much so. It’s funny. I wasn’t even going to tell this story because I don’t know how true it is. It’s just ridiculous, but we’ll tell you because I didn’t realize the religious element of the competitors.\nForrest, eventually, flash forward, will come back and will retake over at Mars Inc in America. When he does, the first thing he does is he goes into the boardroom.\nBen: It’s a manager meeting. It’s to his executives.\nDavid: He falls down on his knees and says, I’m a religious man. He clasps his hands together and starts to pray.\nBen: I pray for Milky Way.\nDavid: I pray for Snickers. I pray for M&M's. What a freaking character. If he was religious at all, he was religious about Milky Way, Snickers, M&M's. And dog food. To this empire thing.\nIn 1934, just one year after he started the whole thing and started making Mars bars, he comes across this small British company called Chappel Brothers, which had started making \"Chappies brand canned dog food.\" This is crazy. At the time, nobody fed their pets pet food.\nBen: Oh, really?\nDavid: Pets, dogs, cats, just ate table scraps. This whole idea that you feed specific pet food to pets all started in the 30s. Before that, it’s like, I don’t know, imagine going back to medieval times. The dogs and cats just eat.\nBen: Right, throw them a ham.\nDavid: That’s the way you clean the table.\nBen: Right.\nDavid: I have no idea how or why.\nBen: I couldn’t find it either. I looked all over the place. I was like, why of all the things to buy did he buy a pet food company?\nDavid: Totally. Why did the Chappel Brothers start making pet food? I don’t know. There is as little information as there is about the company and the family. What we do have, we have about the chocolate business. We have almost no information about the pet business.\nBen: Who are you going to ask? The Chappel Brothers are long dead, Mars isn’t going to tell you, but I’m so curious. How did Forrest get the idea, hey, I should go buy a dog food company when the market for dog food is new and unclear?\nDavid: He was visionary, he got so many things, and I think he probably thought or maybe the Chappel Brothers thought and convinced Forrest that in the post depression era and the coming modern world, people’s relationship with their pets would change and that they would start feeding them dedicated pet food. Obviously, that was a huge trend.\nBen: There’s economies of scale to the manufacturing of this. Making canned dog food isn’t that different from making snacks.\nDavid: Yeah, it’s a manufacturing process.\nBen: Interestingly enough, I learned this. The fact that this happened in 1935 completely blew my mind. I knew that Mars was in the pet food business much like Nestlé Purina is in the pet food business. I thought this was a recent diversification hedge, but here it is effectively at the founding of Mars or at least Forrest’s modern Mars, and he’s in the first second year of business buying and diversifying to pet food.\nIt was immediately a good idea because it became profitable after just a couple of years, and started generating enough cash flow to fund the expansion of Mars bars.\nDavid: Yeah, good margins in the pet food business.\nBen: Apparently, even in 1935.\nDavid: Yeah, so that’s a huge success. As this company is getting set up, would you expect any less of Forrest? He’s hitting it out of the park with Mars bar on the candy side. He’s building a whole new industry on the pet food side. This here in Slough in England is really where the principles, literally the principles, Mars calls them the five principles of the company today, but just the culture of Mars gets set.\nBen: You found the original ones, right?\nDavid: Yes. If you talk to anybody who works or worked at Mars, they will quote the principles to you religiously.\nBen: It’s like the Amazon leadership principles.\nDavid: Totally. It’s like, oh, that’s principle number five, freedom or, oh, that’s principle number three, mutuality, et cetera. I think how these started maybe even Back in England, Forrest started a document called the Mars Way, where he was codifying all this. After he retired and the business passed to his sons and the next generation, I think that’s when they adapted that document into the Mars principles. It’s really interesting. It’s worth going through them all.\nThe first principle is quality. Forrest was completely obsessed with quality in every dimension, the ingredients that are going into the candy bars, the candy bars themselves, the wrappers, the shelf placement displays. He was way ahead of the curve on all this stuff. He knew that candy was an impulse purchase and the way the product actually looks, how it’s displayed, what the packaging is, what the placement is on the shelf in the retailer.\nBen: How consistent it is.\nDavid: How consistent it is. These were big drivers of purchases.\nBen: There’s of course the famous story about he finds a defect in a wrapper, then he calls his executives into a room, and he hurls out the glass. It’s his temper and his obsession with quality all combined into one.\nDavid: Yeah, I’m laughing when you say the famous story. I’m like, which one? I think there are a million of these stories. Even here, in the 30s in the UK, he basically implements the Toyota production system in the Mars factory. This is long before the Toyota production system exists.\nAny employee in the factory could stop the line for any reason at any time. If there’s anything that’s out of place, anything that could impact quality, anything is dirty, anything is not perfect, every single worker in the entire facility can stop the whole line.\nBen: Also, if something had a defect, he would throw out the whole batch, right?\nDavid: Yes.\nBen: Like let’s scorch the earth around the defect.\nDavid: Yup. I’m sure he wasn’t thinking about it in these terms, but he really wants to instill this as a cultural norm in the company. Anytime, if there was a mistake that Forrest then found that hadn’t been caught on the line, he would just berate whoever should have stopped the line and be like, you needed to have stopped and fixed this and think you cannot let this get into the finished product.\nThe other aspect of the quality principle though, much like IKEA, it’s not just quality for quality’s sake. It’s quality for money. It’s quality at a given price, value for money. We’ve already been talking about how this is the ultimate scale business and scale economies business in candies. Forrest knows that if you can offer a higher quality for a given price than your competitors, you’re just going to build a lead and compound forever and ever in this business.\nBen: Interesting.\nDavid: Quality, principle number one, most important. Two, responsibility is the second principle. You might be like, oh, responsibility, okay, whatever. For all of his crazy intensity, Forrest was not a micromanager. He wanted to know how to do everything in the business, including making chocolate. But he knew that if he was going to scale, he wants to be du Pont here, he wants to be General Motors. He needs the best people working the hardest in charge of everything. He can’t be around telling them how to do their jobs.\nThe question then is when you’re starting up in a new country, tiny factory, how do you get the best people? How do you incentivize them? He’s like, well, I’ll just pay them. I’ll just pay them a lot. For years and years, the standard within Mars was that you should make three to four times the normal salary for your job.\nBen: That’s so insane.\nDavid: I think that’s come down over the years. It’s now 2x, but it’s still true.\nBen: I even saw numbers that say they try to pay their employees a minimum of 10% higher than other companies in the industry.\nDavid: Interesting. Definitely in those early days, it’s like, no, we’re going to pay you three or four times the amount that you would make elsewhere.\nBen: I also know they try to tie pay aggressively to the performance of the company. High bonuses rather than high salaries, which also means in tough years, they would just cut. It’s not quite having equity in the company, but it’s much more akin to being a partner in a business than it is to being an employee.\nDavid: Exactly. Okay. I said salaries. It’s not salaries, it’s bonuses. This is what your take home pay should be. Everyone’s salary in the company, again, starting in the earliest days there in Slough, tied to overall company performance and hitting overall company metrics. There is no, at least in the early days, an individual performance element to your bonus, except for one thing. Do you know what that one thing is? The one individual performance metric?\nBen: I do. Did you show up on time?\nDavid: You get a 10% bonus if you are never late in the entire year, and it’s everybody. From Forrest himself on down, everybody has a time card. You punch the timecard when you go in.\nBen: I’m pretty sure this is still true that the CEO of Mars today has a time card, they punch in and out every day, and a 10% bonus is contingent on not being late.\nDavid: Even more, I don’t think this terminology starts until they get back to America, but everybody in the company is an associate. Obviously, people are in charge of different things and have different external titles, but internally, everybody is an associate. There are no perks for anyone, so there are no executive parking spaces. There are no executive offices.\nBen: Forrest really wants to rebel against his father.\nDavid: There are no offices, period, to this day, at Mars.\nBen: Is this the first open office company?\nDavid: We said on the meta episode that we thought Facebook was the first open office. No, Mars was the first open office starting in the 1930s. Every building, entirely open floor plan. You get a black metal desk. Get this. This is how crazy it is. Again, even still to this day, there are just a small number of conference rooms in any given Mars office.\nBen: Yeah, because they hate presentations, right?\nDavid: They hate presentations. They hate meetings, but sometimes you have to have a meeting. The conference rooms do not have doors. There is no privacy allowed anywhere, which is the craziest thing, given that the company itself, externally, is incredibly private. Internally, the culture is everything is open, everyone is equal. There are no perks here whatsoever. Forrest is doing this in the 30s. This is crazy.\nBen: I was going to save this for later, but this is a fun time. I Google-mapped the recent factory that they built to make M&M's, and it’s like a corporate headquarters and manufacturing facility. There are a bunch of pictures on Google Maps of the exterior and interior, just like you would expect from anything that’s on Google Maps, and it’s pretty dated.\nIt’s just a very boring, drop ceiling, fluorescent lit, cheap office, and the real estate that it’s on is near an Amazon fulfillment center. It’s off the highway in the middle of nowhere, inexpensive. But there are two big M&M's waving at you out of the parking lot.\nDavid: I think that’s the standard decoration. Yeah, you can tell how pissed Forrest was at his dad about the Chicago factory specifically, but also just how deep seated this is.\nBen: Yup.\nDavid: Principle number three is mutuality. Forrest obviously is hyper competitive, but he also knows that this is an ecosystem that he’s in. The retailers are super important, the suppliers are super important, distributors are critical.\nBen: Everyone needs to make money, and everyone needs to be incentivized for the long-term.\nDavid: As long as his partners are making money, and making more money selling Mars products or supplying Mars than they are any of Mars’ competitors, that’s going to be a compounding advantage.\nBen: Yup.\nDavid: That’s three. Four is efficiency. This is a really interesting one. Probably back to his whole mindset, time at Yale, and studying du Pont, Forrest is crazy about studying business and management literature. I don’t think anybody was reading business management literature in the 1930s and 1940s.\nBen: It’s a good point. It’s true both for management and for investing. If you think about the way that people were even investing back then, it was like stocks were gambles.\nBuffett was one of the first people to believe the intelligent investor, oh, you can tell something about the quality of revenue in this intrinsic way to build the value of a business. The investment mindset of quality and a discounted cash flow and the management mindset of there’s a science to building an organization, these were pretty new ideas.\nDavid: Totally. Buffett had to go study with Ben Graham to learn this stuff.\nBen: Yup.\nDavid: While he’s in England, Forrest reads a textbook called Higher Control in Management by T. G. Rose, and the subtitle of this book is A Method of Producing the Facts and Figures of Industrial and Commercial Undertakings so that They Can Be Used for the Purpose of Management.\nBen: It’s quite academic.\nDavid: Yeah, business academia had not yet learned marketing about itself. In the book, though, Rose argues that the primary focus of management should not be on revenue, profit, or growth, but instead on a metric called return on total assets or ROTA. Again, if you talk to anybody in Mars today, ROTA. Everything is about ROTA.\nBen: It’s funny. I came across this researching. I had to look up the term. We’ve never studied it in an episode before.\nDavid: All right. What is the return on total assets? It is net profit dollars divided by the total dollar value of the company’s fixed assets.\nBen: It’s effectively an efficiency metric of your profits divided by your fixed cost of your assets.\nDavid: Yup. The textbook way to do it is by the cost of your assets as measured on your balance sheet. The way Forrest does it, though, and the way the company still does it today is no, that’s insane. Whatever this is valued at on our balance sheet, whatever it cost us to build this factory 10 years ago doesn’t matter. What matters is, what is the value of it today?\nBen: Interesting.\nDavid: They are constantly revaluing what the replacement cost is of all their fixed assets, all their factories, et cetera. Like, okay, if this factory disappeared...\nBen: What’s the market value if we were to sell this thing and get rid of it?\nDavid: Exactly. That way, they’re always making sure that they’re like, hey, we’re really efficiently using our assets. We’re not just artificially being efficient based on what we paid for them 10–20 years ago.\nBen: It’s fascinating. For you and I, it’d be like the profit dollars of the business from sponsorship divided by the cost of our microphones and the very modest tangible assets that we have in this business.\nDavid: Actually, I think if we were to use this, we would divide our profit dollars by the value of the Acquired brand. We would value the Acquired brand as highly as possible.\nBen: You’re basically wanting to say, per unit of fixed investment I’ve made, how much yield in terms of profit am I getting out of the fixed investment I’ve made?\nDavid: Exactly.\nBen: I’d argue, David, that for Acquired, we’d actually want to use our time valued at some certain amount as the denominator. What’s our profitability per unit of time which is our fixed resource?\nDavid: It depends, I think, what you think is more valuable—our time or the Acquired brand? We should probably do both, actually.\nBen: Who knew this would turn into an actual holiday special?\nDavid: Yeah. Anyway, supposedly, Forrest and Mars has, or at least used to have, a specific target of 18% return on total assets for every division and every factory, which means essentially that every investment needs to pay for itself in less than five years. If you’re making 18% of your value back every year, that would be 5–6 years if you’re using the textbook definition, but they’re always increasing the value of their assets. In effect, anytime Forrest is making a decision to invest in something, he’s like, I want a four- to five-year payback.\nBen: They don’t want to be higher or lower than 18%, because if you’re lower than 18%, you’re not using your resources enough to generate enough profit. If you’re higher...\nDavid: Then you’re taking too much profit.\nBen: You’re taking too much profit, which is bad for your customers, or you’re not reinvesting aggressively enough.\nDavid: You should be spending more on advertising and marketing, et cetera.\nBen: Right. It’s totally fascinating. I have a couple of other things on efficiency that I was going to save for the playbook, but since we’re here, we should bring them up.\nDavid: Yeah, let’s do it.\nBen: This one comes from a friend of the show, Arvind Navaratnam at Worldly Partners, who writes this great research that we link to for every episode now. He pointed out that despite operating with 30% fewer employees than its closest competitor—today this is Mars versus Hershey—Mars generated more output per worker than any other in the industry.\nIn 1990, for example, Mars’ revenue averaged $429,000 for employees compared to $228,000 at Hershey. They’re just doing more with less.\nDavid: Yeah, miles ahead.\nBen: I think part of this comes from the fact that they’re just amazing at the industrialization of production. David, you’ve raised that point that the factories run 24 hours a day and at that Chicago plant. I think today, the fun size Milky Way bars are produced at over 5500 bars per minute. It was a stat that I saw.\nThey just run at incredible efficiency in production, but they also then effectively share this increase in efficiency with employees by doing the higher pay and the bonus-based pay.\nIf the revenue per employee is way higher than their competitors like Hershey, they should pass some of that efficiency benefit along to their employees in terms of higher compensation, which in turn retains people for longer, which keeps tribal knowledge around, which decreases recruiting costs. It’s very Costco-like in that way.\nDavid: It is. It’s totally a flywheel type reinforcing structure, where it all fits together.\nBen: The other thing that they do is they aggressively try to reinvest profit dollars back into the business, doing things like R&D on new types of manufacturing equipment that they can build for their plants. That’s the primary benefit. The second benefit is they don’t pay as many taxes since they’re reinvesting before those dollars fall all the way to the bottom line as income.\nDavid: Totally.\nBen: It’s very John Malone-esque. They want to keep as much capital in the business as possible and not recognize a lot of it as income.\nDavid: Malone and Buffett too.\nBen: Yup.\nDavid: Then that brings us to the last principle, which is freedom, which, I think in the early days here, to the extent Forrest thought about this as a principle, I think it was just like, he wants to build his own business, be free from his dad, be his own person, prove himself. Over time, this comes to mean family ownership and not going public, being a private company, not taking on debt.\nIn the next generation after Forrest and beyond, it means being incredibly private. We’ve alluded to the privacy of the family. For years, the family refused to have any photographs taken of them for fear that they might get published. They really mean it about being private.\nBen: In fact, when Joelle wrote the Washington Post article, do you know the thing about the photographs?\nDavid: I think it was the first time that John and Forrest Jr. had ever been photographed in public.\nBen: It was, but then Mars didn’t like the Washington Post article, didn’t like the way it came out. Not only did they then fire their PR consultant, they went and found the newspaper’s freelance photographer and paid off $20,000 for the rights to the photos to be sure they couldn’t be reused.\nDavid: Yup, wild. Just wild.\nBen: As we’ve talked about from IKEA to our business here at Acquired, complete ownership, or at least board control in Meta’s case, is freedom. You can do things like invest for 10 years from now when it’s going to be a super lumpy period between now and 10 years from now. If you believe in the long-term vision, you can sub optimize the short-term. For Mars, that means private ownership.\nDavid: Yup, and I think it means things like you can operate with ROTA as your primary operating metric instead of profitability.\nBen: Good point.\nDavid: Back to the Forrest Mars story in progress. Starting up in the 30s—an amazing success story within a couple of years by the end of the decade—they’re the third biggest candy company in the country. Incredible achievement, riding high, and then the end of the 30s brings something else, which, of course, is World War II.\nBen: Yup.\nDavid: To hear Forrest tell it, the UK government decides that in order to help fund the war effort, they’re going to impose a very heavy tax on all foreign residents living within the country, which, of course, would include Forrest and the Mars family.\nBen: Which is an interesting philosophical tax. We need to go to war. How are we going to finance the war? Who’s riding the coattails of us being an awesome place to live but isn’t actually a citizen? Let’s tax them to pay for the war.\nDavid: Right. He would also claim that he believed that it was Cadburys and Rowntrees that actually lobbied parliament to implement this tax expressly to run him and Mars out of town because they were threatening their business.\nBen: Chocolate was a big national business. They were among the biggest companies in the country.\nDavid: Totally. It’s not unreasonable to think that. On the other hand, I suspect Forrest also had his ambitions always on coming back to America anyway, and now it seemed like a pretty good time to do it. In fact, it was a very good time to do it.\nIn 1939, he leaves all of his businesses running in the UK, and he moves with his family back to the US.\nBen: Also, that’s crazy. The fact that you can trust someone in the UK as World War II is breaking out, hey, you run these businesses that I own and I can trust that I continue to own them while I move across the ocean. I wouldn’t be confident that when all the dust settled, I would continue to own those businesses.\nDavid: Totally right. If Cadburys and Rowntrees was actually behind trying to run Forrest out of town, clearly they didn’t know the loyalty of his employee base well enough. Totally wild in 1939 that Forrest could do that.\nHe moves back to America, and of course he has his sights set back on Chicago and Chicago Mars.\nBen: Honey, I’m home.\nDavid: Yeah. Remember, Frank had died a few years before. At this point, Chicago Mars is being run by Forrest’s widowed stepmother, the other Ethel, and her half brother, who is the president and CEO of the business. They, of course, detest Forrest, and they won’t let him anywhere near the company.\nBen: Who owns the company at this point?\nDavid: Forrest has some shares after his dad has died, but he’s by far a minority shareholder. The biggest shareholder, I believe, is the other Ethel, the second wife, and then Forrest’s half sister, Patricia, her daughter, also holds a large stake. I think the employees of the business owned equity at this point. Forrest, I don’t know, I’m guessing he probably owns maybe 10%, maybe 20% of the business, not enough to be a controlling shareholder.\nBen: Okay.\nDavid: Forrest does what Forrest does. He says the hell with you. I started from scratch once to prove you all wrong, I can start from scratch and do it again back here in America.\nBen: Which is the final gauntlet, right? It’s one thing to go across the ocean and start from scratch in a smaller market, where no one knows your name. You can sneak around and do these deals. Now he’s here in America. Can he start a from-scratch candy company on the world’s greatest stage?\nDavid: On the one hand, he has more connections here and more resources. On the other hand, he’s battling the old Mars at every step of the way.\nBen: Right. He hasn’t lived here in close to a decade.\nDavid: Right, but he’s confident in his chances because he has brought back a secret weapon. Before Forrest leaves Europe, he had spied a new, to him at least, type of chocolate candy that had become popular with soldiers in the Spanish Civil War called dragée. I think it’s called dragée because I believe it was originally a French style of candy intended for French noble ladies who wanted to eat chocolate but not have the chocolate melt on their white gloved hands.\nBen: Interesting.\nDavid: What is dragée? Dragée is small round pieces of chocolate coated with a candy shell to prevent them from melting in your hand or in hot weather.\nBen: Confectioners call this hard panning, the colored candy shell, which is effectively hardened sugar syrup.\nDavid: Yes. Forrest, as he’s heading back to the US, thinks, I think there might be some global appeal here in this dragée product. Before we tell the M&M’s story, now is a great time to tell you about one of our favorite companies, Statsig.\nBen: We are going to do something a little bit different today listeners by sharing a story from one of their customers, Bluesky.\nDavid: I was somehow not at all surprised when Statsig told us Bluesky was a customer. It really does seem like every up-and-coming tech company these days is using Statsig—OpenAI, Figma, Vercel, Notion, Blue Sky, et cetera.\nBen: Listeners, by this point you’ve probably heard of Bluesky. They’re a new open social network that has a serious emphasis on user choice.\nFor example, users can build their own home feed and move between apps in the open ecosystem. If you ever decide to leave BlueSky or switch providers, you can just take all of your followers with you. They’ve got a ton of momentum. David, I didn’t even tell you this yet. I actually just set up the @acquiredfm account there yesterday.\nDavid: I saw the email come into the Acquired FM email address. That must be what that was.\nBen: Yup.\nDavid: The influx of new users that they have gotten over the last few weeks is massive. They have added 10 million new users just in the last couple of weeks. Pretty crazy for a relatively new social media app.\nBen: Yup. The BlueSky team has been using Statsig for pretty much everything from running experiments to collecting user analytics and releasing new features.\nDavid: We asked BlueSky to share a couple of specific use cases with us to illustrate. (1) When the Brazilian Supreme Court banned X in Brazil, Bluesky obviously saw an influx of Brazilian users. The way they realized this was Statsig. They had a dashboard that tracked posts by language, and all of a sudden they saw Portuguese posts spike, which tipped them off.\n(2) You may also be one of the many people crying out that you just wish you had a feed of people you follow in chronological order like the old days of social media. Bluesky has been using StatSig to run an experiment to mathematically prove that users want and enjoy this style of browsing a feed. It’s an inversion of the rest of algorithmic social media these days.\nBen: Totally. Listeners, we are a grown-up podcast now. We do things like get real quotes from customers as a part of segments like this. Here’s what Bluesky’s CTO had to say. “Bluesky collects a lot of feedback from users, but Statsig gave us concrete answers about what was working and what wasn’t. We thought that we didn’t have the resources for an A/B testing framework, but Statsig made it achievable for a small team. It remains our best tool for evaluating product decisions.”\nDavid: It’s so good. If you want to leverage Statsig to grow your business, there are a bunch of ways to get started. Statsig has an insanely generous free tier for small companies, a startup program with one billion free events, which is $50,000 in value and significant discounts for enterprise customers. To get started, just go to statsig.com/acquired. Remember to tell them that Ben and David sent you.\nBen: All right, David, M&M’s, let’s do it.\nDavid: Hell yeah, let’s do it.\nBen: I’m going to eat some dark chocolate and some almond M&M’s to celebrate.\nDavid: Nice. I think I’m going to pop a peanut butter. The legend is that the reason peanut butter M&M’s are not as big as what you would think their market potential is in the US, it’s because Forrest Jr. and John Mars, the sons of Forrest Sr., who would take over and then launch peanut butter M&M’s, grew up in England. They didn’t get the peanut butter and chocolate thing.\nBen: Is that uniquely American?\nDavid: Yeah, it’s an American thing.\nBen: Fascinating.\nDavid: Reese’s invented it. There’s a whole great Reese’s story. Reese’s was a separate company from Hershey that was built down the road.\nBen: I think it was a former Hershey employee.\nDavid: Former Hershey employee started it, and then Hershey’s later acquired the company. Great story.\nAnyway, here we are in August of 1939. Forrest and the family have moved back to America. He’s ready to hatch his plan, his revenge campaign, and he goes and pays a visit to Hershey, Pennsylvania. By pays a visit, in typical Forrest fashion, I mean that he shows up there anonymously and unannounced. He signs up and does the public factory tour.\nBen: It’s so awesome.\nDavid: So Forrest, so freaking awesome. After the tour is over, however, he asks the tour guide if he could please go see Mr. William Murrie. William Murrie, of course, being the president of Hershey and Milton Hershey’s longtime number two president and COO type, but the guy who actually ran the company. Milton by this point is very much focused on the town, the orphanage, the Hershey trust, and all that.\nBen: The gist here is, I need to buy some chocolate.\nDavid: Let’s keep telling the story. The guide’s like, excuse me, who are you? And why do you want to see Mr. Murrie? To which Forrest replies, just tell him Mars is here. That’s all he needs to know.\nBen: At this point, while Hershey was still a supplier to Chicago Mars, they were really starting to be a competitor. They’re starting to wake up to this idea that, yeah, we’re selling these other people chocolate, but they could just go eat all of our market share.\nDavid: Yes, they’re starting to wake up to that. But if this story is true, Forrest is saying, tell Murrie that Mars is here. Obviously, the implication being Chicago Mars is here, which is totally not true.\nBen: Right, because his father’s passed at this point, so the Mars that it probably is whoever is running the Mars company.\nDavid: Right, it’s Ethel number two’s half brother who is installed running the company. Either way, Forrest does get in to see William Murrie. Murrie has never met Forrest before, but of course knows who he is once Forrest introduces himself. Murrie’s like, great, okay, you’re back in the US. What can I do for you?\nForrest then proceeds to theatrically remove a handkerchief from his pocket and place it down on Murrie’s desk. He opens up the handkerchief, and there inside are dragée candy-coated chocolates.\nBen: This is so Steve Jobs, the showmanship.\nDavid: It’s amazing. Forrest is like, try one. Murrie does and he’s like, yeah, it’s pretty good. Forrest says, what if I told you that I have had these candies in my pocket all the way on the trip here from New York, the whole train ride, all the time outside in this hot, muggy August weather, all through the factory tour, and not once did they ever melt? In fact, how do they taste? Do they taste melted? They don’t taste melted, do they? Murrie’s like, oh. All right, you’ve got my attention.\nForrest and William Murrie work out a deal to start a new joint venture candy company that will be 80% owned by Forrest and 20% owned by Murrie’s son, Bruce. Forrest says, I’ve even got the name for it, we’re going to call it Mars and Murrie, M&M’s.\nBen: And it’s a new company. That’s what’s worth noting here.\nDavid: Several things are worth noting. Obviously, Forrest is totally brilliant. This is probably his most brilliant scheme on so many levels. He knows that if he’s going to build a new candy company, come back to the US, take on and defeat his father’s old company (Mars), he’s going to need resources. He’s going to need chocolate, which means he’s going to need Hershey’s chocolate.\nHe’s also going to need capital and money. He just can’t get that much capital out of his UK businesses. Remember the tax. There’s a reason, though, that he specifically goes to Murrie to make this proposal, not to Milton Hershey. Murrie is the COO type. He’s actually running the place and can marshal resources, but even more important, Murrie doesn’t own Hershey. He’s just an employee. The Hershey trust owns Hershey. Murrie has no inheritance to give his family. At this point, I think Murrie is 66 years old.\nBen: Mars is dangling something he wants.\nDavid: Forrest is offering Murrie the chance to have wealth, a legacy, and a business to pass on to his son.\nBen: Do you know what else Bruce Murrie had access to?\nDavid: The military?\nBen: Yup.\nDavid: Purchasing division.\nBen: Yes.\nDavid: Okay, we will get into that. It’s so brilliant.\nBen: This deal is nuts because Hershey has an exclusive arrangement to supply chocolate to the US military. The exclusive agreement. Forrest Mars has this thing that if you think the military liked count lines, they’re going to love these non-melt candy-coated chocolates.\nHe is going to the person who has the sole ability to provide the military with chocolate and saying, let’s start a new company together with your chocolate that is rationed for the war in World War II for the military. We’re only going to sell this to the government. I’m going to own 80% of it, your son’s going to own only 20% of it.\nDavid: I’m showing up with just the idea.\nBen: Hershey’s going to provide the chocolate, the sugar, the technical expertise, and capital. It’s going to be an 80/20 deal? I don’t understand how this deal got done.\nDavid: What else is Murrie going to do if he wants a legacy to pass on to his son? Murrie’s not going to go off and do this himself. That would be disloyalty to Hersey.\nBen: In fact, I would guess it’s to avoid a conflict of interest for Murrie himself to say my partner is actually your son, not you. His employment contract isn’t in violation.\nDavid: He’s only a 20% owner, blah-blah-blah. If Forrest were to go to William Murrie and say, hey, you and me enter into a partnership, that’s at least going to be 50/50, if not 80/20 Murrie to Mars. But by saying no, your son, he’s just so freaking brilliant. What a G.\nBen: Yeah.\nDavid: Murrie agrees to this. In the spring of 1940, Forrest and Bruce Murrie (the son) set up M&M Limited as a partnership. They build a factory in Newark, New Jersey, and they start production in 1941. Ben, as you say, build a factory with Hershey capital, resources, chocolate, sugar, and everything else.\nBen: There’s a great quote in the Cadbury book about how amazing it is that this is how Forrest makes his return to the US. The line is, \"Without the support of his own family but with the support of his leading rival, Hershey.\" It is spooky.\nDavid: You want to say diabolical, but I don’t think Forrest is diabolical per se. It’s just truly genius.\nBen: It’s just strategic.\nDavid: Of course, what else happens in 1941 right as they set up the factory and start production? The US enters World War II, which means significant chocolate rationing for all the consumers in America and significant chocolate consumption by the military. All of a sudden, the US military becomes Hershey’s biggest customer, just like during World War I, which means...\nBen: And Hershey’s is the only one with a chocolate contract.\nDavid: And the only one producing milk chocolate at significant scale in America, which means that they start severely limiting their wholesale chocolate supply to all of their enterprise customers like Chicago Mars. Or actually, they limit their chocolate supply to all of their wholesale enterprise customers, except for one, M&M Limited Partnership, because of course, it’s Bruce Murrie’s company.\nBen: Sort of, in minority.\nDavid: Yes, 20% of it is Bruce Murrie’s company. Of course, just like Hershey, the vast majority of young M&M Limited Partnership’s production is also going to the military. The Air Force was the biggest customer of M&M’s during World War II. The Army was number two. I presume the Navy was probably also a large customer.\nLike we’ve been talking about, who has the chocolate sales relationship with the purchasing officers in the Pentagon? It’s William Murrie at Hershey’s and Bruce gets to tag right along. As head of sales in the new M&M limited partnership, he is perfectly positioned to do that.\nBen: It’s so funny, head of sales. There’s one customer.\nDavid: Yes.\nBen: They’re not selling it to the public yet.\nDavid: No, there are three customers. There’s the Army, the Air Force, and the Navy.\nBen: Okay.\nDavid: Yeah, they’re not selling it to the public yet or in any real volume. There’s an interesting little sidebar to the M&M’s story here. I suspect many of our British friends are listening to all this and saying, hey, guys, what about Smarties?\nForrest, of course, was not the only one to spot the potential of dragée chocolates for military use and then eventually for public consumption. Like all things with Forrest’s history, it’s a little bit hard to untangle truth from fiction. One thing that is undeniably true is that Rowntrees introduced Smarties to the British market in 1937, so 3–4 years before M&M starts up in the US and two years before Forrest even leaves the UK.\nBen: He’s saying it’s this Spanish-American war thing, but very plausibly he just saw Smarties in the UK and was like, I got to go back to America and launch this quickly.\nDavid: There is no way that Forrest did not see Smarties in the UK before he left. And the early M&M's came in tube packaging, just like Smarties. Suspicious.\nBen: Also, for the American listeners, you’re probably like Smarties, those are a non-chocolate candy. What are you talking about? Those are different Smarties that are in the US market.\nDavid: Yes. British Smarties are delicious. I loved eating them growing up with my British family when I would go visit them in the summers. As best as I think anyone can tell, apparently there is some documentation about this in the Nestlé archives.\nApparently, Forrest and George Harris of Rowntree had both learned about dragées around the same time during the Spanish Civil War, and supposedly they negotiated a gentleman’s agreement that Rowntree could have the British market for dragée candies.\nForrest, who was at this point in time starting to plan to go back to the US anyway, he could have the American market. In return, Forrest supposedly gave Rowntree the rights to manufacture and market Mars bars in other British Commonwealth countries like Canada and South Africa.\nSupposedly, there’s evidence to this effect in the Nestlé archives, but we can’t know for sure. Regardless, none of this really matters, at least for a few years, because basically all of the world’s chocolate production is going to sovereign militaries around the world that are all fighting in World War II.\nMeanwhile, during the war, as M&M’s is starting up, the US military is a big customer, and Forrest is rebuilding his empire in America, he’s on the lookout for his Chappies equivalent to bring into the US.\nBen: Are you talking about rice?\nDavid: Time to talk about rice. Another business that can provide diversification, cash, and resources to build up the candy business.\nBen: This is so crazy. He owns a British company that makes Mars bars. He bought the Chappel Brothers. He started a new partnership in the US, a third business called M&M Limited, and now he’s looking to start a fourth company that makes rice.\nDavid: Yes, in Houston, Texas. There are also, as always, a couple of versions of this story. But I think the one that is closest to the truth is that back when Forrest was in England, he had gotten to know a chemist who had invented a new method for milling rice that was called parboiling. When you parboil rice through this new method, it results in more nutritious and importantly faster cooking rice for when you ultimately prepare it for eating.\nIn 1942, this chemist and Forrest forms another joint venture company in Houston, Texas. They patent the method in America and start producing rice to sell, just like M&M’s, to the military. What’s the military need a lot of?\nBen: Cheap calories.\nDavid: Rice. This is more nutritious, it cooks faster. Great customer. This becomes Uncle Ben’s Rice, today, Ben’s Original. The idea of launching a branded rice product in America was crazy. I mean, it’s not as crazy as the pet food business, but there were no brands in the rice category before Uncle Ben’s.\nBen: You just bought rice. It’s a commodity.\nDavid: This is the first brand, at least in rice, ever launched in America. Fast forward, today, Ben’s original does over a billion dollars in revenue annually. Crazy.\nBen: Listeners, you can tell, all these did become one company at some point, but at first they weren’t.\nDavid: It was all these puzzle pieces that Forrest was assembling. Back to M&M's. After the war, Forrest and Bruce Murrie, of course, now need to find new customers for M&M’s. They’re going to relaunch it as a consumer candy. Obviously that was the plan, use the military, bootstrap up the production, Hershey’s resources, but obviously this is going to be a consumer candy.\nBen: It’s crazy. Basically five years elapsed between when they founded the company and when they are able to actually do the consumer launch because of World War II.\nDavid: You would think, great. What a potential for the consumer market. All the soldiers and pilots have been eating these. Old war is going to be the same story as Hershey’s bars all over again. It’s going to make M&M's be Forrest’s big success coming back to America. Nope. Consumer launch, pretty tepid. It doesn’t get a lot of pickup back with consumers in America.\nBen: For years.\nDavid: For years. This, of course, as you would imagine, creates quite a lot of tension between Forrest and Bruce, especially because Bruce was in charge of sales. Bruce had been great at sales when he’s selling to the military, selling to consumers not so much. Did you hear about what supposedly Forrest did to Bruce here?\nBen: No.\nDavid: The story is, as sales are not going well, Forrest orders Bruce to produce a daily report of the past day’s sales of M&M's in a written form to him every morning in the office. Every morning where the previous day’s sales did not hit Forrest’s target, he would write in big letters in red ink ‘failed’ on the paper, and then he would go tape it up in the men’s bathroom in the company. We’ve obviously been very laudatory of Forest and he was an incredible, incredible genius. The dude also had a temper to match his genius.\nBen: Is he trying to get Bruce to leave the company at this point, or is he just trying to motivate him?\nDavid: Yes. Here’s the thing. You read about lots of people who worked for Forrest and lots of accounts in Emperors of Chocolate and elsewhere about his temper and how awful he was, and he clearly was awful. He’s also doing things for a reason. He’s trying to get Bruce to leave the company. He’s trying to push him out because he wants to own M&M’s 100%.\nIn 1949, four years after the end of the war and middling sales at best of M&M’s, Forrest finally succeeds in pushing Bruce out. Supposedly, it comes down to a confrontation one day, where Bruce is like, I can’t take it anymore with Forrest, how you’re treating me, posting these reports in the men’s bathroom. Supposedly, they get into a literal fist fight in the office in New Jersey. Forrest kicks Bruce out of the plant as security or whatever comes and takes him out.\nBen: Forrest is his boss. This guy owns 20%, but Forrest is the CEO. It’s not like he can take his shares, but he can fire him.\nDavid: Exactly. Bruce resigns. Once Bruce resigns, after this, this starts the negotiations of Forrest buying out his 20% stake. They settle on $1 million for the 20% stake. They’re valuing the M&M’s business at $5 million, this is 1949. If you adjust for inflation in 2024 dollars, that would be valuing the business at $65 million and buying Bruce out for $13 million. $13 million payout in today’s dollars for Bruce to walk away.\nBen: For a company that’s not clear it’s going to catch with consumers?\nDavid: Exactly.\nBen: Okay. Well, it’s nine years of work.\nDavid: Yeah, it’s nine years of work. I think you could really debate the valuation there on both sides. Certainly, M&M's were not yet M&M's.\nBen: In fact, they hadn’t even started having the Ms printed on them yet.\nDavid: No, they hadn’t. As soon as Forrest completes the purchase and kicks Bruce out of the company, takes 100% ownership, he goes in 1950 and hires the ad agency Ted Bates & Company to perform a comprehensive market study for the product. This is also another genius innovation on Forrest’s part.\nOther big diversified CPG companies like Procter and Gamble, were starting to do the sophisticated market research here like we’re talking about. The legendary Procter and Gamble product management function, this was starting to happen, but nobody in the candy industry did this.\nThe candy industry still operated, seed of the pants, Frank Mars–type entrepreneurial stuff. This is emblematic of the industry. Hershey had a strict policy of not advertising at all. No advertising whatsoever. They did not do any advertising until 1970, which is absolutely freaking insane.\nBen: They didn’t have sales targets either right?\nDavid: The story about sales targets and revenue growth targets in Hershey was that in some file card in some system, Milton Hershey had written gross sales 4% every year, and that was the plan. Hershey’s annual plan was gross sales 4%.\nBen: I will say it is pretty incredible how much from here on out, the story is a story of ad campaigns. We are getting from a place where before this it was all product innovation, and from here on out it’s marketing innovation. Who won chocolate between 1950 and 2024 is a story of marketing and distribution.\nDavid: Yes, 100% marketing and distribution. You say ad agencies. I don’t want listeners to get the sense that, oh, it’s just ad agencies that are doing this and it’s advertising. It really is the discipline of marketing, of which ad agencies, I think, were a lot more consultative in this function back in the day. Today, they’re much more execution-oriented. Really, this is like the creation of the modern marketing discipline.\nBen: Yup.\nDavid: The Ted Bates agency goes off. They do this product study, market study, of who do M&M’s appeal to. They find that actually, M&M’s are super appealing to kids.\nThis is interesting. The candy industry had obviously started as a kid’s market, but by this point in time, it’s an adult’s market. Everybody’s marketing to adults, that’s where everybody thinks the market is. M&M’s, Smarties, et cetera, had started as food for soldiers, so they were focusing on the adult market. It turns out kids love the little pieces and the bright colors, et cetera. Here’s the problem though. Kids don’t buy the candy, the parents buy the candy.\nBen: You’ve got a market for the parents to buy them for the kids.\nDavid: Exactly. They need to come up with some way to get that message across to the parents. This is where, frankly, I’m going to think just one of the most brilliant slogans and ad campaigns of all time is born.\nBen: The milk chocolate that melts in your mouth, not in your hand.\nDavid: It’s become like water these days. Everybody knows that slogan. What makes it so effective, I think, is that it just so gets at the very core of the psychology of being a parent of candy-age-eating-children. The core truth that it gets at is, yeah, you want your kids to be happy, but really what you want is for your kids not to cause chaos in your home.\nBen: David, how do you know all this information?\nDavid: I’m just reading about this and thinking, I’m like, oh, my God. Imagining myself as a parent in 1950–1951 when this comes out. The last thing in the world I want is my snotty nose kids running around the house, smearing chocolate all over the furniture, all over the walls, all over everything, which also is the last thing that I want as a parent in 2024.\nNow, here is this message being delivered to me of make your kids happy, get them to stop whining, give them the chocolate that they so desire, and it will not ruin your furniture and your house. It’s perfect.\nThey, of course, back up the parent marketing with also sponsoring the most popular kids’ television shows of the day, the Mickey Mouse Club and the Howdy Doody television shows. Boy, does it work.\nBy 1956, they start this campaign—call it 50/51, so five years later—M&M’s have become the biggest selling candy in all of America, doing over 40 million in annual sales and growing super fast. Bigger than Snickers, bigger than Milky Way, bigger than the Hershey’s bar. Incredible. Five years from basically zero to 40 million in sales. They’re just crushing it.\nBen: They’re starting to get worried about copycats, they start adding the little Ms. Actually, they were black at first. In 1954, they transitioned it to white. They ran a second ad campaign telling consumers, look for the M on every piece to verify the authenticity. They’re saying that we’re building IP here. We’re not just making candy. We are building a frame of mind, a nostalgia point, and a trust with consumers.\nDavid: Of course today, I say as I pop some M&M’s into my mouth, M&M’s are not just a kid’s candy. Kids still love them, but adults love them too. It’s back to this nostalgia thing. Everybody today who is an adult eating M&M's grew up eating them as kids.\nBen: In 1954, there’s the first TV commercial featuring the animated M&M's characters, obviously different from the ones you know today which are computer animated, but very cute hand drawn. Actually a few different versions of them, but pretty consistent concept all the way from then till now. The personalities changed a little bit but these personified M&M's that have witty stuff to say are there pretty early.\nDavid: Totally.\nBen: Speaking of copycats M&M's were so successful that Hershey’s really was getting worried. David, as you said, it became the better selling candy than Hershey’s bars. Hershey’s launched something called Hershey-ets. We’ll link to it in the show notes.\nIt’s fun looking at the old marketing for this failed product. The biggest issue with marketing Hershey-ets is people would say, what is it? In order to say what it is, you had to say, they’re like M&M’s, which that’s a tough marketing position to be in.\nYou nailed it earlier when you said being first to market is really important. In markets where it is important to be first to market, getting scale quickly so you become the product of record or of reference when people are trying to describe the category. M&M’s was that to a tee.\nDavid: Totally was.\nBen: Hershey’s would then later, as a part of the Reese’s franchise, try to do Reese’s pieces. Actually, there’s a fun story around that that we will talk about a little bit later. Here in 1954 land, there’s just a lot of fun dialing in the happenings of all the marketing. The peanut M&M's launched, but first only in tan. They then realized, what are we doing that we need to change this? In 1960, they added yellow, red, and green.\nRight around the same time in 1955, TV started becoming a real factor in Americans homes, and it was just perfect timing. It was a match made in heaven for these candy companies to utilize and create demand for their products after the war. If you wanted a brief moment of emotion for your brand with a quick tagline, a TV commercial is just custom made for that. Deborah Cadbury puts it really well. She says, \"One great TV campaign could shift decades of customer loyalty in a matter of weeks.\"\nDavid: Especially in a new category like candy-coated chocolates.\nBen: Yup. In 1955, Mars also gets into the vending machine business. Interestingly, over in England, they start this business called VendPack, which created the earliest vending machines. They eventually sold this off in 2006, but they had built coin mechanisms and bill validators. I think they were the market share leader in how to read bills in vending machines all across the world.\nDavid: They also got into change makers. You put bills in and you get coins out.\nBen: Interesting.\nDavid: Speaking of empire-minded, at this point, Forrest’s empire is pretty much complete. He’s got the most popular candy bar in the UK with the Mars bar, Mars’ European operations have become very, very large in and of themselves.\nBen: I think they had started making their own chocolate instead of buying from Cadbury by this point.\nDavid: I think that’s right. I think they had transitioned or were transitioning to making their own chocolate. In the US, obviously, he’s got M&M’s, which are now the number one candy in the US. He’s crushing it there. He’s got the biggest and pretty much the only pet food business in the entire world. He’s also got the biggest and only branded rice business.\nAll told, all of his sets of companies, I believe here now in the mid- to late-1950s are doing $200 million-ish in revenue. So a big empire. However, there are two things that he still doesn’t have. One, of course, is his father’s company, Mars Inc, Chicago Mars.\nBen: He owns what, 10%-ish around this point?\nDavid: But he doesn’t control the company. Two, of course, is fully separating himself from Hershey’s and controlling all the means of production for all of his American businesses and making his own chocolate in America.\nBen: Right. Because if Hershey’s cut him off, M&M’s would be screwed. He has a big liability there. Of course, Hershey’s doesn’t want to do that because then they’d lose a whole lot of business.\nDavid: They’d lose their biggest customer. Yeah, exactly. Probably also, knowing Forrest was strategic when he chose to push Bruce out of the business because I believe William Murrie had already retired from Hershey’s at that point. It would be Forrest to plan all that out to a tee.\nAnyway, like I said, at this point, Forrest’s empire is doing $200 million-ish of revenue annually around the world, and Chicago Mars had about $50 million of revenue, so Forrest is four times the size of Chicago Mars. When Frank Mars, his dad, had died, the majority of the company went to his second wife, Ethel.\nBen: It’s about two-thirds, I think, that she gets, and then there was one-third that had gone to random other shareholders over time, many of which were employees, I think.\nDavid: Yup, I think that’s right. I think maybe Forrest and Patricia got some small stakes at that point in time. Ethel, like we said, installed her half brother, William, running the company.\nEthel dies in 1945. When that happens, her stock gets split 50/50 between Patricia and Forrest, per Frank’s original will. Ethel had two-thirds, one-third goes to Patricia, one-third goes to Forrest.\nAs we get on into the 1950s, and Forrest has now turned M&M’s into a big success, he starts turning his attention to Chicago Mars. He goes to the board, and he says, hey, I own a third of this business, I think I should have an office at the company, and the right to come in and inspect the operations whenever I want. I think they were like, sure, this seems like an easy demand to give this guy, like, whatever, we’ll make an office for him.\nBen: There’s a fox that wants to hang out in our hen house. Is there anything anybody sees that’s an issue here? Nah, just build him an office.\nDavid: Clearly, they did not know Forrest very well because he shows up. I think he basically relocates to Chicago and is coming in every day. He’s spending a ton of time. He’s criticizing everywhere. He starts writing memos to the board about everything that is wrong at the company, All the big mistakes that William is making as CEO, and why William should be fired and Forrest should take over.\nBen: This is not so different from how Elon ended up owning Twitter.\nDavid: Yeah. It actually is very similar.\nBen: I’m just a 5% position, oh, I should be on the board, oh, I have recommendations. Before you know it.\nDavid: This is exactly the same way. Still though, William, Patricia, and the rest of the management isn’t going to get on board with selling to Forrest or letting him take over.\nIn fact, in 1959, William retires as CEO. Forrest figures like, okay, great, this is my chance. He starts lobbying Patricia. He’s lobbying everyone else who owns the company, all the management saying, great, sell to me, let me take over, let me run this business. Instead, Patricia decides to install her husband, James, who had been working in the business as CEO. Whether he was a good employee or not, he is a totally terrible CEO of Mars Chicago.\nOnce he takes over in 1959, revenue drops from about $50 million, like we said, to by 1963, it’s down to about $40 million. On the one hand, okay, a 20% decline. On the other hand, this is a very, very high fixed cost business. A 20% decline in revenue on a significant fixed cost base is catastrophic.\nBen: That would be a huge, huge change in the negative direction on your return on total assets.\nDavid: It is a disaster for the company. It’s also a very convenient disaster for Forrest, who wants to pressure everybody else into selling and being able to take things over. Finally, as this is happening in 1963, Forest flies to San Diego where Patricia lives, again, to give you a sense of James, the husband here, he’s commuting from San Diego to run this business.\nBen: They didn’t have Zoom then.\nDavid: No, they didn’t, and it’s a manufacturing business. Anyway, Forrest finally convinces Patricia to sell. He says, look, if we don’t do something here, this company is going to go bankrupt. I can save it. I will take it over. I will run it. She says, okay, I will finally agree on two conditions. (1) You have to promise me that you will not fire James, my husband. He can remain a CEO. Forrest is like, okay.\nBen: Are we putting that in writing or for how long?\nDavid: And condition (2), you need to promise me that you will make this company, our father’s company, Mars Incorporated, the new parent company of all of your businesses and preserve our father’s legacy. He says, sure, done, which is probably what he wanted anyway.\nBen: Totally. It’s also his name. Is it that different if left absorbs right or right absorbs left? If you’re the controlling shareholder of both, no, it doesn’t matter.\nDavid: Yes. Not yet CEO. Patty sells out in 1963. Forrest now owns two-thirds of the business. He spends the next few months going around to all the other shareholders of the business, again mostly current and former management, and buying out their shares. By mid-1964, he has full control of Mars Incorporated.\nBen: Which, by the way, is 20 years after Ethel dies. That’s how long he has been on this quest to get full control of the business.\nDavid: Right. Really, going back to him leaving for Europe, you have to imagine that this was on his mind the whole time.\nBen: Just as a side note here, it’s pretty insane that Forrest is able to, out of his pocket, without external financing, go and buy up two-thirds of a business that is doing $40 million a year in revenue. It’s just because he owns M&M’s, Uncle Ben’s Rice, and the UK businesses. This is not a strategy that most people could run if they’re like, oh, I wish I was a larger shareholder of this business that is large and dominant.\nDavid: You need some other way to get the money. Now, it was a distressed business at this point, but yeah, still.\nBen: I’m going to guess it’s still valued north of $40 million.\nDavid: Seems reasonable.\nBen: He needs to come up with $25-plus million in cash to pull this all off.\nDavid: Yeah, amazing. Once he takes control, he comes to Chicago. He immediately rips out all the office walls in the building, open floor plan for everybody. He demolishes the executive dining room, he sells the company art collection and the company helicopter, and he hands everybody, including James, a time card.\nBen: He may as well have walked in with a sink.\nDavid: He may as well have walked in with a sink. Seriously, oh, my God. Tragically, later that year, Patty dies of cancer. Super young. I don’t think she was even 50 years old yet. Once that happens, Forrest fires James and makes himself CEO of the entire empire, all united finally under Mars Incorporated.\nBen: I read this story, and I thought of the Darth Vader quote, \"I am altering the deal. Pray I don’t alter it any further.\"\nDavid: Yes. I’m not 100% sure. He may have kept James still employed in the business or something, but he was out as CEO.\nBen: Forrest is the captain now.\nDavid: Yeah. I am altering the deal. Pray I don’t alter it any further. So great. This now brings us to Forrest’s final conquest, which is making his own chocolate in America and fully ditching Hershey’s.\nBen: We should say, too, at this point, he has completely overhauled the Chicago factory. They’re all in on mass productions. These count lines are moving as they used to make a Snickers bar in a day, and now they can do it in under an hour. He’s just going.\nDavid: He’s going. His first act of business once he becomes CEO of Mars America, as he calls Hershey up, he’s like, hello. Remember me? I’m the new CEO of Mars. I just want to let you know that we are going to start phasing out our chocolate purchases from you all.\nBen: The way Hershey reacts to this is, what? You would be stupid to do that. Imagine how long it would take you to pay back the investment necessary to spin up your own chocolate factory. You would have to be nuts to take on all that fixed cost.\nDavid: We have literally an entire town here that is dedicated to making chocolate, and we are supplying it to you at a competitive price.\nThe Hershey’s team estimates that it’ll be at least 10 years before Mars turns profitable on this decision to make their own chocolate.\nBen: Okay. Let’s say he just did it for control and he didn’t think the math would pencil, which I don’t think is right, but let’s assume that. It’s been 60 years since they made that decision, so I am sure they have reaped plenty of benefits in operating leverage on having their own plant versus needing to pay all those extra little margin dollars here and there to Hershey’s.\nDavid: Totally. Forrest gives his Chicago plant managers a deadline of six months to start making their own chocolate in the factory. I suspect they turn profitable on this decision a lot faster than 10 years out, but there are obviously other reasons that Forrest is doing this too.\nOne is the quality principle, which I really do think the quality principle is number one in Mars for a reason. If you really are serious about wanting to produce the highest quality products at a given price, you need to control all the means of production yourself.\nBen: Anyone who’s serious about software should make their own hardware.\nDavid: Yes. Alan K for the win. The other reason that I think Forrest always had the dream of making his own chocolate is to be able to scale as large as possible. Like we’ve been saying all episode, this man so deeply knew in his bones how to operate in a scale economies market. By controlling all the production himself, that was just another step that enabled him to scale as big as possible.\nI think in any CPG business, it’s a scale economies business, but here we haven’t talked directly yet about how important shelf space is for candy.\nBen: I was about to bring up supermarkets.\nDavid: For candy, especially, It really is a zero sum game. 90% of all candy purchases are impulse purchases. Only 10% of candy purchases are planned purchases.\nBen: I found that it was 70%, and the place that I found it was from—this is flashing forward a little bit—some 1979 consumer market research that Mars commissioned. What they did with that information was they launched an all out initiative to lobby merchants to put candy displays near the cash registers, which didn’t happen until that point in history and is now ubiquitous.\nDavid: Interesting. It may indeed be 90% now in part because of those efforts by Mars.\nBen: They were like, how do we lean into the idea that 70% in 1979 of our candy is purchased on an impulse basis?\nDavid: Wow. I didn’t realize that. I thought that candy had always been by the cash registers. It wasn’t until this Mars initiative in 1979.\nBen: Maybe in smaller shops, but that’s (I think) especially with supermarkets when that changed.\nDavid: Interesting. Given the impulse nature of purchases here, it really is whatever candy is right in front of your face, tempting you to buy is what you’re going to buy. Being the scale player, being able to have the muscle with retailers to push Hershey’s and other candy to the back of the aisle or bottom of the shelf, makes all the difference in the world here.\nBen: There’s another interaction with supermarkets, where the power actually flows the opposite direction. It’s an aggregation theory thing. If you think about the way that merchants used to work, no one owned a lot of stores. The power was diffused among retailers. If you were a candy maker, you went to the local store in your town, and you said, you want to buy my bar, and they’d say, sure, and they didn’t really have an ability to push back or bargain, they didn’t have a lot of leverage.\nSupermarkets and especially chain supermarkets made it so there was a power concentration, where the supermarkets could go to the candy manufacturers and say, here’s what we want. We want to market a uniform set of candy and a small number of SKUs that don’t overwhelm us with inventory. We want you to put a lot of marketing behind those things that we’re selling, and we’re only going to stock them in the store if you’re really doing marketing campaigns.\nTelevision’s blowing up and we know that that moves product in our stores, so tell us whatever you’re going to do big campaigns on and that’s the shelf space that’s going to get allotted.\nDavid: You’re totally right.\nBen: It’s a shift in technology with TV. It’s a shift in consumer behavior with the supermarkets. What it results in is massive returns to the scale player.\nDavid: What’s so frankly is just sad is with the exception of advertising, Hershey had been benefiting from this for its entire life as a company. This really was Milton Hershey’s strategy from the get-go. Lower prices, get distribution, go nationwide, get shelf space, get placement, build a big company.\nBen: He just didn’t put his foot on the gas.\nDavid: Exactly. After his tenure and after Murrie’s tenure, the company basically became brain dead for three decades. They don’t do advertising. They don’t have a marketing department at all. It’s not like Hermes doesn’t have a marketing department. Hershey really didn’t have a marketing department.\nBen: I think it was one of these things where a company internalizes a behavior because it’s always been that way. They say, well, there’s a rule, and the rule is we don’t do advertising. That rule was developed in a different time and a different environment, where the rule made sense. Now, you’re senselessly following a religion that is no longer relevant in the new world.\nDavid: We haven’t talked yet about Hershey’s ownership structure. It wasn't a public company, but...\nBen: The controlling interest is owned by the trust.\nDavid: The management of the trust became super removed from the realities of the business and the market. I think that’s how this happened.\nBen: It makes sense. Reflecting back on this period of time, thinking about Forrest Mars, this was the moment in world history for the global scale economies founder to rise. If you think about the early 1910s, you couldn’t take advantage of economies of scale in the way that you can now with the rise of globalization.\nThere are things that would have been non economic before in addressing these small regional markets, but now that you’re distributing everywhere and America is a huge market on its own (finally), beyond that international, you have the potential for this personality type that Forrest Mars was to really succeed.\nDavid: You can advertise, market, and brand nationally for the first time via television. In the coming decades, internationally.\nBen: It’s the rise of the scale economies entrepreneur is the way to summarize it.\nDavid: Totally. Now that Forrest finally has his own chocolate making means of production, how did they finally knock off Hershey’s? When Milton introduced the Hershey chocolate bar in 1900, as we’ve talked about all episode, he priced it at a nickel so that everybody even in 1900 could afford it. The problem, as we’ve been talking about Hershey’s decades long brain–deadness here, they kept the price at a nickel from 1900 until November 1969.\nBen: What?\nDavid: They never changed the price.\nBen: I didn’t realize it was that long.\nDavid: Almost 70 years. A hair’s width from 70 years, they not once changed the price of the chocolate bar. It was sacrosanct. It was like, it’s the nickel chocolate bar, it’s Milton Hershey’s legacy, we can’t change the price. What did they do? How did they manage inflation? They just kept shrinking the bar size.\nBen: I got to say, by the way, that 5¢ in 1900, just so people get a sense of it, is 23¢ in 1970. It’s a 4½x that they have to figure out how to handle.\nDavid: What did they do? Rather than changing the price, they change the quantity. They just keep shrinking, and shrinking, and shrinking the size of the bar.\nBen: Consumers are going to love that.\nDavid: Yeah, they’re going to love that. The original Hershey’s bar was 1.25 ounces in 1900. By the time 1969 rolls around, it is half of the original weight. Ben, I see you’re looking at a Snickers there. How much is a Snickers today?\nBen: $1.86.\nDavid: $1.86. That’s not all chocolate. A lot of the mass of that is cheaper stuff like peanuts. You can see in the consumer’s mind, you’re like, wait, I’ve got this paper thin Hershey’s bar that, yeah, it’s a nickel, but compare that to the big meaty, satisfying Snickers, this looks ridiculous.\nBen: Consumers don’t care that the nougat’s cheaper. Truly, that is why Snickers is the satisfied slogan. Consumers care about how much value does it seems like when I bite into this thing and eat it.\nDavid: Yup. Finally in 1969, Hershey could no longer hold out. Commodity prices spike, and they make the historic decision to raise the price of the bar to 10¢. They think that the way they can make this palatable to consumers is they will also boost the size of the bar back up to the original 1¼ ounces. Actually, economically, they’re still at a loss here. Both were about double.\nBen: Okay, it doesn’t solve their problem.\nDavid: It’s just totally brain dead. The problem is inflation. I think the thought process probably was, okay, consumers are going to be outraged when we double the price of the bar after 70 years.\nBen: The first time we raised the price of the bar, we should give them some value. So the second time...\nDavid: Well, this is where not having a marketing department, doing consumer surveys, or anything…\nBen: A way to communicate with customers at all.\nDavid: Yeah. It turns out to be a really big problem. Consumers are just like, what the hell? (a) You just raised the price. You doubled the price. But (b) you have just totally exposed that you have been gaming us for 70 years.\nBen: This is literally still a big deal today, so much so that, do you remember the commercial that aired? I think it was during the Super Bowl from Joe Biden talking about shrinkflation.\nDavid: No.\nBen: This is like a presidential thing in our country today, where the president is railing against shrinkflation by keeping prices the same and making CPG food smaller.\nDavid: Amazing.\nBen: Yeah, I believe that people were outraged by it.\nDavid: People were pissed. Forrest is like, oh, man. Boy, am I ever glad that I started my own chocolate making process here. He now decides that in response, he is not only going to increase his advertising and blitz the nation with M&M’s and Mars products, he’s also going to increase the size of his bars while keeping prices the same. He starts a price and size war with Hershey.\nInterestingly, in response to this, Hershey counters by actually finally starting to advertise for the first time here in the 1970s, the first time in the company’s history that they advertise. Surprise, it works great. But because commodity prices are staying high and it’s putting pressure on profits, the board pulls the plug on their advertising because they say oh, profits are down, we can’t be spending, so we need to stop advertising. They do two years of advertising. It works great, but profits are down so they say, nope. We got to stop that.\nBen: Unbelievable.\nDavid: As a result, in 1973, the combined Mars, which is all of the legacy Mars Inc products, Snickers, Milky Way, 3 Musketeers, et cetera, plus M&M’s, passes all of Hershey to become the number one candy company in America.\nBen: There it is. I don’t think they ever looked back.\nDavid: Hershey did eventually retake the lead in America from Mars much later, but Mars is by far the largest candy company globally. Hershey is basically just in America.\nBen: I think Mars is an American candy business. It’s about the size of Hershey’s American candy business today. I think they’re neck and neck, but Mars has everything else too.\nThis game that you’re talking about, David, of the cat and mouse price war game would continue. Mars would basically have the advantage every time because Hershey’s primary thing they’re marketing is the chocolate bar, which is made of the densest, most expensive thing in the whole process. Mars just has a durable competitive advantage in that they’re selling something to consumers that they value at the same price, but the cost of goods sold is way lower. It has nougat and peanuts.\nWhat they basically do, there’s another time, I think this happens in the early 80s, where Mars knows that the commodity prices are on the uptick for cocoa, so it’s going to squeeze everyone’s margins, but it’s going to hurt Hershey the most. What does Mars do? They announce bigger bars at cheaper prices. What can Hershey do? They’re just getting boxed in from all angles. This is a sustainable, competitive advantage that Mars has, selling something that has just a lower cost of goods for an equal perception of value to customers.\nDavid: The other thing that Mars builds up through this, maybe even starting in the 60s but definitely in the 70s and 80s, is a very, very sophisticated commodities trading department that Hershey doesn’t have.\nMar: Really? Of course they do. Hedging and…\nDavid: Of course. It’s a very Mars style to do this. Obviously, it’s a private company. They never report any of this, but rumors are—these are rumors but I’ve heard it from multiple places—Mars has actually made many billions of dollars of profit from commodity trading over the years. Whereas for competitors like Hershey’s, commodity spikes and prices are a big risk and impact to the business.\nBen: I’m sure Hershey’s is hedging also.\nDavid: These days they are, but back in the 70s–80s, no, they weren’t. Mars is actually profiting hugely from market swings in commodity prices.\nBen: Wow.\nDavid: Total G. Speaking of—this is incredible—here we are in 1973, Mars passes Hershey to become the number one candy company in America. A pretty surprising twist happens here in Forrest’s story, which is the end.\nBen: He retires.\nDavid: He hangs it up, he walks away.\nBen: Concurrently with him deciding that’s it, this is basically when the company stops communicating with the outside world. Everything we’re about to share from here on out is short, it's basically just headlines that happened from news articles, and the company gets way, way, way more private after this.\nDavid: End of 1973, he’s built up this whole empire, gone to Europe, built the Europe business, built the pet business, come back to America, built M&M's, retaken over Mars Inc, battled Hershey, beat them at their own game. He gives the company to his three children, a third each to Forrest Jr, John Mars, and Jackie Mars, and totally walks away and retires. At this point, the empire is doing about $800 million in annual revenue, and he’s just done. He no longer owns any part of it for the moment.\nForrest spends the rest of the decade of the 70s in retirement. His mother, the original Ethel, is actually still alive, and I think he spends a lot of it with her and taking care of her. After 6–7 years, he’s starting to get a little feisty. You can’t keep an old horse out to pasture here. In 1980, when Forrest is 76 years old, he decides he’s getting back in the game.\nBen: He is his father’s son. What’s he going to do? He’s going to start a candy company.\nDavid: He’s going to start another candy company, which he names Ethel M Chocolates after his dear mother, Ethel, who, of course, he considers the real Ethel Mars and matriarch of the family.\nBen: By the way, I ate some Ethel M Chocolates last night. I ordered some to prep for this episode. They’re great. Delicious.\nDavid: I’ve never tried any. I need to get my hands on some.\nBen: It’s extremely different from the rest of Mars products. It’s like a specialty chocolate.\nDavid: Yes. Forrest’s business plan in starting Ethel M is basically to build a competitor to See’s.\nBen: That makes sense.\nDavid: He sees, just like Warren and Charlie did back in the day, See’s and high-end chocolate is actually a really, really good business. The plan is, the way they’re going to compete with See’s is they are going to specialize in liquor-filled chocolates.\nThey’ll make regular non alcoholic chocolates, high-end chocolates just like See’s, truffles and the like, but they also will specialize in alcohol-filled chocolates, which we’re going through a moment of popularity here in the go go 1980s. Forrest, as always, decides he’s all in on this. Liquor-filled chocolates are not legal in every state, and Nevada is the epicenter of them, so he moves to Nevada.\nBen: I did not realize that’s why Ethel M is in Nevada. That’s so funny.\nDavid: That is why Ethel M is located in Henderson, Nevada, which is a suburb just outside of Las Vegas. Forrest, by God, builds a factory there outside of Las Vegas, builds an apartment directly above the factory, and lives in the apartment above the factory from which he runs the business.\nBen: Guy has one speed and one playbook.\nDavid: And this dude is in his late 70s. It’s a success. Within a couple of years, Ethel M is doing $150 million in revenue.\nBen: Unbelievable.\nDavid: Like, get out of here. Unbelievable. As you said, Ben, it’s not competing with Mars in any way. It’s competing with See’s, but the business gets so big. Mars and Forrest’s children decide that they want to own this business. In 1988, after Forrest has been running it for 7–8 years, Mars acquires Ethel M for an undisclosed amount. I would love to have been a fly on the wall for those negotiations between Forrest and his children.\nBen: What’s the point of even negotiating? He’s already given all of Mars to the kids. What’s he going to do after the sale completes? Give the new stake to the kids too?\nDavid: Unbelievable. It is like the best coda ever to the story. Shortly after the Ethel M acquisition is when Forrest Jr. and John Mars, the brothers, who are running Mars now as co-CEOs, this is when they give Joël Brenner access and the Washington Post access to write the piece about the company. Ben, as you say, they weren’t happy with it. They never gave anyone access again.\nBen: Today, their CEO does speak publicly, does give quotes and statements. They do release press releases. They have a website. They, as a company, have recognized that times have changed, that consumers are not willing to go buy a product off the shelf when they know nothing about the company in this era of people wondering about, what is Mars doing with sustainability?\nWe live in America and a world right now, where diabetes is a massive epidemic and obviously, they make a lot of products that contribute to that. They want to have a voice in that conversation too. They do say more now than they used to because they’ve realized, we can’t be a $50 billion dollar company that doesn’t ever say anything ever.\nDavid: True, but what they don’t do is allow books to be written about them or any in-depth piece.\nBen: No one knows what their balance sheet looks like including their bankers. They don’t produce financial statements for their bankers. And some product stuff that happens in this time, in 1974, they start producing Skittles in the United States after it becomes a success in the UK.\nDavid: They bring Twix over from the UK. They bring Starburst over, which was opal fruits in the UK.\nBen: In 1986, Mars acquires Kal Kan Foods in Los Angeles and begins its association in America with dogs, cats, and their owners. They’ve had the British business for a long time. Kal Kan dog becomes Pedigree. Kal Kan cat becomes Whiskus or Whiskas.\nDavid: Also in 1986, they acquired Dove, Dove Bars, and Dove Chocolate.\nBen: They entered the frozen snack business.\nDavid: And then later launched Dove Promises and Dove Chocolate Bars on the brand. Dove was an ice cream bar company when they bought it, and then they launched the chocolate bars and chocolate pieces after having acquired the company.\nBen: Which I think works reasonably well.\nDavid: Yeah, I think so.\nBen: It’s not a huge business for them, but…\nDavid: It’s their direct Hershey bar competitor now, a direct competitor to Kisses and to the chocolate bar.\nThe really big story, though, I think of the brothers’ tenure and Jackie too as a third owner of the business, and eventually later, she does also work in the business herself, is globalization. During their tenure, by the time they hand the business over to professional management in 2001, they’ve grown it from $800 million when Forrest left to $20 billion in revenue.\nYes, there are all those acquisitions and product launches we just talked about, but the big thing is going global. The brothers take them to Japan, China, Russia, the Middle East, South America.\nThis is really fun. In 1984, they start sponsoring the Olympics, and they totally run the Visa playbook. This is when they start unifying all the product brands globally. Snickers is Snickers everywhere, and we can market globally. They really do an amazing job.\nBen: The brothers took it from $800 million to $20 billion?\nDavid: Yes, over 28 years, I believe, was their tenure.\nBen: A 25x in 28 years. It’s almost like the Tim Cook story too, where the out years of compounding and the globalization end up making the more recent story numerically far more interesting than the early story, but the early story is where the maverick is.\nWe told this whole story about Forrest senior, we’re going to spend 10 minutes here on the next generation, and the next generation took it from hundreds of millions to $20 billion a year.\nDavid: Incredible. That said, while globalization was a Herculean task, required a lot of vision, and commitment to it from the brothers, it really was outside of the M&A. It was about globalizing all the successful brands that Forrest had built.\nSpeaking of M&A, and we were also talking about See’s, Warren, and Charlie a minute ago, in 2008, Mars buys Wrigley with the help of uncle Warren and uncle Charlie.\nBen: I love that they come into this story. It’s the best.\nDavid: I know. There are some amazing quotes from Warren at the time of the deal. One of them’s like, \"I’ve been conducting a 70-year taste test on both Mars and Wrigley, and they both passed the test.\"\nBen: It’s so good. The analysis is actually far deeper than that, but that also totally sells. It’s Warren’s personality.\nDavid: Yup. He actually has a really insightful quote in the 2011 Berkshire shareholder letter while they were still a shareholder in Wrigley as a Mars subsidiary. He says, \"Buy commodities, sell brands has long been a formula for business success. It has produced enormous and sustained profits for Coca-Cola since 1886 and Wrigley since 1891.” He doesn’t say this, but obviously this is the Mars formula too.\nBen: Sell commodities, buy brands.\nDavid: Buy commodities, sell brands.\nBen: Not as an investor.\nDavid: Yeah, not as an investor. Companies that buy raw products and then sell them as a branded product.\nBen: Basically, you’re allowed to create margin. The market is giving you the right, consumers are giving you the right to do that. It’s funny. If you flip it and you say sell commodities, buy brands, that’s a good mentality for an investment portfolio. In fact, I thought that’s what he meant. I want to buy this because it’s a durable brand or house of brands. Interesting.\nDavid: It’s the operating paradigm for a company of purchasing raw commodities and selling them as branded products.\nBen: If you have cocoa beans backed up to one side of your factory and then Snickers bars coming out the other, it’s a good business.\nDavid: You’re going to do good.\nBen: Interesting.\nDavid: It goes down in the middle of the financial crisis. They announced the deal in April 2008, but it closes in October 2008 right after Lehman collapses. Mars buys the Wrigley Company for $23 billion.\nBen: Which is a 28% premium to where it was trading that day.\nDavid: Even Mars at this point in time doesn’t have $23 billion of cash on hand.\nBen: They may have, but they didn’t want to use it. I’m always trying to guess how much. Through all these points in history, I think Mars piles up a lot of cash, but I think they’re really conservative in how they decide to deploy it.\nDavid: This is the trade-off with efficiency, freedom, return on total assets as the way that you’re going to manage, is you’re just going to be very conservative in how you run the company.\nMars pays $11 billion itself. They get $5.7 billion in bank debt from Goldman Sachs, and then Berkshire comes in with the rest of the financing, about $6.5 billion total.\nBen: $4.4 billion of that was a loan, and then $2.1 billion is an investment into the newly-created Wrigley subsidiary. Over time, Wrigley will use the profits from all their businesses to buy out Berkshire. It must have been negotiated in that Mars had the right over some period of time to buy out that $2.1 billion equity investment.\nDavid: Indeed, that is correct. What happens five years later in 2013? Mars repurchases the debt portion of Berkshire’s financing. God, the financial crisis. Warren was so good at investing in such high quality companies at the interest rates that he got. The $4.4 billion in debt that Berkshire invested had an 11.45% interest rate.\nBen: Oh my God.\nDavid: During the five years that it was outstanding, Berkshire earned $2.5 billion dollars just in interest. When Mars bought it back in 2013, that was before the debt matured, so they had to pay Warren a premium to buy it back early. They paid a $680 million premium. All told, for the $4.5 billion debt investment, Berkshire gets its money back plus another, call it $3.1–$3.2 billion just on the debt.\nBen: Over five years.\nDavid: Over five years. Now the equity portion. The $2.1 billion in 2016 Mars buys out Berkshire. Buffett sells Mars his entire stake back for $4.6 billion versus the $2.1 that he originally invested.\nBen: He more than doubled the money in five years on that in addition to almost doubling the money on the debt.\nDavid: Even better for Warren. Because that equity that he held was preferred equity, it also had a dividend associated with it, of which they likely made another billion dollars in dividends on the preferred equity.\nBen: It’s interesting that they did the bank debt from Goldman Sachs and this dual instrument from Berkshire. Why not go all one or all the other? Because you would think they would have the option to.\nDavid: I think this gets back to the value that Warren and Berkshire always provide but were especially providing during the financial crisis, which is just the reputational guarantee and solidity.\nBen: You think getting Berkshire was what they used to be able to pull in the bank debt.\nDavid: I bet it helped pull in the bank debt because I doubt Mars had significant banking relationships going into this, because they didn’t have any debt.\nBen: No. In fact, they classically never do acquisitions with outside banks. They’re obsessed with using only their own cash.\nDavid: And Goldman was Berkshire’s preferred bank, so they probably put Goldman in. The other aspect to this is the Wrigley shareholders. You had to give confidence to the Wrigley shareholders to vote for the deal to get it done. Having Buffett come in, put his stamp of approval, calm everybody down even in the midst of all the craziness with Lehman, I suspect there’s no way the deal gets done if Berkshire doesn’t get involved.\nBen: That’s really interesting.\nDavid: Given what was happening in October 2008.\nBen: Wow.\nDavid: All told, Berkshire puts in $6.5 billion and about doubles its money in the whole eight years. Five years on the debt and then another few years on the equity. How much did Goldman make on the deal? I doubt that much.\nBen: Definitely, Berkshire got some premium for using their reputation in this deal.\nDavid: Interestingly, we didn’t dive super deep on Wrigley as a company, but it’s a very good business. Probably I’m guessing, even better than the candy business, because gum, I believe, is mostly a petroleum byproduct.\nBen: Is it really?\nDavid: Yeah. For a long time, I don’t know if this is still true. Goodyear, the tire company, was one of Wrigley’s major suppliers. It was unused byproducts from petroleum, that if you can brand that and sell it to consumers, you can have pretty good margins.\nWrigley, I went back and looked at their old 10-Ks before Mars acquired them. They had about 50% gross margins and 20% net income margins in the last decade of the company. Pretty good for a business like that.\nBen: Not bad.\nDavid: Not bad at all. They also owned mints like Altoids and Lifesavers. That’s the other big part of the business.\nBen: Right.\nDavid: If chocolate is an expensive product to make, gum is a not expensive product to make.\nBen: Other things that happened in the 2000s, they bought a significant stake in the Banfield Pet Hospital chain, which is the largest chain of pet hospitals in America.\nDavid: And was started in partnership with PetSmart.\nBen: That’s right because most of them are actually in PetSmarts.\nDavid: That partnership is now ended, and Mars now owns Banfield outright 100%. I believe in 2007 they took a large stake, and then in 2015 they fully bought out PetSmart for 100% ownership.\nBen: That’s interesting. It is worth noting. We did some sleight of hand there. That’s a completely different business, pet hospitals, than dog food. Related, in pet care, you can use the pet hospitals as a channel for your dog food, but a very different type of operation that needs to be performed.\nDavid: This really is the big story about Mars of the last 10 years. After they fully acquired Banfield, in 2017, they acquired VCA.\nBen: Which is even bigger, right?\nDavid: Yes. They were the largest independent vet hospital operator in America for $9 billion, so a large acquisition. Ben, like you say, there are two interesting things about getting into this business. It’s a super different business. We’re talking about a services business. This is not manufacturing, so very different DNA.\nI think a big part of the strategy, though, like you said about distribution of pet food, in 2002, Mars had bought a French pet food company called Royal Canin, or I’ve also heard it pronounced Royal Canin. Royal Canin makes prescription pet food, especially for an aging dog or a mobility challenge dog.\nAs dogs became more and more family members and people started caring for them more and more like humans, prescription pet food became a really big business. I think Royal Canin was a grand slam acquisition for the company. I think that’s partially what led them to then get involved with Banfield and VCA of, oh, let’s consolidate a lot of the distribution and value chain here in this prescription pet food business.\nBen: Pretty interesting. It’s a very different business, but they run so decentralized that it’s probably okay that it’s a services business. You’re not having people who are making candy trying to run a veterinary clinic. It’s a pretty small head office, and it’s a very decentralized operation. I think the decision-making authority really rests with the board still, but these independent operating groups are independent operating groups.\nI’ll pull a playbook theme forward, which is that this company obviously grows through inorganic acquisitions. In buying Wrigley, Royal Canin, VCA, all these, Mars itself, they’ve overpaid on a price to earnings basis. Wrigley was a 35x and a 27% premium over the public valuation. Royal Canin was a 39x. If you think about, especially with Banfield Pets Hospitals, they really understood what they were buying. They were able to underwrite better than anyone else.\nI think this is very similar to the idea that Ho Nam shared with us way back in our 2021 episode, which is that multiples are a blunt instrument used for valuation when you don’t actually deeply know and understand the business. When you do, you can just underwrite better than everyone else. You have more margin of safety in the price that you are willing to pay than the rest of the market does. When they want to come in over the top at a 35x for Wrigley, maybe they know more about Wrigley than other bidders do.\nDavid: Interesting, yeah.\nBen: Or at least the case on Banfield was we’ve owned pieces of this business over and over. Now that we’ve amassed a minority share, we feel good about buying a majority share.\nDavid: I totally buy it.\nBen: Arvin from Worldly Partners had a good comment to me about this that they shoot bullets, not cannonballs. When you see that in an acquisition strategy, you should be careful not to judge too harshly when people overpay for things because they’re taking these little baby steps to try and understand first, and maybe they know something you don’t.\nDavid: Speaking of, they ran this playbook again with their most recently completed big acquisition of Kind Bar.\nBen: Yes, $5 billion in 2020 after buying a small piece of it a few years earlier, and then buying the rest of it in 2020.\nDavid: I didn’t realize how big Kind was. Kind was doing $1.5 billion in revenue, I believe, almost completely domestically in America.\nBen: Yeah, and Mars took it global.\nDavid: And Mars took it global, yeah. I think that has been a big success for the company as well.\nBen: Do you know how they grew so big domestically?\nDavid: I don’t.\nBen: Starbucks.\nDavid: It makes sense.\nBen: Check out counters at Starbucks. Impulse purchase.\nDavid: There you go.\nBen: It fits with Starbucks brand ethos. It’s healthy. Honestly, I eat them all the time. It’s a five-gram sugar bar that’s super satisfying, that doesn’t leave my teeth feeling gross or make me feel like I ate something with a bunch of unnatural ingredients. I know it’s still a candy bar, but it’s a five-gram sugar candy bar. I think as far as Mars thinking about, geez, we want some diversification hedge if people stop eating candy bars, they’re on a good trend there.\nDavid: Which leads us to the final piece of the story, maybe, which is the biggest deal that the company has ever done or is attempting to do.\nBen: In August, Mars announced that they have entered a definitive agreement with Kellanova to purchase the company for $35.9 billion. What is Kellanova?\nDavid: As we were researching this and getting into this, I was like, Mars is paying $36 billion. What is Kellanova?\nBen: It’s like Mondelez. You’re like, ooh, what’s Mondelez? That sounds interesting and foreign and you’re like, oh, it’s Kraft. It’s like a weird corner of Kraft.\nDavid: Kellanova, do I have this right, is Kellogg’s minus the American cereal business?\nBen: That is correct. It’s all the snack businesses and international cereal. The snacks are r Rice Krispie Treats, Pringles, Eggs, Pop Tarts, RXBAR, which is going to be interesting if they’ll own RXBAR and Kind Bar. It is the largest CPG transaction since the merger between Kraft and Heinz in 2015.\nDavid: Another Berkshire Hathaway special.\nBen: If you think about it, the family is worth $117 billion today, which essentially means the company’s worth $117 billion, which is interesting. It’s a $50 billion company that at least Forbes pegs it at $117 billion of enterprise value. Of course, there’s no market to buy these shares, so who knows how to value it really?\nDavid: When you say $50 billion company, that’s their annual revenue?\nBen: Annual revenue, yup.\nDavid: They have started reporting in recent years, or at least alluding to what the top line revenue number is.\nBen: Yes, that’s correct. They’re going to get a lot bigger, I guess, is the takeaway from this. If they’re worth $117 billion now, and they’re using a bunch of their cash and presumably some outside leverage, we’ll have to see, for a $35.9 billion acquisition, that’s a big size up.\nDavid: That is transformative, yes. It also basically makes them look like Nestlé, which Nestlé has been the real competition for years now.\nBen: And Nestlé’s huge. They’re over $100 billion in revenue, and they’re extremely diversified.\nDavid: Extremely diversified, yes. Obviously, again, Mars has always been diversified, but nowhere near the extent that Nestlé is. Now with the Kellanova acquisition, they’re going to look a lot more like Nestlé.\nBen: Mars is going to be selling, I just looked it up, investment grade bonds to help with its planned sale of Kellanova. They are raising some outside capital for that, not just using their cash.\nDavid: Interesting.\nBen: That brings us to today. David, we were just talking about it in 2021. They did $45 billion in revenue, 2022 was $47 billion, 2023 was $50 billion. To your point, they’re now saying over $50 billion. Here’s the interesting thing that we have been hiding from listeners the whole episode and I know you’ve been dying to say, Mars Snacking did $18 billion in revenue. That is a segment of their business that includes all the candy.\nDavid: We’ve told this whole story all about the smaller piece of the business.\nBen: You’ll notice $18 billion is not only a smaller number than $50 billion, it’s less than half of $50 billion. Pet care is actually the bigger business. Fifty-nine percent of revenue comes from the pet care segment. Of their 140,000 employees, almost 100,000 work in pet care.\nDavid: Of course. Service is business. They own thousands of hospitals.\nBen: We don’t know the margin of the pet hospitals versus the dog food, versus the candy. Specifically about Mars, we can probably look at industry comparables to try to understand that. At least on a top line basis and an employee basis, pet care is the dominant component of this business.\nIf you want a little bit of a hint, the new CEO in 2022 came from their pet care division. In many ways, they are a pet food company that also makes candy and always has been.\nIf you look back, it was the year after Forest Mars founded the UK division when they bought the first dog food, which was almost immediately cash generative. The biggest aha moment to me is, they’ve been doing this the whole time other than the veterinary services. That is again new.\nYou might be wondering, well, how significant of the market of vets do they own? Mars owns 3000 locations out of 35,000–40,000 vets in the US. That’s 8% of vets. They’re not just exploring vets, they’re the largest or one of the few largest players in vets in the entire country.\nDavid: I think they are the largest. There are other vet roll up plays. A darling of search funds and private equity in the last decade is veterinary roll ups, dental roll ups, stuff like that.\nBen: Looking at the market, at least in the US, Mars and Hershey each have about 24% market share of candy and confections, and no one else even comes close. It’s the Hershey and Mars show here domestically.\nInternationally, it’s a different story. It is a very fragmented industry. Mars is the whale with 11%, but the next highest are 7% and 5%, and only a third of the market is made up by the top five companies, Mars, Mondelez, Ferrero, Hershey, and Nestlé. Two-thirds of international candy confections are made up by smaller companies, and that is even after all these mergers from the last few decades. There’s still this huge international long tail of candy companies.\nDavid: Wow, because there’s already been huge consolidation.\nBen: That is the shape of the business today. You’ve got a pet business masquerading as a candy business, and we continued to perpetrate that narrative.\nDavid: Obviously the pet business, huge, bigger in revenue, and I’m sure very, very large in profits as well. I don’t know. I’m just purely speculating, but I suspect profit contribution–wise, they’re at least equal, if not bigger on the candy side. I could be totally wrong. I don’t know. I don’t know the economics of pet hospitals.\nBen: I would love to know that. If your last name is Mars, please reach out or join us in the Slack, acquired.fm/slack. We’d love to hear from you. Power?\nDavid: Power. This is a segment we do in analysis in every episode based on Hamilton Helmer’s excellent Seven Powers book and framework. The idea is that there are seven ways that a business can sustainably generate significantly more profit than its closest competitors.\nThose seven ways are through counter positioning, scale economies, network economies, switching costs, process power, branding, and cornered resources. We have spent a lot of this episode talking about the biggest and most obvious one here in scale economies.\nBen: Actually, like a lot of the businesses we study on this show, scale economies is the biggest deal.\nDavid: It is actually crazy. Almost always, scale economies is a big part of it.\nBen: I think for the biggest businesses in the world, it’s these businesses that operate at high gross margins in very large markets, where you basically can build out a massive fixed cost base and then have great operating leverage. Can you amortize your high margin sales in huge volume across a comparatively small fixed cost base? Manufacturing businesses are like that, software businesses are like that.\nDavid: Cloud competing is like that.\nBen: Exactly. The businesses that get the biggest tend to benefit from this principle.\nDavid: Totally. Okay, scale economies, check.\nBen: Done. There’s a thing I want to bring up with you, and this has been a debate in the acquired Slack, I don’t know if you’ve seen it at all, around branding. The classic definition of branding, and I need to reread Seven Powers to refresh myself on this, but the idea is if I show you two products side by side that are identical but one is branded, will you pay me more money for the one with the better brand, the Tiffany ring versus the unbranded ring?\nI think there’s another way that branding shows up. We said that IKEA doesn’t have brand power in the last episode. That’s obviously not true. It might be technically true in that they don’t take margin, but they have to deploy their brand power in another way.\nIn the same way that Mars, I don’t think, charges more for a Snickers than a different candy bar. Mars doesn’t take price in the form of brand, but they do something else. There’s brand power here for sure. Consumers pick Snickers over unbranded, random, unsafe, untrusted candy bars.\nDavid: Definitely. I think it’s got to be a version of our Costco episode, scale economy is shared, brand power is shared.\nBen: There was someone in the slack that pointed out this brand power could translate to volume. Essentially, if you trust the brand more and the prices are the same, you just buy more of it over time. You give more absolute margin dollars to that company over time, especially in a recurring purchase business like this. That’s the way that brand power accrues. It’s not in margin percentage, it’s in total lifetime margin dollars.\nDavid: I’d totally buy that.\nBen: By that definition, they absolutely have branding.\nDavid: I’ve got one I want to talk about. I’m curious if any of the other sets jump off the page to you.\nBen: I think the candy industry used to have cornered resources. I don’t really think it does anymore. Same with process power. I’m not convinced that anyone’s actually developed a superior way to make something that is not known by others in the industry.\nDavid: I think Mars has always had the best technology, the best equipment, and the best resources. There are actually great stories about Forrest, perhaps both himself, but also through employees and outside firms he’d hire would come up with all these technical improvements to the manufacturing equipment, but they would never patent it because he didn’t want to tip off any competitors.\nBen: It makes total sense, keep it a trade secret.\nDavid: Totally.\nBen: No, none of the others jump off the page to me.\nDavid: Obviously, we did not do a deep dive on the pet business, despite it being the larger business. I think, though, the main power in the pet business is switching costs.\nBen: If your dog doesn’t have problems with its current food, you’re never changing to another food?\nDavid: Yes. There are a couple of dimensions. (1) You’re never going to change to another food because it’s going to cause digestive issues for a while. Imagine if you only ate one food for years and years of your life, and then all of a sudden you started eating...\nBen: What are we doing? We should be feeding him table scraps so they get a well.- rounded diet.\nDavid: Just like the 1930s, exactly. It happens. Dogs switch food all the time, but it’s not like humans choosing to eat something else. It’s a process. But then, pet hospitals, vets, huge switching costs. I actually think this is the primary power in the business on the pet side.\nBen: I think that’s right.\nDavid: That’s power. Should we do playbook?\nBen: Yes. The first one that I have is that you actually can build a durable, sustainable business through great marketing, not just great products. This makes me uncomfortable as someone who doesn’t want to believe that, who always believes the best product wins.\nOn the Meta episode, the takeaway was their growth came from product and not from marketing. In this episode, I feel like it’s the opposite. The whole thing is the story of marketing campaigns and how whoever had the better message for America at that moment, at least post-1960, was able to lean on that.\nDavid: After the advent of television.\nBen: Yeah, and of course, paired with distribution, paired with grocery stores. Actually, let’s talk about the ET thing.\nDavid: Yes, let’s talk about the ET thing. This is really fun. In the late 1970s, early 1980s, when Spielberg is making the movie ET, he’s written into the script that ET is going to be lured into the house by a trail of M&M’s. Anybody who remembers the details of the movie remembers that it is not M&M’s.\nBen: M&M’s passed on the opportunity because it had to come with a guaranteed million dollars of co-marketing, consumer promotion, trade promotions, displays, featuring ET. Mars was not down to do that with the M&M’s characters and passed on the opportunity. If you saw the movie, there’s a pretty memorable moment where it’s Reese’s Pieces.\nDavid: This was relatively early in the brother’s tenure. I wonder, (a) if Forrest would have made a different decision, and also (b), if the brother’s would have made a different decision, had they had a little more confidence in their own security in their own places, CEOs. I think there was a timing element to this.\nBen: Hershey almost passed too. Someone had to basically go bang down the door and say, I’ll actually pledge a million dollars from my budget that I was going to use for other stuff to use for this instead. The Hershey leadership was also going to pass on it.\nDavid: This was one of, if not the biggest deal up until this point for product placement. It was a paradigm-setting deal.\nBen: It worked in a huge way. Multiple sources cite that it 3x’d the sales of Reese’s Pieces when this came out. Reese’s Pieces launched it a year before, it had done well initially, it fell off, and then they were trying to use this to, hey, maybe we can galvanize sales. I think it tripled Reese’s Pieces’ sales for a while. Ultimately, everyone knows Reese’s Pieces are not M&M’s. They’re good, but they’re never going to be competitive with M&M’s.\nDavid: But—at least in my experience; I haven’t been to a movie theater much lately—I believe there is a lasting legacy of this, which is that Reese's Pieces are a mainstay at movie theater concession stands, and it’s all because of this.\nBen: Totally. Maybe the takeaway is actually, M&M’s are a better product, and Reese’s Pieces are this specialty niche product, and that’s why they don’t have the market share. Maybe that this whole postulate is wrong, that marketing can create durable brands, and the reason why all these Snickers, Milky Way, and M&M’s are victorious is because they’re just better products.\nDavid: I think they’re good products, but the nostalgia element is just so huge.\nBen: They’re somewhat commodity products or could have been either product, and then it was about who could create a better lifetime story over the story of your life about the associations you have with that product.\nDavid: I think the candy industry is much like the luxury industry in that once you have an established product and product brand, it is impossible to kill it. You just can’t. All the fumbles that Hershey had for decades and decades, still, today, what is a chocolate bar in America? It’s a Hershey bar. You just can’t kill it.\nBen: That’s so true. Let’s flip back to the Mars side of the world. The associations that they have leaned into with the brands that people love, it’s a very Disney-like playbook that M&M’s has run.\nIn fact, they operate a M&M’s store in Disney World or in Disneyland, I can’t remember which one. They associate it with the holidays. They’ve got that commercial where the two M&M’s characters come into the house, Santa’s just come down the chimney, they run into him at the christmas tree. They do exist.\nDavid: It’s so great.\nBen: It’s a classic. They’ve run it every year for 20 years or something.\nDavid: I think it started in the 90s.\nBen: The Rolling Stones, they’ve associated with Snickers. They had the ‘I can’t get no satisfaction’ ad, obviously the Olympics. I’m looking at my Snickers bar right now. The only other logo on it that is not Snickers is the NFL. They find ways to associate with national or global premier brands that everyone loves, that you have nostalgia for.\nIn fact NASA, they went up on I think it was the space shuttle. NASA can’t obviously endorse it because it’s a government agency, but it’s on the menu, and it’s a part of all the astronaut videos you watch, where they’re popping M&M’s up and having fun trying to chase them around the cabin in zero gravity. It’s been a strategy for Mars to chase known, loved, universal brands.\nDavid: It sounds like we’ve learned a lot here at Acquired from the Mars playbook.\nBen: Yup. Another one just like the innovation on commercials, think about how long they’ve had those computer-generated M&M's characters. I looked it up. The first one I could find was in 1994. Jurassic Park was in 1993, and that was effectively the first use of computer-generated 3D modeling in cinema. Within one year, they were running commercials with those characters. They know how to create these durable marketing franchises and moments.\nIn some ways, it’s actually shocking that they missed ET, given how good they’ve been in all these other facets. Ultimately, the ET thing is a fun story, but did missing it really hurt them? Not really. Not in the long run.\nMy last one around this is in this marketing world. Do you remember in 1995 when they said they were going to do away with the tan M&M's?\nDavid: Yes.\nBen: Do you remember anything about that?\nDavid: Is that when they were replacing it when there was a vote of which color to replace it with a blue one?\nBen: Absolutely. Genius.\nDavid: Total genius.\nBen: They needed to spice it up because basically it was boring. Does it cost them anything, or does it have any impact on their business if they change the color of one to something else? No. Do they actually care what it is? No.\nBut they got millions and millions of Americans to call 1-800-FUNCOLOR, which by the way, I called yesterday, is no longer in service. You call 1-800-FUNCOLOR to vote. They’re giving everyone this vested interest in what the new color is. Blue wins. Blue replaces tan. They lit up the Empire State Building after announcing it was blue with blue. Genius.\nDavid: It’s so great. This is like the Facebook internationalization, where they have local people in each market translate, and then they feel ownership over the product.\nBen: Yes.\nDavid: Totally.\nBen: All right. That’s all I got on their consumer marketing.\nDavid: I’m sure you’ve read too, Mars is constantly rebalancing the ratios of colors in M&M bags to suit current tastes.\nBen: Yes, it’s amazing. Yeah, it’s not even. I was shocked. I was looking at the bag. I’m not going to go count, but apparently it’s a secret what the ratios are.\nDavid: I think they’re adjusting it constantly.\nBen: Interesting. I believe that.\nOkay. Next one I’ve got is be a recession-proof business. I thought candy was the one I was talking about, and the deeper I got into the research, I realized, nope.\nPet food is one too. People don’t stop buying candy when times are bad, and they certainly don’t stop feeding their pets, especially now in this era where we consider pets part of our families. I think the data shows it. If you look back at 2008, neither of their businesses took a hit from being in that recession, and that’s an awesome business to be in if you can get it.\nA corollary to being recession-proof is being universal. A survey done by the Food Institute says that 98% of households buy candy every year. Of those, 97% are recurring purchases at an average of 35 times a year. Again, good, good business if you can get it.\nIt’s just like our Starbucks episode too. Sugar is an addictive habit, so all the research, it seems like sugar is way worse for our bodies than coffee. I’m not at all worried that I’m addicted to coffee. I’m pretty worried that I am addicted to sugar.\nIn fact, I feel pretty crappy after eating all these M&M's and Snickers. I probably ate more than a recommended amount because we’ve been sitting here for 5½ hours doing this. But that’s probably the most concerning thing about the whole business is they’re extremely participatory in the increase of sugar consumption among Americans and around the world, and that it’s very good for their business, at least their original core business, if we eat more sugar. I can see why they’re diversifying away from those core franchises.\nDavid: Into Kind and Kellanova, et cetera.\nBen: More Kind Bars are in my future. Maybe some detox tomorrow.\nDavid: All that said, no matter what happens, I don’t think M&M’s and Snickers are not going anywhere.\nBen: Even if everyone starts taking Ozempic. I don’t actually think chocolate sales are going to fall. In fact, all the numbers show to this point, everybody who’s been saying, oh, people are trying to eat healthier, they’re doing their very best, and they’re changing their habits, chocolate revenues are still at an all-time high.\nDavid: I think this is a good place here in playbook. There are a couple things about chocolate that I want to talk about that are more general than specific to Mars. One is just that chocolate, I’m biased here because I love chocolate.\nBen: Me too, same. I loved doing this episode because I love learning about chocolate.\nDavid: It really is a food. Part of that is marketing and part of that is 100 years of Mars marketing, Hershey’s marketing, and all that. But really, when you were describing the production process of chocolate earlier in the episode, it is one of the most complex, rich foods on the planet.\nBen: When Milton Hershey shut down and got out of the caramels business, he thought caramels is a fad, but chocolate is a complete food.\nDavid: Chocolate is a food, exactly. He was totally right. I don’t think chocolate is going anywhere, and the Ozempic risk for chocolate is way lower.\nBen: Far lower than gummy candies.\nDavid: The other aspect about chocolate, though, and I think here is the right place to talk about it, is the industry and what chocolate is, is changing hugely. I think most people have no idea about this. Both the first and second order effects of climate change are massively changing the chocolate industry.\nThe cacao tree is a very, very sensitive tree. It’s this bizarre plant. I don’t think we talked about this earlier, but the pods, the fruit that have the seeds and beans in them, grow directly on the trunk of the tree. There are no branches. It’s the weirdest thing to look at. It’s like these football size pods that just go right off the trunk of the tree.\nBen: And it’s something like only 25 years of their full 100-and-something year life that they actually can produce the fruit in a way where you can use it to make chocolate.\nDavid: It’s this super, super long lead time to get a tree to the point where it’s productive. It’s a really narrow temperature and climate band that they can be grown in. As both world consumption, thus production of chocolate has increased hugely over the past decades, and climate change is happening, these trees are so sensitive to it. It’s really impacted production. That’s the first order effect on the industry.\nThe arguably as big or bigger is the second order effect of how the industry has responded. There’s been huge efforts over the last couple of decades in genetic engineering and hybridization and breeding of cacao trees to optimize for resiliency, output, and production. All of which is good, ensuring continued production of chocolate.\nBen: As long as it doesn’t come at the expense of taste.\nDavid: Right. That’s the downside. It has not been optimizing for taste, either preservation of the current tastes or just good taste in general. Actually, the taste of chocolate has changed a lot in the last few years as the plants themselves have been engineered and changed a lot.\nBen: To be more resilient and productive.\nDavid: Exactly. A lot of the real, real richness and complexity that has for thousands of years made chocolate a super attractive food for humans, it’s in danger of being lost or being watered down. I will say, the industry is very focused on this. This is an existential, super, super important focus of Mars and the entire chocolate industry.\nBen: That is the correct takeaway. Whenever you talk to people in the industry, this is what they’re talking about.\nAll right. I have got a couple more. The first one is conglomeration and doing it well. They very early on learned how to acquire and conglomerate, how to do acquisitions, which parts to centralize—spoiler alert, very few—which parts to decentralize, actually most of them.\nWhen you are running two completely different businesses and running two completely different geographies from the first five years of your company’s existence, you end up actually developing the muscle to do this well. I think it’s very different from these companies that later in life are like, we’re going to get into XYZ.\nMars has always been a diversified conglomerate. They actually look a lot like LVMH in that they aren’t a private equity firm, they’re a buy and hold. I think they’ve made 30 acquisitions since the 90s, and they’ve only sold two things since 2015. It’s very Bernard Arnault style.\nDavid: They also don’t Rebrand things. They keep the original brands even in the pet hospital business.\nBen: That’s super interesting.\nDavid: You think of anywhere where you would want to centralize the brand. It’s like, no, VCA, Banfield, they’re separate.\nBen: It’s super true. My last one is duration. If you look at them over the last 100 years, they have grown revenue At a compound annual growth rate of 14% for a century.\nDavid: Pretty good.\nBen: The question comes back to, what conditions enable a business to grow like that for that long? It’s global applicability. It’s the margin structure you’re talking about where you can take in commodities and spit out brands. It’s the operational efficiency of doing it. It’s the recurring purchase that has a habitual, if not addictive component to it.\nDavid: It’s the scale economies of being able to achieve and maintain number one dominant market share over many decade long periods?\nBen: Yup. It’s pretty amazing that those things come together in a way that makes it possible to grow at 14% for a century, if executed well.\nDavid: Wild.\nBen: All right, David, we are into the quintessence. Listeners, this is a new thing that we added. As we tried to figure out how to land the plane, what is the big takeaway that we can’t stop thinking about after talking through the whole story of the episode.\nDavid: Great. I’ll go first. A couple of things about this company. One, Forrest Sr. was such a freaking G. Because the company is so private, nobody knows about him, but he should be right up there with Sam Walton, Henry Ford, with the very, very greatest American entrepreneurs of all time. He was truly a genius. I think he probably had a lot of complications and faults in his personal life.\nBen: Which is the same thing as basically everyone we cover on this show.\nDavid: Rockefeller, all of them. Yes. But when it comes to business and entrepreneurial leaders, he’s one of the greatest for sure. Okay, that’s one. That’s not necessarily the quintessence of the company, but I feel like we need to say that just because it’s not like a widely accepted fact.\nBen: Totally.\nDavid: Two though, we have not yet studied Coca-Cola. We haven’t studied Procter and Gamble. With the caveat that those companies and ones like them probably also fit this bill, I think Mars is one of the first modern companies.\nBen: That’s interesting.\nDavid: Everything that Forrest was doing back in the 30s when he was starting was radical, and now are just completely widely accepted. Everything from open office structures to diversification, to getting into pet food, to seeing that dogs and cats were going to become part of families.\nBen: Maximizing yield on equipment for efficiency.\nDavid: Maximizing yield, operating, managing companies in a scientific way, getting into television advertising. All of it, he was really visionary on this stuff. In an era where none of his competitors were doing this, the market research in the positioning that they did with M&M’s taking what essentially was a failed product, and then doing the research to understand who the target consumers were, who the target buyers were, how that was different, and then tailoring marketing messages appropriately for that, way ahead of its time.\nBen: You’re so right. It’s funny. That leads me all to my quintessence of this episode is how path-dependent the outcome was. What I mean by that is, could you do all of the things that Forrest Mars did to create a company like this today? No, you could not.\nIt required being in that place and that time with that technology and that competitive set. This is probably true across all episodes, but it just strikes me in the face right now that he needed to have the chip on his shoulder from the relationship with his dad. He needed the assets that he got from his dad when he went to Europe.\nDavid: Even before that. He wouldn’t have gone to Yale if it weren’t for his dad finally becoming somewhat wealthy. If he hadn’t gone to Yale, he wouldn’t have gotten exposed to the du Ponts. Yes, so many path dependencies here.\nBen: He happened to be an American capitalist competing against British Quaker and British Quaker–inspired competitors. Industrialization and mechanization, the timing of television, commercials, and grocery stores when it did, all of these were brilliant decisions executed within the context of his time, but you needed to be in that time, in that place, and in that specific situation in order to pull any of this off. The question is, how do you do this today with a completely different playbook?\nDavid: You don’t. You build your own company because all of the great companies that we study are their own companies.\nBen: That’s exactly right.\nDavid: Love it.\nBen: All right. Before we get to carveouts, I have one piece of trivia for you.\nDavid: I love trivia.\nBen: You mentioned that the Hershey Trust is responsible for maintaining the Milton Hershey School, which started as a school for orphans and now is a school for students that come from low-income families, need a home, or just need a benefit from what the school provides. David, how big is the endowment of the Milton Hershey School?\nDavid: I think it is by far the largest endowment of a secondary school in America and assuredly the world. I want to say it’s $10 or $15 billion.\nBen: Yup, $17.4 billion dollars.\nDavid: Yeah, for a high school?\nBen: Some younger than that, but the enrollment of the school is 2200 students. The endowment dollars per student, I assume, are the absolute highest anywhere in the world.\nDavid: It is totally incredible. We debated when we first set out to do this episode whether it should be about Mars or Hershey. We ultimately decided on Mars because these days it’s the bigger and more important company, but the Hershey story is freaking wild.\nBen: Milton Hershey gave the whole company to the Hershey Trust.\nDavid: Which operated a school for orphans, like a high school for orphans that owns the company.\nBen: The primary shareholder has a primary purpose, that is to maintain the school.\nDavid: It is a very specific mission to support this school.\nBen: They have a hard time spending all the money. They’re never going to get close to actually spending the endowment dollars or have any risk of spending the endowment dollars. Just think about what 4% of $17 billion is a year and think about what the required budget is to run a 2200-person school.\nDavid: Totally wild. Love it. Okay, carveouts.\nBen: I got three, one we’ve already talked about, Dandelion Chocolate. These people are the best. The factory is so freaking cool, and the chocolate is absolutely amazing. They are a part of the bean-to-bar movement, so they source beans that are not commodity beans. They specifically source single origin beans. They go the extra mile to remove any imperfections. Then in a very craft way, they make some of the best chocolate you’ve ever tasted.\nDavid: It really is like the wine industry.\nBen: I think I speak for you too. We’re both very grateful to Todd, Elaine, and the team there for just taking us through it all and explaining how chocolate is made. It was very cool. If you’re looking for any late holiday gifts or just any good chocolate, I can’t recommend Dandelion enough.\nDavid: You stole one of my carve outs. Dandelion was one of my carveouts, but specifically the Dandelion advent calendar.\nBen: Didn’t you buy that for Jenny?\nDavid: Thanks to our relationship with the company. Yes, I got the opportunity to buy the double, so that Jenny and I can both enjoy every night. Oh my God. This is the single greatest advent calendar that has ever been created in the history of mankind. The artwork, the design, the presentation.\nIf Hermes made an advent calendar with all of the presentation and the objectness, every day is an ornament that can go on the tree. It’s so great. Then the chocolate inside. They partnered with chocolatiers all over the country, I think maybe even internationally all over the world, to just highlight some of the very best talent in the chocolate-making industry globally. Anyway, amazing. Dandelion, they’re so great.\nBen: All right. My second one, I think a while ago, I mentioned I got a Tesla Model Y, which is just an awesome car. It’s just great. I went out the other day, noticed that there was a bolt sticking through the tire that we had driven over, and the tire was flat.\nI opened up the app, and within 90 minutes, there was somebody at my house that was taking off the wheel, throwing it in a truck, putting on a temporary wheel, so I was good to go immediately within 90 minutes.\nTwo days later, it showed back up at my house. They had repaired the issue with the tire, pumped it back up, gave me my wheel back, and took the other wheel. I didn’t have to do anything. I’m just standing there. The whole thing cost me $120. It was the best car service experience I’ve ever had in my life.\nDavid: That’s pretty awesome. It is wild how different Tesla is from other car companies. The Model Y is the best family vehicle ever created by mankind. It’s like the Model T of our generation.\nBen: It totally is.\nDavid: It’s so great. Okay, that’s number two. You got one more?\nBen: Last one. I think last year I carved out Silo. Silo season two is here on Apple TV, and it is excellent.\nDavid: Per usual part for the course for me, I have not watched any of it, but I did read the book, and the book is excellent.\nBen: You read Wool?\nDavid: I read Wool, yup.\nBen: It’s great, though. A lot of times, shows, I think, have a hard time maintaining their season one into momentum into two and two into three, and there’s no problem with that here.\nDavid: Didn’t you get to meet the author a while back?\nBen: Hugh, yeah. He’s great. He’s really great.\nDavid: All right, I had one other besides the Dandelion advent calendar, which is the movie Home Alone. This is a humorous one, but since this is a nostalgic episode about our childhood and the holidays, Home Alone was my very, very, very favorite movie growing up as a kid.\nI saw it in theaters when it came out. I was the perfect age. I think Macaulay Culkin and I are roughly the same age, give or take a year. Loved it so much. After Thanksgiving holiday travel this year, I have a whole new appreciation for that movie, which is the perspective of the parents.\nBen: Did you leave one at home? Did it come close?\nDavid: No, but I almost. I now understand exactly how it could happen. I am excited to watch it again during the holidays this year through the lens of mom and dad.\nBen: Nice.\nDavid: Thanksgiving travel was pretty wild this year. We went back to Pennsylvania to visit my parents. It was exciting on the plane ride there, I’ll put it that way. The most awesome moment, though. This was one of those plane trips as a parent, where the lowest of the lows, shall we say?\nBen: You’re sorry for everyone around you.\nDavid: Sorry for everyone around you, but the most amazing thing happened. We landed after the 5½ hour flight, and a very kind gentleman sitting in the seat directly ahead of my three-year-old daughter who was causing ruckus the whole time and kicking his seat, et cetera, turned around and said, are you David from Acquired? I was like, yes, I’m sorry. He’s like, I’ve been listening to you the whole flight. Then some other people in the row started popping up and being like, oh, I’ve been listening.\nBen: Wait, multiple people were popping up and saying...\nDavid: Yeah, that they listen to Acquired and either had been listening on the flight, or these are their favorite episodes. It turned what was truly one of the lowest lows of my parenting journey into a wonderful memory. Thank you to you all on that flight from SFO to Philadelphia the day before Thanksgiving.\nBen: After watching your daughter kick someone’s seat for five hours, you have to be like, I really hope that guy doesn’t ever know who I am.\nDavid: Yeah. That was my first reaction too. I’m like, oh, no. But no, it turned into the most wonderful turnaround of the day.\nBen: Wow. All right, listeners, with that, a huge thank you to J.P. Morgan Payments, to Crusoe, and to Statsig. You can click the links in the show notes to learn more about some of our favorite companies.\nSpecial shout outs also to Arvind Navaratnam at Worldly Partners for his awesome write up on Mars. There’s way more data in that than we were able to describe on air. If you want to see some great charts and industry stats on chocolate over the years on sugar consumption on Hershey, on Mars, on the whole competitive set, it’s linked in the show notes. I can’t recommend reading through his whole PDF enough.\nDavid: Arvind is so great.\nBen: So great. To Todd at Dandelion Chocolate, as we mentioned.\nDavid: Yes, and also Clara Shen, who works at Dandelion as well, chatted with me, and had a lot of great insights also on the industry and on Mars.\nBen: To Gary Guittard, who I’m sure many of you have eaten Guitard chocolate, either directly by knowing it or indirectly by not knowing it, as they are the chocolate supplier to many excellent chocolate companies around the world.\nDavid: Including the world famous See’s candies.\nBen: Which I didn’t know how much I enjoyed Guittard chocolate. I realized how much of it I’d eaten through See’s.\nDavid: Speaking of trivia, I’ve got one for you related to Guittard. Before Milton Hershey started making chocolate in 1900, there were three chocolate producers in America who predated him. I believe all of which are still operating, making dark chocolate, not milk chocolate, obviously at the time. One of which was Guittard here in San Francisco. Do you know who the two others were? I don’t think you will get the one on the East Coast, but the third was also located here in San Francisco.\nBen: Ghirardelli.\nDavid: Ghirardelli, yup.\nBen: The East Coast, I don’t know.\nDavid: The one on the East Coast was Walter Bakers in Massachusetts, I think.\nBen: Shoot. I did know that, yeah. Bakers’ like the godfather of chocolate in the US, right?\nDavid: I think that’s right. It’s super interesting how two manufacturers popped up here in San Francisco in the 1800s.\nBen: Nice climate for it before air conditioning at least.\nDavid: One more big thank you to say, on multiple fronts, to Joël Glenn Brenner, the author of Emperors of Chocolate and the only journalist ever to get access to Mars, one for just writing the book. We read a lot of business books, business histories here on Acquired, and Emperors of Chocolate is one of the greats. It’s a total page turner.\nAlso, thank you to her for chatting with me as we were preparing. She was very, very helpful in clarifying a few points and getting the story behind the stories. I can’t recommend the book enough. Go check it out.\nBen: Great. If you like this episode, go check out our other episodes on LVMH, Sony, or Berkshire Hathaway if conglomerates are your thing. Or for more complex manufacturing, Novo Nordisk, the makers of Ozempic.\nOr if you want something more recent, check out ACQ2. We just had that awesome conversation with the CEO of Arm Holdings, Rene Haas, if you’re looking for more semiconductors in your life. If you want to discuss it, please come join us at acquired.fm/slack with the other smart, respectful, kind folks there.\nWith that, listeners, happy holidays, and we will see you next time.\nDavid: We’ll see you next time."
}