{
  "url": "https://www.acquired.fm/episodes/microsoft-volume-ii",
  "title": "Microsoft Volume II",
  "heading": "Season 14, Episode 6",
  "date": "July 21, 2024",
  "description": "The Complete History & Strategy of Microsoft\nIn 1999, Microsoft became the most valuable company in the world. And in 2019, Microsoft became the most valuable company in the world, again. But… what happened in the twenty years in between? The answer, as we discovered in our research, is probably not what you think.\nIn this episode we explore and analyze the browser wars and the DOJ case, Windows XP through 8, Surface, Xbox, search, Yahoo!, Bing, the iPhone, Nokia, mobile, social, Facebook… and oh yeah, a little thing called Azure and the enterprise — which ended up becoming so big that no failures mattered. Tune in for Microsoft, Volume II.‍\nChase Center Live Show in SF:",
  "transcript": "Ben: I’m a little hoarse today, so hopefully we don’t have to do a lot of talking\nDavid: Good luck with that.\nBen: All right, let’s do this.\nBen: Welcome to season 14 episode 6, the season finale of Acquired, the podcast about great companies and the stories and playbooks behind them. I’m Ben Gilbert.\nDavid: I’m David Rosenthal.\nBen: And we are your hosts. Well listeners, here we are. Microsoft Volume II, at long last. After the ancient history of Volume I, we now get to the stuff that you grew up with—the Internet, Windows XP, Xbox, the browser, search, and mobile.\nIn this era, Microsoft had a lot of the right ideas with a lot of the wrong timing and execution on everything from the Zoom to Bing. But despite that, from 1995 where we start our story, to 2014 where we will end this episode, Microsoft grew their annual revenue from $6 billion to $80 billion. They became a phenomenally successful company and really cracked the code on selling enterprise software.\nI began the research thinking our part one episode would be about the rise and this episode would be about the fall—cultural problems, failed consumer products, antitrust. But it’s really not that straightforward. After spending months unpacking it all, I actually don’t think that’s the right framing anyway.\nOn Microsoft’s 1998 antitrust suit against the Department of Justice, everyone knows of this case, but most people really have no idea what actually happened. Did Microsoft lose? Well, not really, but the answer is nuanced. Finally, today we dive into it all.\nOh, and listeners, we have just one announcement for you here today. We told you before that September 10th, we are doing the biggest thing in Acquired history, and we’re doing it in the city of San Francisco.\nDavid: We’re doing a live Acquired show at the Chase Center, which is the brand new basketball arena here in San Francisco where the Warriors play. We’re putting it on with our good friends at JP Morgan Payments. As you can imagine, they know a few people at the Chase Center.\nBen: It’ll be a night to remember with a few different phases of the evening. There’s going to be lots of opportunities to meet other Acquired listeners from around the world. A big show like this deserves a big special guest, and that special guest is the one and only Mark Zuckerberg.\nIn addition to being the central figure in some of the greatest acquisitions of all time that we have covered right here on Acquired, Mark and Meta are also playing a big role in defining the next decade of computing with AI too. it’s shaping up to be a total blast. We really hope you can join us.\nDavid: Tickets will be available soon and you can sign up at acquired.fm/sf to get emailed as soon as they go live.\nBen: We’re pumped. We’ll see you there. This show is not investment advice. David and I may have investments in the companies that we discuss. and so do all of you if you own index funds. This show is for informational and entertainment purposes only. Okay, David, the middle chapter of Microsoft.\nDavid: The middle chapter Indeed, and boy is there a lot to discuss. Ben, you covered this in your intro, but I think everybody knows the narrative about what happened to Microsoft between (call it) 1995 and 2014 when Satya took over. There’s even a quote from Satya himself in the very first paragraph of the book that he wrote in 2017 called Hit Refresh, which that title gives it away right there.\nHe writes, “I joined Microsoft in 1992 because I wanted to work for a company filled with people who believed they were on a mission to change the world. But after years of outdistancing all our competitors, something was changing and not for the better. Innovation was being replaced by bureaucracy, teamwork was being replaced by internal politics and we were falling behind.”\nThen he references the famous gun-pointing org chart by cartoonist and software engineer Manu Cornet that probably listeners many of you are familiar with. We will link to that in the show notes. You can sum this whole narrative up as Microsoft was winning, and then it sucked for a long time, and then it is now winning again, and that’s all thanks to Satya.\nThe question we asked as we were doing our research was, is this true? What we ended up learning from the literally dozens and dozens of people that we talked to surprised us a lot. I think we’ll probably surprise listeners too.\nBen: David, you’re burying the lead here a little bit. We talked to probably four to five times as many people as the next highest episode. I’m looking at our little thank you list. It’s like 20-something people long.\nDavid: All right. On the last episode, we left off with the Ben, as you put it, unabashed celebration of software that was the Windows 95 consumer launch in August of 1995. It was perfect. It had everything. It had Jay Leno. It had the Rolling Stones. It had the start button. Or actually, it had almost everything. There was one thing that was missing from Windows 95 at launch, that if you were a consumer user of technology, of software, of products, of operating systems, maybe you wanted to have, and that was an internet browser.\nBen: It’s so funny because we intentionally left all the internet components out of Windows 95 in the previous episode because once you start talking about the Internet, you’re really talking about the next chapter of Microsoft, and you can’t help but dive into it all.\nBut in retrospect, the thing that mattered about Windows 95 all these years later is that’s the platform that everyone started using the Internet on. Everything that we talked about in the last episode, yeah it’s all important, but it’s not nearly as important as it being the internet operating system. How did this come to be?\nDavid: At the time, things were changing so fast. There was this phrase called internet time. Things happened in weeks versus years. But if you rewind just a little bit back to 92, 93, 94, even into early 95, going online for consumers meant using a service like CompuServe or Prodigy or (of course) the big one, AOL. These services were not what we think of today as the Internet, but they were more like walled gardens with proprietary services that were bundled with access via dial-up modems.\nBen: For consumers it was a similar experience. You could get content on your computer, but the main difference was how to put content on that network. It wasn’t like anyone could just plug in a server and then boom, you have a website. It was like you had to have some negotiating power and know someone at AOL to go do a deal to get your content on their platform.\nDavid: I think the best way to sum all this up is do you know who owned the CompuServe service at the time?\nBen: No, but I know it was a Columbus-based company.\nDavid: Oh, interesting. It was owned by H&R Block, the tax prep company.\nBen: Really?\nDavid: Yeah.\nBen: Whoa, crazy.\nDavid: That’s what online was like just a few years or months before the Windows 95 launch. Microsoft, of course, says inheritor of the earth and all things technology, want to play in this online services arena too. In 1993 they start sniffing around AOL and see if maybe Microsoft could acquire AOL.\nSteve Case, the founder of AOL, isn’t interested in selling, but there’s this whole thing where Paul Allen goes off by himself and he buys a large stake and that creates all sorts of headaches because Microsoft is like, well if we can’t buy them, we’re going to compete with them. So they start an internal project called Project Marvel to build their own online service that becomes MSN.\nBen: There’s a little sleight of hand that you just did there. You said it becomes MSN. Marvel, when it initially was conceived, was a proprietary online service. Eventually, when that completely failed, which you’re about to get to, they repurposed the name MSN for their internet-based media property. Complete shift in strategy.\nDavid: At the same time, many people in technology, especially at Microsoft itself and lots and lots of investors on Wall Street, believe that these walled garden online services were just temporary. They were just a bridge to a more utopian networked consumer culture and economy that they called the information superhighway.\nThe specific vision of how this information superhighway utopia was going to work was interactive television, all mediated by the pay television providers like the cable and satellite companies out there, the Comcast, the Charters, the Time Warner Cables, the DirecTV’s on the satellite side. These were going to be the big consumer technology companies.\nThis wasn’t crazy. This actually made a ton of sense because television, and in particular cable television, at the time was the primary existing consumer medium. The Internet was not a thing.\nBen: Well think about the number of things required to create some sort of networked entertainment interactive thing. You would need screens, you would need some way to control those screens to create a feedback and mechanism. You would need content, you would need infrastructure connecting people’s homes. All of those already existed by the cable companies and their endpoints, the televisions.\nIf you pitched me on the idea that actually everyone’s going to go buy a brand new device like a PC, like a computer, and we’re going to have a different set of wires that actually bring all of that to the home, or maybe we’ll repurpose some of the same wires, but gosh, we need to bring in new networking equipment everywhere along the way, oh and there’s going to be completely different content companies that figure out how to create the content, all of that falls flat. Of course you’re going to use all the existing infrastructure and content. You’re not going to bank on standing it all up new from whole cloth.\nDavid: Totally. Microsoft, just like they had done in entering the PC software market in partnership with IBM, they’re going to partner with these big consumer cable companies.\nStarting in the summer of 1993, there are all these rumors flying around that Microsoft is working on a big JV with the cable companies dubbed Cablesoft. You can’t make this up.\nThe idea is that, Ben, like you’re saying, the cable companies will control the pipes and the customer relationships and probably a lot of the content, Microsoft will write the software both for the set top boxes in consumers homes and for the servers on the backend. This software project is code named Tiger. Then there’s a third company, a third piece of this unholy alliance for the information superhighway. That was a company called Silicon Graphics that would make all the hardware.\nCable companies are going to make the hardware themselves. You’re going to need pretty powerful hardware here, both at the home and on the server side, and SGI as Silicon Graphics was referred to was legendary. They are the graphics company that enabled the CGI in Jurassic Park. Of course, their founder and chairman was legendary in Silicon Valley, one Jim Clark. Put a pin in that name.\nBen: So pinned.\nDavid: Wall Street, of course, are nuts over all this. The hype is out of control. It’s a trillion dollar opportunity. There are all these spy shots of Bill meeting with John Malone at TCI and Gerald Levit at Time Warner, and they’ll start spending time with Michael Ovitz talking about how Microsoft can get in on the content game too, either through the MSN project or through other things they’re going to do. This leads to MSNBC, the cable network that people are probably familiar with.\nBen: This is so interesting because we’re talking about this general idea of interactive computing involving other people, and Microsoft so far has two initiatives, Marvel and the information superhighway, neither of which are the Internet or the web browser.\nDavid: Correct.\nBen: You’re already getting this picture of Microsoft’s business strategy, which is until we know exactly what the future looks like, start placing bets that approximate, so that we’re in the mix even though we don’t know exactly what the future is.\nDavid: Which as we talked about in part one had always worked so well for the company. And it’s going to work really well here, too. Bill actually decides at this point that he needs to write a book for the public to evangelize this information superhighway thing. Embarrassingly, given how long the book world takes to actually publish a book, it doesn’t come out until November 1995 after the Netscape IPO has already happened and Windows 95 has shipped.\nIn this book called The Road Ahead—I have two copies of it here on my desk—the hardcover copy and the soft cover copy which was revised and came out in 1996, the hardcover copy is all about the information superhighway, or as Bill likes to call it, information at your fingertips. Then when the soft cover version comes out later, basically they control left every instance of information superhighway and replaced it with the Internet and the web browser.\nBen: This is one of these moments on an Acquired episode where we have just a delightfully concrete illustration of this year it was unclear, the next year it was extremely clear. David look up in the indexes of both of those books, the number of references to the Internet.\nDavid: In the hardcover version, there are three portions of the book where it is discussed. In the softcover version, the index for the Internet takes up an entire page. There needs to be an index for all the sub indexes of the Internet in the soft cover version. Amazing.\nThe hardcover version is the state of play. In January, 1994 when a young Windows networking engineer named James Allard, or Jay as he goes by, writes a memo to Bill Gates and to the senior leadership at Microsoft entitled, Windows: The Next Killer Application on the Internet.\nIn this memo, he points to a new piece of software coming out of the National Center for Supercomputing applications at the University of Illinois that is spreading like wildfire, and appears to be written by some kid programmer there by the name of Marc Andreessen.\nBen: In his free time. It’s not even his real job.\nDavid: Yes, and it is called Mosaic. In this memo, Jay argues that the Internet and this software instantiation of it in the Mosaic web browser, looks like it is going to become an exponential phenomenon given the rate at which it is growing. It represents an enormous opportunity for Microsoft to “embrace and extend” the Internet into Windows itself.\nThis is the origin of the ‘embrace and extend’ mantra. The exact words he uses are ‘embrace, extend, innovate.’ In popular press and public opinion of Microsoft, that would of course get changed to ‘embrace, extend, extinguish.’\nBen: By their effectively competitors and political enemies. But the embrace and extend thing is actually a brilliant business strategy. There are already a whole bunch of people who love this thing. We want to embrace that new behavior.\nThere’s no product/market fit risk because we can clearly already see it happening. People want to use this browser thing to access hypertext on the Internet. We’re going to embrace that and we’re going to figure out a way to work it into our business model to extend the functionality in a way that we can make money on.\nDavid: The business model is we sell Windows through OEMs, to businesses and the like, and to consumers, and we can just bake this into it. Honestly, it’s pretty incredible that Jay lays out the whole winning strategy for Microsoft and the Internet here in January 1994.\nBen: This is a few months before Netscape is even founded.\nDavid: Yes. Netscape as a company does not exist yet. There’s just the Mosaic web browser at the University of Illinois. Then in this exponential growth theme, the very next month in February, 1994, Bill’s technical assistant/shadow, which is a legendary role at Microsoft, now exists at Amazon too, a man named Steven Sinofsky goes on a recruiting trip to his alma mater at Cornell University. While he’s there there’s a big snowstorm. He gets stuck on campus. He has to stay on campus for a few extra days.\nBen: It’s a very Cornell story.\nDavid: Yeah, most Cornell thing ever. The most Ithaca story ever. He notices that all these kids, especially when the campus is snowed in, are all using the Internet. And he knows what the Internet is. It was an academic project for years. He was an academic guy before getting into commercial software and joining Microsoft.\nBen: But it was this way for scientists to basically trade research and you’re starting to get some cool entertainment use cases, but there’s certainly no business or business interest or commercial. It’s all just the way that academics communicate with each other.\nDavid: And this is what absolutely floors Steven. He’s like, I remember the Internet as what you’re saying, Ben. Now, I’m here on campus and all these kids are using it for flirting, registering for classes, messaging each other, sending email that has nothing to do with papers or work or school or academics or anything.\nHe gets so excited that he writes another memo to Bill and the leadership team entitled, Cornell is Wired!\nBen: This is so funny. Microsoft’s history is told through a series of memos, every milestone is some executive publishing a company-wide memo.\nDavid: Well it’s so funny because some of these memos definitely were internal memos for exactly what you say. And some of them were written for publication to the press.\nBill has a great quote. “When I heard Steven talk about what was happening at Cornell, I began to take the Internet quite seriously.” Steven and Bill organize an “internet offsite,” with all the top execs with Jay, Bill, Steven, everybody who’s investigating this internet thing. It takes place on April 5th, 1994, which is the very next day after Netscape was incorporated on April 4th.\nBen: Amazing.\nDavid: At this offsite, Bill totally gets religion that the Internet, as Jay said in his initial memo, is actually an exponential phenomenon. As Bill puts it to the team gathered there and then the whole company later, it is a core Microsoft company value that exponential phenomena cannot be ignored.\nBen: Oh wow. I had no idea that was the impetus of him taking it seriously. Think back to everything we talked about in the last episode. The whole concept of Microsoft is founded on the idea that Moore’s law is a thing and therefore we can develop software that people have never dreamed of that in just a few years will be usable.\nDavid: Speaking of Netscape being incorporated the day before, remember I said to put a pin in the name Jim Clark? Of course, many listeners already know where we’re going here. Jim Clark, legendary founder of SGI, Silicon Valley legend.\nWell, a couple of months before that in February 94—it’s crazy how fast all of this happened; it’s just insane—Jim is still at SGI. He’s really frustrated with the board and the company though for not pushing even harder on this information superhighway opportunity. What does he do? He resigns from the company in protest, the company he founded. On his very last day in February 94 at SGI, he cold emails the kid in Illinois, Marc Andreessen.\nBen: You get the opportunity to team up with an industry legend. Of course.\nDavid: Jim in this email writes, “I’m impressed with Mosaic, and clearly this seems to be getting adoption. If there’s any way that you and I, Marc, might be able to collaborate, that would be ‘of interest to me.’”\nThe two of them get together and then they found this company on April 4th, 1994 called Electric Media. The initial goal of Electric Media, soon to be Netscape, is that oh, Marc is this hotshot programmer. Clearly the information superhighway is what this web is going to turn into. We’re going to do what SGI was supposed to do. We’re going to make set top boxes for the information superhighway.\nBen: In retrospect you, got to be looking at them thinking, how dense are you? Marc Andreessen is the person in the world who understands what a crazy exponential phenomena the Internet is, the web is, what it can be. Marc had (I think) by this point already put the image tag into HTML, so they can now send images that render in browsers. And when Jim Clark emails him, they decide to go do the information superhighway and not to do the Internet.\nDavid: Yeah, this is amazing. The way they’re going to do this as a startup—this is so great—one of the other big things that SGI had done besides building the graphics workstations that Hollywood ran on and did Jurassic Park and all that, was they were Nintendo’s technology partner for the N64. They made the graphics engine for the N64.\nJim has this relationship with Nintendo. The N64 is going to be coming out. It’s going to be this amazing box in the living room attached to TVs in consumers’ homes. They’re going to team up with Nintendo and turn the N64 into an information superhighway box.\nBen: Meanwhile, it’s hilarious that we keep talking about the information superhighway because it never happened. There were these little tests done with cable companies that would wire up 300 houses or something, but it never happened anywhere at any scale.\nWhen you’re listening to this and you keep trying to figure out, like sorry, what exactly was the information superhighway and what did it look like? Nobody knows because it never happened.\nDavid: It’s such a classic case of way, way, way too many cooks in the kitchen and just total slideware.\nBen: And the fact that even Marc himself didn’t pound the table for no, the Internet’s going to be the thing, that really shows you how the human brain is not wired to understand compounding.\nTheoretically, this network should continue to get more nodes. The technology should evolve little by little. Moore’s law is happening on the compute side. There’s some reason to think that bandwidth is going to be available to homes in the same way it’s available to universities and companies. But still it just wasn’t obvious enough to continue down that path. It was almost like great, I’ve made a name for myself doing this toy thing that probably isn’t the future. Now, we’ll go do the big boy stuff because that’s what all the experts are saying.\nDavid: Totally. Shortly after this, by late spring 1984, Mosaic now has a million active users. Clearly Bill Gates is paying attention here. Shortly after all this, Jim Clark and Marc Andreesen say, wait a minute. Let’s just go do this Mosaic thing.\nThey scrap the N64 information superhighway. They go raise money from Kleiner Perkins. John Doerr invest, joins the board, most legendary investor of the time. By October 1994, the newly christened Mosaic Communications Corporation posts the first version of its browser, Mosaic Navigator, for free to download on the web.\nTheir business plan is that they’re going to give away the consumer browser for free, and they’re going to charge companies for server software. If you want to host a website—you’re a corporation or whomever—you need server software to do that. They’re going to charge companies for the server software.\nBen: Great. Listeners, you should be paying attention to something David just said there. He said it’s the Mosaic Corporation and then you said it’s Mosaic Navigator. Even though it’s called Mosaic, because Marc Andreessen wanted to draft off the success of the previous project he had done called Mosaic, this is completely new code. They founded a company, they started writing code from scratch. They had the experience of writing Mosaic, the thing owned by the university and the NCSA before. This is a new thing called Mosaic that does the same thing architected for commercial use.\nDavid: Exactly Ben. Meanwhile, back at the University of Illinois, even though they’re academic and government institution here, they realize that they’ve got something valuable in the original Mosaic.\nBen: The pilot code, millions of users. Marc doesn’t work there anymore, but it seems to be working.\nDavid: They license their Mosaic, the original one, to a local company called Spyglass.\nBen: The state of play is you’ve got the old Mosaic which Spyglass has the right to license for commercial use, you have a new thing that will become Netscape called Mosaic that is totally separate code, and Marc Andreessen’s new Mosaic keeps trying to go do deals like sell their server software. Every time they’d find a customer, Spyglass threaten to sue. They basically blow up the deal because they keep calling each customer and saying, yeah, we’re going to sue.\nThis is obviously very frustrating and technically illegal. Marc Andreessen’s Mosaic realizes that this is going to be an existential problem for them unless they do something about it. They actually sue Spyglass. You guys got to stop. So there is a settlement.\nDavid: Well, the net of all of this is that Marc and Jim’s company—let’s call it that—changes its name in the fall of 1994 to Netscape. Marc had a typically great Marc quote about this to the press at the time. “You go to school, you do your research, you leave, and then they try and cripple your business. Had I known this would happen, I would’ve gone to Stanford.”\nBen: Which of course is apocryphal because he had no means of going to Stanford at the time. He lived in the Midwest. He was going to go to a state school. No one recognized his genius yet at the time.\nDavid: It’s also the best Marc Andreessen quote ever, which is awesome. Meanwhile, remember the online services—the Compuserves, Prodigy, AOL, et cetera? They’re not blind. They see that the Internet and the web is also becoming a thing. They want to go license a web browser and incorporate it into their platform.\nBen: I think it was late 93 or early 94, but this was a seminal moment where the AOLs of the world interconnected with the Internet. Now, you could not just navigate the proprietary services but also surf the open web.\nDavid: Netscape isn’t interested in licensing because they have their own business model selling web server software and they want to allow free downloads of the navigator client. Spyglass, though, they start licensing that original Mosaic, and they start doing deals with the online service providers. A small startup company called BookLink goes and codes up another browser that they start licensing to companies as well.\nBill Gates and Steven Sinofsky go and meet with BookLink in May of 1994. Coming right off of this internet retreat, we’re going to make this a core part of Microsoft and a core part of Windows. They’re interested in licensing BookLink as well. They start negotiating, they’re talking about (call it) a $2 million license deal, and all of a sudden AOL comes in and buys the whole company of BookLink for $30 million.\nThis now leaves Microsoft without a browser. There are basically only three real browsers on the market. There’s BookLink that AOL just bought, there’s…\nBen: Netscape Navigator, which is not available to license.\nDavid: And then there’s Mosaic and Spyglass. Microsoft goes to who else? Spyglass. They license the source code for Marc Andreessen’s original Mosaic browser from Spyglass Software for $2 million. That code base becomes the base upon which Microsoft builds Internet Explorer.\nBen: Well David, I’m glad you took the bait. I am here to tell you that that is the public narrative and very close to the truth. But there’s some more nuance here. You ready to hear it?\nDavid: Well hey, if you click the about menu in the early versions of Internet Explorer, a text box pops up that says, based on NCSA Mosaic, distributed under a licensing agreement with Spyglass Inc.\nBen: Yes. All of that technically true. It is just not quite as meaningful as you think it is. As with all of these things, it’s not just like Bill Gates and Steven Sinofsky are having a think, and the rest of Microsoft is sitting around waiting for the think to finish, and then an edict comes down and then they go and do the work. There are a lot of people with a lot of ideas working on a lot of stuff in parallel.\nThat is why Microsoft’s history is so delightfully messy, is there are a zillion initiatives going on and it’s never clear if your thing is going to become the next company strategy or not. Here is a slightly different version of this history with different players, and I want to underscore it for one big reason. It will come up later in antitrust.\nDavid: Okay.\nBen: Some of the Windows 95 team in late 94 led by Thomas Reardon, is pulled off before it ships to start thinking about what should we do after Windows 95 ships? What would the next marquee investments be for what at the time they’re calling Windows 97, which of course there was never a Windows 97.\nThe group’s opinion is all internet all the time. How could the next iteration of Windows be extremely internet-native in a very embedded way? There are tons of proposals in this little group. There’s virtual meeting software, think Zoom-type things. There’s an email client specifically built for the Internet rather than for your company’s corporate network, which at the time was novel. Then there’s of course a browser.\nBut the big vision was what if the whole Windows Shell is a browser? Every visual thing that you interact with in Windows, what if that actually was an HTML-rendered server communicating online thing?\nThe team technically looked at it this way. We should build HTTP directly into the operating system since it was just another protocol on top of the TCP/IP protocol that the Internet is based on. We should provide reusable UI component to any application that wants to display HTML. That’s a good engineering building block to build, is this HTML renderer that any application can frame in and use.\nOf course, Microsoft, the strategy here is we will develop a browser application that used the building block that others could also use to render HTML. They actually go to Netscape and say, hey, we have this great HTTP stack, we have the HTML engine, we have these wrappers to go around it. Instead of rewriting all of it, just use our off-the-shelf code that we intend to ship with Windows.\nFamously, Netscape did not do that. IE (Internet Explorer) actually ends up being the only application that used all these Windows components. Once they got going on the browser, they convinced the Windows leadership that actually we can do this fast, we should get this done as a part of Windows 95, not wait for the next big release.\nDavid: We’re going to get to this in a minute, but when Windows 95 launched, it had either at launch or very shortly thereafter, what was called the plus pack. Internet Explorer was available as part of the plus pack.\nBen: Yes. Anyway, how does NCSA Mosaic and Spyglass come into this? Well, the nuance is Spyglass had actually massively changed the Mosaic code. They were trying to create the Spyglass browser that was based on this NCSA code base, but it wasn’t very good.\nThat is what Microsoft was able to get their hands on. They could not license the original NCSA version. That was gone, or at least not available for license. They tried backing out a lot of the Spyglass stuff. Ultimately, it wasn’t that helpful in creating Internet Explorer, and they spent just as much time trying to undo a lot of it, and then build the Internet Explorer stuff on top.\nUltimately, did it actually accelerate their path to market? And was it actually Marc Andreessen’s code? Some of it was in there, but it’s not like they grabbed it off the shelf and now it’s IE.\nDavid: It makes for such a good story, though. It sounds like reality is a lot like the DOS acquisition. Yes, Microsoft bought QDOS (Quick and Dirty Operating System) from Seattle Computer Products. Was that the same thing as Microsoft DOS? Sort of.\nBen: A lot of work went into it after the deal.\nDavid: As you would expect, same thing here. But it is definitely true that if you click that about box in the early versions of Internet Explorer…\nBen: David’s holden to it.\nDavid: It’s just so delicious.\nBen: It is delicious. The two vague takeaways here, at least from this additional version of the story is: (1) what they actually wanted to do was make Windows web-enabled in a really deep, integrated way, not just have this one little application called a browser. Technically there was a lot of co-mingling there. A lot of what became the code underpinning Internet Explorer was actually Windows code implemented in Windows operating system to do these protocols. And (2) still a lot of work to make IE after the deal.\nDavid: This brings us now to the launch preparations for Windows 95. In the spring leading up to all this, Bill writes another memo. This one intended for publication, so to speak. That is the famous Internet Tidal Wave memo. I just want to do a big quote from it here.\n“Perhaps you have already seen memos from me or others here about the importance of the Internet. I have gone through several stages of increasing my views of its importance. Now, I assign the Internet the highest level of importance. In this memo, I want to make clear that our focus on the Internet is crucial to every part of our business. The Internet is the most important single development to come along since the IBM PC was introduced in 1981. It is even more important than the arrival of the graphical user interface.” Can’t get any more clear than that.\nBen: Very clear.\nDavid: That brings us to the August 95 Windows 95 launch scheduled for the 24th. On August 9th, a couple of weeks beforehand, Netscape goes public with a market capitalization of $3 billion.\nBen: Massive IPO.\nDavid: Massive. This is 1995 we’re talking about.\nBen: Netscape, we should say, goes from 1 million to 15 million users in one year. Just instant product/market fit. It was so clear that people wanted to browse the web. A lot of the time in technology in this ecosystem, we’re always looking around like, hey, is that going to become a thing? Is that going to become a thing? That was from 1994 onward, never a question about the Internet.\nDavid: Never, yeah. In the IPO press cycle, Marc Andreessen is quoted as saying that “Netscape will soon reduce Windows to a poorly debugged set of device drivers.”\nBen: It’s such a good quote, and there’s so much behind it too. If you really dwell in that quote, what does it mean? If one of the things he’s saying is Windows is a platform upon which independent software vendors write applications, Windows is the way that currently people write software for businesses and consumers to use.\nIf we are going to reduce Windows to a poorly debugged set of device drivers, what I’m implying is that these crappy static web pages that get served right now, is merely a step on our journey to enabling rich web applications. Think JavaScript, CSS, eventually Java and Flash. The web will be a way that developers write their applications. That’s right there implicit in the quote.\nWhen they’re saying, we’re going to reduce Windows blah-blah-blah, it’s saying, okay, Windows has all this stuff right now for developers, but essentially you’re going to use Windows or any operating system just to boot it up, connect to all your peripherals—your screen, your mouse, your keyboard and everything—you’ll open your browser, and you’ll do everything through the browser.\nThat scared the hell out of Microsoft. Not specifically this quote, but Microsoft had come to the same conclusion too of, oh my God, if the web becomes the platform of the future, all the reasons why we have all this incredible business, people feeling the need to use our operating system to be able to get access to their favorite software, and for developers to build applications on our platform to get access to the users, that could go away.\nIn the same memo that you were quoting earlier, the Internet Tidal Wave, Bill Gates famously says, and when I say famously, it’s because the Department of Justice later grabbed this quote and used it as a exhibit, Bill writes, “A new competitor born on the Internet is Netscape. Their browser is dominant with a 70% usage share, allowing them to determine which network extensions will catch on. They are pursuing a multi-platform strategy where they move the key API,” the application programming interface, “into the client to commoditize the underlying operating system.”\nThey got it immediately. The web is an application platform that completely reduces our value.\nDavid: You can see why it was so important to Microsoft to beat Netscape, to bring the Internet in the form of Internet Explorer into Windows, and have Windows maintain its role as the dominant platform. All this stuff will cut off their air supply. It was existential.\nBen: And how amazing is this? It’s an application platform of the future that is distributed as a Windows app. Windows had huge market share at this point. I don’t know, 80%–90%. Eventually over 90% market share. The way that Netscape could get to consumers was because Microsoft had all these computers out there running Windows. It was this ultimate Trojan horse that they could build the platform of the future through Microsoft.\nDavid: Yup. Windows 95 launches a couple of weeks after the Netscape IPO. Internet Explorer is not baked in, at least not in the retail box version. You can buy it for $50 as part of the Plus pack that I was referencing before. Install that and add it into Windows, and Microsoft will make money on the sale of that software. But that, of course, does nothing to make a dent in the free version of Netscape Navigator that is out there.\nBen: If Microsoft’s goal is to cut off the air supply, David, as you already quoted of Netscape, the goal is ubiquity instantly. We don’t care about making money. We just need to get this thing out, so the Internet doesn’t kneecap our business. We can embrace and control it, or perhaps embrace and extend it.\nDavid: Netscape run continues. The Netscape stock triples over September, October, November. Netscape is now a $10 billion public company. Insane.\nBen: I don’t think making very much money on their server software yet. All the market cap creation is attributable to people believing they have the dominant platform of the future and not based on their current financials.\nDavid: Basically all of the hype train that had been behind the information superhighway has now completely poured it over to Netscape.\nBen: That’s true. What’s our tracker for the Internet? Netscape, everybody pile in.\nDavid: I could make an analogy to today, but I’m going to spare us all.\nBen: Make this episode timeless, David.\nDavid: I’m going to make the episode timeless. Okay. Then on December 7th, 1995, Bill Gates announces that Internet Explorer is now free and it will be bundled in with every single copy of Windows 95 going forward. On that day, Netscape stock drops by about a third and never recovers. That was the high watermark for Netscape. It’s over after that.\nBen: And for good reason. There’s a very difficult to learn lesson, but you learn it once, you never forget it. If your distribution decides to compete with you and decides to make that a priority, your business is over in a minute.\nDavid: That’s exactly what happened. This is now the march of Internet Explorer. It doesn’t happen overnight, but it’s inevitable. By the end of the next year in 1996, Microsoft has now done deals with AOL, CompuServe, and Prodigy, all the old online services, to ditch whatever browsers they were using and bundle in Internet Explorer.\nBy the end of that year in 96, Internet Explorer passes 20% market share. 97, it passes 40% market share. 98, it passes 60% market share. Then by the year 2000 Internet Explorer basically has, for all intents and purposes, 100% worldwide browser market share.\nIf you look at the Internet Explorer market share chart over time, it is the most perfectly rounded hill that you will ever see. It goes from 0 in 95 to 100 in 2000, and then all the way back down to 0 in 2010.\nBen: Which is the next chapter of this story, is how on earth did they lose that monopoly that they had in the browser? But before that, there’s this interesting moment of reflection here. Why did Netscape business dry up? Because their business was made from selling server software.\nWell, the way to have the best server software is to also control the client. People are very interested in making sure that their websites run perfectly using the experience that everyone has. When you can no longer claim, hey, a whole bunch of internet users actually use our browser, do I really want to buy my server software from you? Or should I just be open to buying it from anyone that it’s the lowest cost and the best value with the most features, all that. They lose the competitive edge in the revenue side of the company.\nOn top of that, it’s just really hard to recover for companies that have a 80% drawdown or whatever in their stock price. There was a lot of excitement around the company that then goes away. Suddenly, all these employees are under compensated. It’s a company-killing event.\nDavid: And all the market cap and excitement was all on the come. It wasn’t because of the revenue.\nBen: To this point, Microsoft has not changed their business model. They simply vanquished a potential future that was dangerous for them. They’re still doing the same thing as ever selling Windows licenses through OEMs and to consumers at retail.\nDavid: There are a couple of more fun little tidbits from this era. In August 1997 is when the famous Macworld happens where Steve Jobs returns to the company. Bill Gates shows up on the satellite feed, and of course this moment is legendary. But studying it from this lens, I realized there’s this whole other aspect to it that I didn’t know before.\nWhat Bill and Steve announced on stage, it’s also so telling that Bill couldn’t even be there in person, he joins by satellite. There are four points to the partnership. One is the $150 million investment from Microsoft and Apple. Two is the five year commitment on the part of Microsoft to ship Office for Mac. Those are the big ones that everybody talks about.\nBen: Which by the way, saved Apple. The company would’ve been completely out of business because it was so existentially important to anyone using an Apple computer to use Office, that if Microsoft decides, oh, we’re going to stop developing Office, people stop buying Macs. The company’s already in such a tenuous financial position, it’s just over.\nDavid: The third deal point was they agree to end all patent disputes. This is the end of all the back-and-forth that we talked about in part one. But then the fourth point, which I didn’t even remember at all, was that Internet Explorer would become the default browser on the Mac, displacing Netscape. That continued from 1997 until 2003 when Safari became the default browser on Mac.\nBen: Oh, don’t I know it?\nDavid: And knowing this now and knowing the headspace that Bill was in, I got to imagine that’s the reason he did the deal.\nBen: Well it’s funny. I actually do have some color on why he did the deal. Steve Jobs wanted to message this as Microsoft believes in the Mac as a great way to use the Office Suite. They believe in us as a company, so they’re investing $150 million in making this commitment to help us get through this difficult time. This money, by the way, just to help people understand, Apple was worth about $2 billion at the time. This is Microsoft buying 8% of Apple.\nDavid: Wow.\nBen: Steve cleverly identified this moment as a time to call Microsoft and say, hey, I know we’re through all the patent issues, that big lawsuit. I have more. I think you guys are using some of our stuff. I don’t want to sue you. I know the DOJ is looking at you guys for antitrust right now.\nApple was aware that Microsoft would be interested in appearing collaborative with another major player in the ecosystem. We have the leverage to say, hey, what if you guys invested in us and did this big commitment to Office for Mac? It’s super important to help us get through this difficult time. Microsoft said back, well, it’s really important to us to have IE everywhere.\nThey rolled it all into one big deal. No one’s going to sue anyone, all the IP is cross-licensed, Microsoft gets the win with IE, Apple gets the win with the investment in Office, and we can all walk away.\nDavid: Interesting.\nBen: Apple is saved. Truly, Apple would’ve gone out of business had Steve Jobs not seized this opportunity.\nDavid: It was a critical business deal for both of them. To close the book on Netscape in November, 1998, AOL acquires Netscape in an all stock deal for just over $4 billion. But again, all stock, and this is just a little over a year before the Time Warner merger.\nThis moment here is just the absolute peak of Microsoft as a consumer technology company. I think maybe the absolute peak of any consumer technology company ever. Think about the market power that Microsoft has at this point in time.\nApple has an existential reliance upon them. They have completely crushed Netscape, “cut off the air supply.” There’s nobody else. There is nothing else except Microsoft.\nBen: Google is three years from being founded. Facebook is nine years from being founded.\nDavid: There’s Yahoo, sure.\nBen: There’s real competition in the enterprise at this point—Sun, Oracle. But in terms of what your point is, the consumer technology landscape, yeah, they had ultimate power.\nBut David, I don’t know. The whole thing of you can just decide to, and then you completely vanquish your biggest existential threat by cutting off their air supply. Shouldn’t that be illegal?\nDavid: Well…\nBen: To lead you a little bit into our next section. Well listeners, I think you know what is coming next based on David and I coyly alluding to it. But before we get there, we’ve really been talking about this idea of development platforms. We were talking about the web as a potential development platform of the future, even as far back as 1994 people building web applications, or Windows 95 and its hating. But what makes four a great development platform?\nWell, this is a great time to thank our friends at JP Morgan Payments, to talk about their developer platform. To build a great one, it requires a culture focused on empowering others and investing with a long time horizon. JP Morgan Payments knows this well.\nWe’ve talked about how they’re much more than a global bank. They’re now investing $17 billion a year in technology and R&D. But you may not know that they’ve also been investing heavily in their developer ecosystem. Over the last year, they’ve really embraced this dev-first mentality with their API-powered payment solutions.\nDavid: If you zoom out, it’s clear that traditional finance folks aren’t the only decision makers anymore. It’s also your developers, your engineers, your product managers, and so on, who now have a seat at the table when it comes to finding the best payments platform for your company.\nMany of these modern digital first categories like ride sharing, e-commerce, or travel couldn’t exist without smooth and seamless payments built into the product experience natively.\nBen: We know that many of you listening are developers who will be excited to learn about JP Morgan’s new payments developer portal, that’s essentially a one-stop shop to build solutions for your business on top of their trusted and scaled platforms.\nWhile this is just a first step in a long journey for their developer portal, JP Morgan is really taking a long view in investing for the future, working hand in hand with their clients, dev teams, beta testers, and payment industry experts to launch, learn, and iterate.\nThey’ve got a robust end-to-end roadmap of payment APIs coming in the future across treasury, commerce, embedded finance, and even value added services like account validation that are going to be truly unique in the industry.\nDavid: Anyone can make an account to create projects, collaborate with team members, generate access tokens, and try out payment APIs that help accept, manage, or send payments in a sandbox environment.\nBen: Which is great. I can speak from my past experience as a developer that it is very nice when your head’s down, you can just use self-serve, well-documented APIs and code samples. I actually read through the Quick Start guide and thought it was very easy to follow.\nDavid: With JP Morgan, you get to rely on their experience and security so you can focus on your core functionality. This season we’ve talked a lot about how they’ve been powering secure innovation with an ecosystem of payment solutions trusted by some of the world’s largest and most innovative companies.\nBen: Not to mention 200 years of banking experience. Your payments just work the first and every time. You get security in huge scale. We’ve said it before, JP Morgan moves $10 trillion a day. Over 50% of all e-commerce transactions in the United States pass through their platform.\nWe encourage you to learn more about their API-powered solutions built for developers at jpmorgan.com/acquired, and let us know if you’ve tested out their new payments developer portal in the Slack. If any listeners are heading to FinTech devcon in August, you’ll be able to learn more about all of this directly from their team.\nOkay, David. We’ve arrived. The famous 1998 Microsoft versus the US Department of Justice antitrust trial.\nDavid: I was thinking about it in the transition at the end of the browser wars there.\nBen: Oh, you didn’t like my snarky comment?\nDavid: Well, we were being glib about like, oh, this should be illegal. That’s really the question here. All that power that Microsoft had had probably never been concentrated in the hands of one company like that and probably never will be again. The question is, was that illegal and did Microsoft do anything wrong?\nBen: We’re getting into a whole bunch of very interesting questions here, and I asked it exactly to pop open the can of worms. But there’s the question of what actually is legal in the US? What actually is legal in the EU?\nThen there’s this interesting question emotionally for everyone who is working on software at Microsoft. The vast, vast majority of people are not really focused on what is the business and competitive strategy. Most people who worked on any of this stuff, their whole goal was, I want to ship great software and make things that people love to use, and I want to work with people that I love making it with.\nIf you ask most people who worked on any of this, their opinion is, I don’t know. We were trying to just make the best software out there. Which is very interesting to square with this growing public perception that Microsoft is being a bully, especially public generated by their competitors. Then the literal legal question of did they do something illegal, because the actual antitrust laws are a super different thing than, ooh, does this feel anti-competitive in some way to me?\nDavid: And then there’s the other dimension too of, as a consumer, am I unhappy that I get a world-class web browser included in my operating system?\nBen: Well, David, now you’re cracking open the issue of consumer harm, the consumer welfare standard that the whole thing is based on. Take us into the story.\nDavid: The Microsoft Antitrust saga actually started not with the Department of Justice, and not in 1998, but with the Federal Trade Commission (the FTC), all the way back in 1990 when they opened an investigation into the company about whether it was violating antitrust laws.\nBen: This centered on the notion of per processor licensing, which we discussed in our last Microsoft episode.\nDavid: In July 1993, the FTC commissioners vote on whether Microsoft is a monopoly that deserves further action and penalties. They deadlock at 2:2, which means essentially a win for Microsoft. No action would be taken against the company. This is a huge victory. The antitrust case of the US Federal government against Microsoft should be closed at this point in time.\nBen: Yup, because theoretically, they could have examined any monopolistic practice at this point. They said just the one narrow thing that we were worried about, they agreed to stop doing. We in voting 2:2, we see no other issues that we need to investigate.\nDavid: Microsoft, you are good as far as the US federal government is concerned. However, the very next month, in August 1993, the Department of Justice picks up the case, which is pretty unprecedented.\nOne department in the US Federal government essentially investigates a company about whether it is abusing its monopoly power, declines to prosecute them for it, then another department within the federal government, the very next month says essentially, well, we don’t think you did it right. We’re going to do it. Microsoft is now all of a sudden basically standing trial for the same accused crimes twice.\nBen: Theoretically, double jeopardy is not a thing.\nDavid: In fact, several members of the FTC commission opposed this whole process and tried to refuse to turn over their notes to the Justice Department. But nonetheless, the DOJ proceeds, and the next year in July 1994, Microsoft just settles with them rather than going to trial.\nThey’re like, all right, look. We just want to be done. We are going to settle with you DOJ. We’re going to be done with the US federal government here. In that settlement, they agree to enter into what folks may know, the famous words, a consent decree.\nThat means they consent in this case, that they are not going to tie the sale of Microsoft application products to the sale of Windows. Meaning they can’t say like, hey OEMs or businesses or consumers or whoever, if you’re buying Windows, you have to also buy Office or X or whatever else that we’re selling in our applications group.\nImportantly, as part of the consent decree, they remain free and clear Microsoft does to integrate additional features into the Windows operating system. Which brings us right back to Internet Explorer. Is it a product or is it a feature?\nBen: Exactly. This is so messy because I think, David, you just used the exact language, which is they cannot tie these application products in a bundled sale. However, they absolutely can integrate new features.\nDavid: Yes. What is Internet Explorer?\nBen: And this also looks the other way at the whole idea of software development and platforms, which is, it is a continuously changing landscape, where over time in the interest of users, platforms do more and more and more things that applications used to do. The whole notion that they’re going to write that sentence and then call it good, what is an application today might be a feature years down the line, but the law is written and we have to pay attention to that sentence constantly reevaluated in the context of the current time.\nDavid: Today, could you imagine purchasing a device that has an operating system and that device not having an internet browser as part of the core system? No, you can’t even imagine that. Of course it’s a feature.\nBen: Well, is it a feature? It’s actually literally an application. It is a bundled application as it exists today. This is the gray area.\nDavid: This is the gray area. Look, if you ask Bill and Microsoft and Jay Allard all the way back to the original memo, it was absolutely intended to be a core feature of the Windows operating system, having an internet browser as part of it.\nBen: Clearly motivated by the idea that we want our Windows platform to maintain the power it enjoys from its monopoly market share. There’s this sympathetic view for sure of, hey, this is core functionality to an operating system, whether it’s a feature or an application that we bundle. Also, clearly the reason you are incentivized to ship your own browser is to cut off the air supply of potential competitors that develop the platform of the future.\nDavid: So in October, 1997, the Justice Department files a motion in federal District Court stating that by bundling Internet Explorer with Windows, Microsoft has now violated the 1994 consent decree against product tying.\nBen: It’s important to know what they’re basically asking is, this is not about future versions. We know you’re doing some Windows 98 thing. We’re saying right now, stop shipping IE bundled into windows.\nMicrosoft insists this is an integrated product. You cannot do that. It’s not even necessarily a legal argument yet of we’re allowed to do this because it’s an integrated feature. They’re saying we ship a pile of code and you actually cannot just rip out Explorer.\nIf you remember at this time, you could do all sorts of crazy stuff. You could paste a web address in Windows Explorer and it would render even though it wasn’t Internet Explorer. If you think back to that vision of the browser is integrated into the Windows shell and it happened, a browser, at least Internet Explorer, was not really its own standalone thing. It was deeply integrated. Now could they have pulled it apart as a different question if they really wanted to.\nDavid: Also, remember. The fact pattern here isn’t exactly great for Microsoft of, well they did ship Windows 95 without Internet Explorer right in the beginning, so…\nBen: Right. The federal judge, Thomas Penfield Jackson, orders them to do it anyway. Or more specifically, he ordered Microsoft to ship a version of Windows to the PC makers, the OEMs (original equipment manufacturers) that didn’t include IE, so that those OEMs could load those onto the PCs that they were going to ship to customers if they wanted to.\nMicrosoft said, we told you we can’t do that, but you’re a judge and you’re ordering us to, so they do and surprise, surprise, when you just disable a bunch of code that other code depends on, it doesn’t work.\nThen, of course, two things happened. Judge Jackson is not pleased since it appears Microsoft is complying with the letter of the law but violating the spirit, thumbing its nose and being arrogant. That’s thing one. Thing two is obviously the PC makers don’t actually ship this version of Windows, so it never sees the light of day. Things get real petty real fast. The DOJ asks the court to hold Microsoft in contempt.\nDavid: Yup, whole bunch of back and forth. Microsoft appeals Judge Jackson’s order, and in early May 1998, the appellate court rules that Microsoft can continue shipping Windows with IE bundled into it, and also continue to bundle any other features that they want as part of Windows as long as it benefits consumers.\nBen: This is interesting because this is when it really hammers home the idea of what we, the US courts care about is consumer welfare. We haven’t explored the idea of if Microsoft is a monopoly or not, yet, but for now what we are saying is as long as what they are doing is in the consumer best interest, they’re not causing harm, they’re not raising prices, then it’s okay.\nDavid: One week later on May 18th, 1998, the DOJ announces a brand new, enormous, wide-ranging antitrust lawsuit against Microsoft for violating the Sherman Antitrust Act and abusing its monopoly power to suppress competition.\nBen: And this investigation is way bigger than just, is it okay if they tie Internet Explorer with the shipment of Windows? This is: (a) is the company a monopoly, and (b) are they doing anything across their entire business to abuse that monopoly power in the disinterest of consumers?\nDavid: It is not necessarily illegal to be a monopoly. It is illegal to abuse your monopoly power. This court is examining both of those questions. (1) Is Microsoft a monopoly? (2) Are they abusing their power? This is really bad for Microsoft.\nBen: Really bad and it’s worth decoupling. Did they do anything wrong from just legal strategy by holding a very firm line early of we’re appealing this decision, we couldn’t possibly be doing anything wrong here. Microsoft is starting to take this super aggressive stance and the Department of Justice is then like, wait, you didn’t give an inch? You’re not open to just this one thing. The tying of Internet Explorer and Windows? Okay, we’re going to look at everything.\nDavid: You can see how it goads them into like okay, we’re going to bring the big lawsuit. But this whole suit, you can also see from Microsoft’s perspective a feeling of betrayal by their government. This is the third time we are being tried for what feels like the same crime. Ben, you said double jeopardy isn’t a thing earlier. What is this, triple jeopardy? Come on. I thought this was supposed to be a free country where we can build businesses. What the hell?\nBen: Microsoft folks at the time too are starting to get this inkling of why are they doing this? Are consumers really mad at us? Who’s being helped here? And they’re starting to realize there is a lot of lobbying going on behind the scenes of Netscape and everyone else we’re competing against trying to find a way to call us anti-competitive. Which we should say is always true in these big antitrust lawsuits. But that was certainly happening in this one.\nDavid: For all these reasons, including Ben as you say, the legal strategy they started with in the first place of we’re going to fight everything, they say, all right. We’re fighting this. We’re going to fight it hard. Ben, you talked to a lot of people here. Take us through what happens in this big trial through the fall of 98 and into 99.\nBen: The first question that everyone is wondering is, did Microsoft have a monopoly here? Well the fact is that they had over 90% of PC operating system sales. I’m not a judge, but at first glance there you think like, okay they have market power.\nIn August of 1998, Judge Jackson issues a pretrial order that all depositions shall be submitted during the trial only in transcript form. For folks who aren’t in this world or looked at lawsuits before, a deposition is when the council goes and does a bunch of interviews beforehand. You’re not being called as a witness in the trial, but it’s basically information gathering.\nDavid: Interview process.\nBen: Yes. On August 27th, Bill Gates is deposed by the DOJs appointed prosecutor, David Boies, for 20 hours. I think this happens over multiple days, actually on YouTube, which is interesting to note, you can watch 12 of the 20 hours. I think I’ve watched eight or nine of it, but it’s just hours and hours and hours of—\nDavid: Just some light bedtime viewing.\nBen: Of Bill Gates being asked questions. The strategy that Gates and the Microsoft legal team used was one that was tailored for this pretrial ruling. If you watch the video, you can see that the strategy is essentially never give an inch, avoid saying anything that can be used against you. Microsoft walked out of it feeling like they were pretty successful in this.\nDavid: And when you say tailored for the pretrial ruling, you mean tailored with the assumption that this is only going to be delivered as a written transcript? Right. There will be no video, no recording of these depositions.\nBen: And yet I just watched the video on YouTube, so what’s going on here?\nDavid: How did that happen?\nBen: If you’re watching the video, though, it’s very easy to think this guy is rude, pedantic, and disrespectful. I’m not out on a limb saying that opinion. If anybody watches this video, that is just the obvious takeaway.\nDavid: At a certain point, they argue over the definition of definition, is that right?\nBen: Yes. A couple of examples—I’m not exaggerating here—the deposition really does come across as just showing pure disdain for the prosecutor and the questions he’s asking. Bill Gates rat holes on things like refusing to answer questions about memorandums since they were not memos but emails. I couldn’t possibly answer you on the question about the memorandum.\nAt one point he does look at David Boies and ask him how he would define the word definition, of course, while smirking the whole time. The whole thing is very obviously tailored with this idea that I’m going to give you pages and pages and pages of which you will have nothing that can be used against me.\nThat is the whole strategy. I don’t care how I come across, I don’t care how ticky-tacky the language is. He sits and pauses forever. He’ll say, well you asked me what the person who sent this was referring to. How should I know what they’re referring to? I didn’t write the email. You’d have to ask them. I don’t know. It’s 20 hours of this.\nWell somehow—I actually don’t really know how this happened—after the deposition is recorded on October 9th, the judge then issued a reversal saying that videotaped depositions are indeed allowed to be used in court.\nDavid: Oof.\nBen: Yeah.\nDavid: How did this hold up?\nBen: And if you give a great prosecutor like David Boies this opportunity, he uses it masterfully. Throughout the trial, he’d show little clips at strategic moments in the trial where he either wanted to give the press something juicy to write about that day, because there’s a whole press section in the back going and listening to all the witnesses every single day. Or he would play something he knows is going to get to rise out of the judge. If the judge makes an expression, then the press writes about, oh the judge is leaning this way or that way.\nAlso, he would use it anytime there was an opportunity to feel sympathetic for Gates or anyone at Microsoft. Then he would show a clip that clearly causes you to lose any sympathy or leaning. It was just dripped out in this really clever way.\nDavid: And certainly went a long way towards shaping the decision, but also shaping more importantly public opinion about Gates and about Microsoft. How did this hold up, though? Didn’t Microsoft appeal the change from recordings not being allowed for depositions to recordings being allowed?\nBen: That is a great question, David, and one of the things that I read to prepare for this episode is a book called World War 3.0, which is exclusively about this trial, and the author has this comment on it. “Microsoft feared that Judge Jackson was a foe. He had made a number of pretrial rulings deemed hostile to the company. They were especially unhappy that he modified the pretrial order, that depositions shall only be submitted in transcript form, issuing a new order, allowing videotaped depositions.\nMicrosoft suspected that justice had somehow prevailed on Jackson to amend his earlier court ruling. Jackson categorically denied this, but does not recall exactly why he issued the October 9th ruling. They groused, but only in the most unguarded private moments because they were terrified of offending him that Jackson was biased and would rule in favor of the government.”\nYour question of how does it hold up? I guess there was no formal challenge of that change in rule, and part of it probably was just because they realized they had a long way to go with the judge and didn’t want to agitate too much.\nDavid: Wow. Interesting. It also sounds like maybe they didn’t realize yet how disastrous these tapes getting out was going to be for Bill and for the company.\nBen: I think that’s right.\nDavid: Interesting. Well, okay. All of this starts to culminate in November 1999. These trials take forever when Judge Jackson issues a finding of fact that Microsoft is indeed a monopoly in the operating systems business.\nNow remember, it’s okay to be a monopoly. It’s not okay to abuse the power, but simply the fact that the judge has now issued his opinion that it is a monopoly, everybody knows this probably means the other shoe is about to drop.\nBen: And more specifically, the finding was that the network effects from the large installed base—that’s users—and large body of applications—apps—makes it prohibitively expensive for a competitor to develop its PC operating system into an acceptable substitute for Windows.\nDavid: Which yeah, of course obviously. That’s what our whole episode one was about. Correct.\nBen: The finding of fact is hey, it’s monopoly. But again, not necessarily illegal to be a monopoly, only illegal to abuse monopoly power.\nDavid: Right. A couple of months go by after the finding of fact, and then on June 7th, 2000 Judge Jackson issues the final judgment in the case. He rules that Microsoft did indeed abuse its monopoly power. As a remedy for having done so, he orders that Microsoft be broken up into at least two separate companies. Separate operating system company and a separate applications company, just like the Standard Oil breakup order, however many years it was before 90, I think.\nBen: Also, what? This is completely lost to history unless you are a tech old timer. Microsoft was ordered—that was the ruling by the court—to split up.\nDavid: It wasn’t just that oh Microsoft lost the DOJ case. No, the ruling was Microsoft will be split up by order of the United States government.\nBen: And there’s a whole bunch of additional provisions in this. Steve Ballmer had to work at one company and Bill Gates had to work at the other. They could not work at the same company. Each of those two, after they picked their companies, had to divest all of their shares from the one that was not their employer, so they couldn’t have this conflict of interest.\nIt is crazy imagining this world that could have been. Clearly this didn’t happen, but for a moment in time this was the position of the United States government.\nDavid: It’s totally wild. Can you imagine if there was the Gates Company and the Ballmer company? As we’re going to talk about in the rest of this episode, that is what happened, but in a very different way.\nBen: It’s also worth pointing out that from late 1999 when the findings of fact came out, over the next 12 months Microsoft’s market cap dropped from $600 billion to $270 billion, which was a 55% drop. Now this coincided with the dot-com bubble and the CEO change that we’re going to talk about shortly, but the perception of Microsoft, this super high flyer, completely fell off a cliff from this ruling.\nDavid: Imagine if a ruling comes out tomorrow that Apple needs to be broken up. iOS needs to be separated from the devices and you need to be able to buy a phone without iOS. What do you think that’s going to do to the company’s market cap?\nBen: Not exactly the same thing, of course, because this is not about devices.\nDavid: Well right, but I’m just making a similar type of scale analogy, like what the impact would be.\nBen: Yes. Do you know the technicality that was discovered?\nDavid: No, I don’t. I know that Microsoft immediately appeals.\nBen: Of course. It was discovered later in June 2000 that Judge Jackson had secretly been meeting with reporters in his chambers before the rulings were delivered. It’s not allowed. Judge Jackson was removed from the case. The reporters all had these embargoed stories they could drop immediately afterwards, and everyone was like, how did you… what?\nDavid: Wow. That’s wild. What a freaking crazy escapade here. There’s no other way to put it.\nBen: This is June of 2000, by the way. The appeal then takes a long time. There’s a meaningful moment in history, I think about 15–16 months, where the official ruling is Microsoft should be going through the preparations to do their breakup.\nDavid: That is what the world believes as far as anyone knows. The appeals court removes Judge Jackson from the case. They install a new judge to re-adjudicate the matter. She gets up to speed. We’re now in the year 2001. She starts pushing the parties toward a settlement,\nBen: Especially 9-11 happens. I think that’s a galvanizing factor to pull the parties into the room and say, hey, this has gone on too long and we need to put this behind us.\nDavid: Also there was a political administration change from the Clinton administration to the Bush administration?\nBen: Yup.\nDavid: So then in November, 2001, just a couple of weeks after the Windows XP launch, the DOJ and Microsoft finally completely settled the case.\nBen: Also, can we just say this case is brought against Windows 95. Windows 98 comes out, and then before we have a resolution, Windows XP comes out.\nDavid: Windows 98, you mean the marketing update to sell back-to-school PCs?\nBen: Yes, but insane, right? And the whole time Internet Explorer is shipping with Windows,\nDavid: The whole time.\nBen: So November 2nd, 2001, the settlement is proposed. At this moment in time, Internet Explorer has right around 90% market share.\nDavid: If you are in the camp of Microsoft was a monopoly, was abusing its monopoly power, you’re like well this was a complete failure of process. The damage is done. Meanwhile also if you’re in the Microsoft camp of what the hell is our government doing? You’re also like what the hell? Nobody is happy here.\nBen: An innovative company that built the most important product for that technology phase. Meanwhile there’s this whole new thing going on with the Internet, and like we need to figure out how to legally navigate that transition.\nDavid: We have enough existential threat to our business from technology trends happening, that to try and navigate that with our hands tied behind our back because of these legal proceedings, like come on.\nBen: So 2002, the settlement is finally approved. It reverses the order to be split up. Obviously, Microsoft is still one company. Officially, the ruling that Microsoft did indeed have a monopoly is upheld. They put in place a five year consent decree, and the terms are that Microsoft is not allowed to enter into contracts with PC makers that excluded competitors. Fine. Two, Windows had to be interoperable with non-Microsoft software, which of course it does.\nDavid: It always was.\nBen: It’s a developer platform. They have to write API documentation and make their APIs such that developers can build applications on top of them. That is the purpose of the company. So okay. Three, an independent technical committee was created to field complaints from competitors. Okay.\nDavid: They created a call line.\nBen: That is it.\nDavid: Wow. That’s it.\nBen: Am I missing something David? That’s my understanding of what it is.\nDavid: No, I don’t have anything else. But okay, that is the letter of the resolution here. The actual cost of this was immense. Nothing could have been bigger. We spent the whole first section of this episode talking about how Microsoft was so powerful, had never been more powerful, and there probably never will be a more powerful company than Microsoft in the late 1990s. This is what destroyed it.\nBen: Oh that is a take right there. I think that we will debate at the end of the episode.\nDavid: Oh well, the back half of the episode is about the incredible story about how Microsoft rebuilt itself in a completely new market into now again the most valuable company in the world. But let’s just talk about what the actual cost was, not in terms of money.\nIt certainly didn’t actually impact Internet Explorer or Windows. XP was a huge success. Sells over half a billion copies, gets used over its lifetime on probably a billion PCs. It unifies windows under the NT architecture, has the Bliss wallpaper, amazing. But the true cost is what it did culturally and emotionally to Microsoft.\nWe talked to all these people and God I was like death being there. To believe for 16 months that the company was going to be broken up, for Bill to have this really embarrassing video of him all over the press, and to have the narrative change about bill change, about the company, change about for every employee working at the company, to oh you’re the best and brightest in America, to you guys are evil and why are you working at this company.\nBen: It exposes the difference, too, in the legal strategy of both sides where Microsoft’s strategy was to refute point by point every allegation brought against them, to the point where they were trying to refute Netscape. We don’t view Netscape as an existential threat to us.\nAnd they should have just probably acknowledged, Bill literally wrote a letter that got published, a memo saying that Netscape is a competitive threat born on the Internet, but they wanted to refute every single point and knock of an inch.\nMeanwhile, all David Boies and the DOJ wanted to do was destroy Microsoft’s credibility, so that every time they brought a witness there were emails or there was a deposition that basically called into question, are they really telling the truth on the stand? Can they really not remember that? And it just blow by blow made Microsoft look like they were duplicitous.\nAnd that has to leak into the company culture. That has to make you on the one hand feel like your government is attacking you. But on the other hand, start to question and say why did we do this again? I thought we were just trying to make the best software. Were we trying to do something illegal and I just didn’t know about it?\nIt’s worth talking about some of the other pieces of fallout. It did slow Microsoft down. There were huge amounts of protocol documentation that needed to happen. If anyone’s running a software company, you know that if your iteration times are slower and you just have permanent new drag on your development process, you are going to fall behind. I think that was one that was felt by a lot of employees and managers who suddenly can do less with the same amount of resources that they have.\nThere was also a bunch of private lawsuits—Sun, AOL, Real Networks. Microsoft was paying out billions of dollars in these private settlements that followed the DOJ, their civil suits.\nDavid: Not to mention state attorney generals were also suing Microsoft left and right and international.\nBen: Many of the state AGs for years who brought the suit together with the DOJ did not accept this reversal. They tried to continue independently suing Microsoft, which was painful for another five-ish years. We made it all the way to 2009 before they settled their EU version of this antitrust case. That’s another seven years after the reversal.\nIn May 2011, that is when the final consent decree finally expired. Basically from 1990 until 2011, 21 years of the company’s life, the majority of the company’s life had been spent under some antitrust scrutiny or active litigation.\nDavid: Wow. Obviously the company thrived through much, if not all of that.\nBen: But were consumers ever harmed? I continue to wonder this. It was horrible for Microsoft, even though there weren’t any real material changes they had to make. But effectively they won, which (I guess) they should have because it’s not clear that there was a negative impact to consumers.\nThere was all kinds of negative impact to existing competitors or future potential competitors. But that is not the US standard for antitrust law, especially at this point in history. I guess the right answer is the right thing happened eventually but it was awful to get there, and it had all sorts of indirect negative impact on the company.\nDavid: I said a minute ago, I think it killed Microsoft’s immense dominant consumer technology power. The biggest reason I say that, we didn’t talk to Bill Gates as we were preparing for this, but is what this whole thing clearly did to Bill Gates.\nBen: Microsoft had one competitive advantage that no other company had, and that was Bill Gates.\nDavid: And for whatever sets of reasons, I can imagine so many thinking about if I were in that seat going through that, Bill at Microsoft was never the same person after this.\nBen: In fact, Bill stepped down before the final ruling from Judge Jackson.\nDavid: Yeah. In July 98, right as this big huge DOJ antitrust suit is heating up, Steve Ballmer gets promoted to president of the company. Bill is still CEO, but Steve is now promoted to president and is the clear number two. Then they go through the trial, the deposition, the November 99 finding of fact that Microsoft is a monopoly.\nThen Ben, as you’re referring to on January 13th, 2000 Bill Gates announces that he is handing the CEO role of Microsoft over to Steve, and that he is moving to a newly created position as chief software architect. He will remain chairman of the company, but he is no longer going to be CEO. Then, of course, it’s just a few months later that the breakup verdict comes down.\nBen: Going through something like this has to feel personal and has to change you forever. I can’t imagine how it wouldn’t.\nDavid: Totally.\nBen: Especially when again, it’s not clear to me how consumers were harmed. This constant battle, this war that was waged on forever and ever and ever and ever, it totally distracted Microsoft. As anybody can attest, especially in the tech industry, if you are distracted, you just fail because you need to have all of your best resources making stuff, building stuff, focused on firing on all cylinders, clear North Star strategy. If you tie up a company for five years…\nDavid: And you lose your leader through it. Somebody we talked to characterize this period as a mental breakdown for the whole company. I think that’s the best way to characterize it.\nBen: It’s not fair to blame everything we’re about to talk about all the future consumer failings on this, but it is helpful to keep this in mind and say, okay, why perhaps did they not fully have their wits about them?\nDavid: So the transition to Steve Ballmer happens. This is the context under which Steve Ballmer became the CEO of Microsoft.\nI talked to a whole bunch of people who are at Microsoft in this era. One thing that every single person brought up that never gets talked about is how much Steve was the emotional rock for the company when this was happening. All the stuff, everybody thinks about Steve, the running around on stage, the yelling, the screaming.\nBen: Developers, developers, developers.\nDavid: When do you think all this happened? The crazy dancing on stage. I love this company. That was in September of 2000 when they thought they were going to get broken up. Steve was there trying to keep everybody moving forward. Everybody we talked to was like, I don’t know how he did it. It meant so much.\nBen: It’s actually shocking. They held onto as much talent as they did in a 15 month period of people assuming the company was about to be split.\nDavid: Knowing that context, for me at least, it completely changed my perception of Steve and of the company during this time.\nBen: Fascinating.\nDavid: So when Steve takes over, his agenda is three things, and I think in basically priority order. Number one, hold the company together emotionally. I love this company. That was job number one. Just keep everybody coming to work. Job number two, clean up this antitrust mess. Then job number three I think was, hey, let’s keep this company like growing and winning. I think it’s fair to say he did all three.\nWe just talked about one, emotionally holding the company together. Two, one of the very first things Steve does when he becomes CEO is he promotes Brad Smith to general counsel, who Brad Smith is still of course leading all this at Microsoft to this day.\nBen: He’s now president.\nDavid: And Steve tells Brad, go make peace. Actually, this is amazing. Brad’s final interview with the Microsoft Board of Directors.\nBen: Oh I was wondering if you found this.\nDavid: Yup. For his job to be promoted to general counsel, his PowerPoint presentation to the board is just one slide that has one sentence on it. It’s time to make peace. That is totally what he goes and does.\nHe says, okay, I’m going to figure out what settlements we can live with and I’m going to go settle everything. This company just needs to move forward. it doesn’t matter that we all feel it wasn’t fair. It doesn’t matter that we all feel this was a sham of a process. We just have to move on, and we have to live in a new reality.\nBen: And you need a new set of people to do that. It’s amazing that Steve was part of the old guard and the new guard do this because how can you say, I’m going to put how unfair I feel this was aside and just focus on moving forward. That is an extremely difficult compartmentalization exercise.\nFor Brad to come in and say like, I’m going to be the guy who is able to disregard the past and figure out how we—I use this phrase in the first episode—become a trusted partner to governments around the free world, how crazy is it that this Microsoft that we just talked about for the last hour became the Microsoft that can do no wrong from a regulatory perspective. The only one that’s not under active antitrust investigation today by the federal government. The one that is a massive provider of software and services to the US and its allies at the government level.\nDavid: The reversal here is it doesn’t get talked about enough what an amazing job Brad and the company did to reverse this perception. That leaves job number three on Steve’s agenda of be successful—continue to have Microsoft be a leading technology company and hopefully still grow revenue and profits.\nBen: And Bill Gates is still chairman of the board. Not only is he a full-time employee being the chief software architect, it’s not that it’s like a sham that he’s not the CEO, but he is a very present voice at the table in these big decision making moments. For how do we become a company that continues to innovate and make great products, despite all this, he still has Bill as the technical leader of the future products.\nDavid: Absolutely. Bill was still there, and Steve had Bill. They were running the company together. Absolutely. But what’s so interesting is Microsoft right at this time basically starts a transformational journey from a technology company writ large, a consumer and enterprise technology company, to the enterprise technology company.\nThat is a muscle that as we talked about last episode, Steve had been building for a while, but does he really come into his own here. Microsoft, the entire enterprise juggernaut that it builds, the bulk of it really is post-DOJ. It is like new business and new markets that they are getting into.\nBen: Then the question becomes how did Microsoft build this phenomenal enterprise business? And along with that release XP, the most successful Windows operating system ever. Then we’re going to talk about Vista, and then we’re going to talk about Zune, search, Bing, and Windows Mobile.\nDavid: Windows 8 and all that.\nBen: But before we do, we would like to thank huge partners of ours here in this season of acquired, ServiceNow.\nDavid: ServiceNow is the AI platform for business transformation, helping automate processes, improve service delivery, and increase efficiency. Over 85% of the Fortune 500 runs on them, and over the past few years they’ve joined companies like Microsoft as one of the most important enterprise technology vendors in the world.\nBen: And speaking of Microsoft and ServiceNow, they just announced a huge expansion of their partnership, specifically integrating the two companies enterprise AI assistance. Starting in the fall, customers will be able to interact with ServiceNow’s Now Assist—-AI assistant directly within Microsoft Copilot.\nDavid: It’s telling for the magnitude of this partnership to see Satya Nadella appearing in the keynote at ServiceNow’s big annual event knowledge last month. It had echoes of that Bill Gates 1997 Mac World video that put Apple back on the map, not that ServiceNow needed putting back on the map.\nBen: Like that historic announcement from Bill committing to Microsoft Office for the Mac, this partnership is also huge. ServiceNow’s Now Assist will be integrated with Microsoft Copilot and will be available directly from Office apps starting with Microsoft Teams in August. The AIs are integrated into one seamless user experience without actually sharing data.\nIf for example, a user asks Copilot in Teams about how the company’s laptop policy works, behind the scenes Copilot shares that request and context with Now Assist, Now Assist accesses internal company policy with the right permissions for that user, and returns the answer to Copilot in a rich card with options for the user to kick off a workflow via Now Assist.\nIn the future, Microsoft Copilot will also be integrated the other way into analysis, so it can automatically generate Office files like PowerPoint presentations and Excel spreadsheets directly from assets and knowledge in the ServiceNow platform.\nDavid: It’s pretty awesome for both companies and especially awesome for enterprise users. If you want to learn more about the ServiceNow platform and how it can work with your company’s Microsoft services, go over to servicenow.com/acquired and when you get in touch, just tell them that Ben and David sent you.\nBen: All right. To contextualize how this enterprise business was built, it is worth understanding the shape of Microsoft’s business, like the divisions, what products generated what revenue even before all this DOJ stuff.\nIf we go back to 1996, Bill Gates gave a great interview where he was talking about the four businesses that they’re in today.\nDavid: Oh this is the Wired interview with Kevin Kelly, right?\nBen: Yes.\nDavid: It’s on YouTube. It’s great.\nBen: It is great. There’s Windows, which he calls one business, there’s NT/BackOffice, there’s Office, which he calls a $4 billion a year business. Those three businesses together are over 90%. You can think about it as Windows, and he said NT/BackOffice, but this is the enterprise and Office.\nDavid: Which is so funny that Bill thought of it as NT/BackOffice.\nBen: It really exposes that Steve was the one who had the passion for the enterprise. Bill was like, it’s this stuff that businesses buy, but I’m going to refer to it by its Microsoft product name of one of the products we sell, which is NT. And then the last 10% is everything else. There’s MSN ecommerce, Games, encyclopedia, Maps, joint ventures, Dreamworks and NBC.\nHe’s talking about the interesting thing, the server business, which is a different way he refers to NT/BackOffice all the way back in 96, is the fastest growing business even faster than Windows or Office. They know they’re onto something, but they haven’t quite cracked the go-to market motion, the pricing, the service, organizationally how do they fit it in. That all comes later.\nDavid: Or the products, either, really.\nBen: That’s a great point.\nDavid: The fact that he calls it BackOffice, this is so telling. We did talk last time about NT, Dave Cutler, and the heroics that he performed to write NT. Windows NT though was still a client operating system architecture for a user to use a personal computer with.\nBen: NT basically was enterprise-ready. It was very networked for workgroups. It ran on only the most high power PCs. But you’re right, David, it was designed for the thing that the first 25 years of Microsoft was all about, which is PCs. It’s not like, oh we’re a systems company that makes stuff for all use cases all over your enterprise. It’s no, we make stuff that runs on a box sitting in front of you.\nDavid: And discovering this distinction is what Microsoft in this next era really, really nailed. They discovered that the enterprise is not about users, it’s about IT. And it’s about systems.\nBen: For better or for worse.\nDavid: Discovering that, the products, and the sales motions that Microsoft could then go use to sell to enterprise IT and sell systems was a new, multi-hundred billion dollar market that Microsoft could now go attack and play offense in in this post-DOJ landscape. Whereas they’re playing defense everywhere else, hey here our market share is zero, we can do whatever we want here.\nBen: Well it wasn’t zero, but they were fighting Sun, IBM, Oracle.\nDavid: Really IBM, but Sun, yeah too, Oracle, et cetera. And it was perfectly suited to Steve’s strengths. Ben, if you’ve ever heard of these now strange-sounding Microsoft products, SQL Server, Active Directory, Exchange, Dynamics, SharePoint—Sharepoint was technically within Office, but it is one of these systems types products—these are all, every single one of those names I just mentioned become multi-billion dollar revenue enterprise IT server products that are built and sold during the Steve Ballmer era of Microsoft.\nWhat’s so honestly beautiful about this is they work in concert with Windows and Office on the PC client side. This is the client-server era that Microsoft really dominates here, and Microsoft within enterprises, all these new server products work best with Windows operating system devices running Microsoft Office applications on them. Those Windows operating system devices and those office applications work best with the Microsoft server products. You now have a full system solution from one technology vendor as a major enterprise. It’s like the most incredible three-sided technology flywheel ever built.\nBen: And one benefit from this—which of course if you’re Microsoft, you don’t want to lean on this benefit, but they end up doing it—is if you make everything integrated together, work well, and come from one vendor, nothing actually has to be best of breed. You’re no longer competing with any point solutions. You offer the whole thing. Sure, yeah, you can consider going and buying that other vendor’s directory service or that other vendor’s email server. But are you really, because you buy everything from us and it all works pretty well together.\nDavid: The very, very, very best example of this that most listeners can probably tangibly relate to as well is Exchange email and calendaring service and Microsoft Outlook and Windows.\nBen: It all has Active Directory that syncs across everything. In doing all this research, it seemed to me that once an enterprise adopted Active Directory, they were going to tip and they were going to buy the rest of the software too. Because whoever manages the source of truth for who are all the people and what are all the resources, devices and everything that my company owns, everything else needs to reference that canonical set of proper nouns, whether it’s email, whether it’s calendar. That was this incredible sticky product that then you could just keep attaching more and more stuff to. Any enterprise need? Oh we got you covered and hey it works with Active Directory.\nDavid: The whole product effort here started with database. In 1998, Microsoft takes SQL Server. It was the first real enterprise-ready database that can rival IBM and mainframe databases, Oracle databases. Of course, unlike IBM, it runs on x86 Intel architecture.\nThe pitch now to enterprise IT is everything we just said about why working with Microsoft Server products is better for the whole ecosystem reasons, also total cost of ownership. Don’t pay IBM tons of money for their mainframes. Just go buy cheap x86 Windows boxes from Dell or whomever, and use that as your IT server architecture.\nBen: Fascinating. I don’t think I quite understood that. Basically, you then have NT as the operating system, SQL is the database, and then you’ve got all these other applications that basically run on that stack.\nDavid: And here’s where Exchange and Outlook and everything comes in. This is right as email is taking off as the killer application in enterprises. Now Microsoft shows up and says, we’ve got this great new product for you. It’s called Exchange. Maybe you were using Lotus Notes before, which of course developed by the legendary Ray Ozzie. He’s going to come back up here in a minute. Lotus gets acquired by IBM for $3.5 billion in 1995. You’re buying Lotus Notes from IBM. Come take a look at Exchange.\nExchange has email. Exchange has calendaring. Exchange has address book. Exchange has Outlook. It is a first class included in the bundle of Microsoft Office, office application that you, mister and missis enterprise are now going to get for all your users. It works just beautifully and perfectly with our exchange email calendaring and address book service. It sells itself, basically.\nAnd then you were talking about Active Directory. That led to Active Directory of oh, okay, well now you’ve got your whole database architecture running on Microsoft. You’ve got your email and your calendaring architecture running on Microsoft. You’ve got your Windows machines out there.\nWell you’ve got all these employees within your company, all these users with all these devices. You need to manage them. You need to know who has what security access, how to find each other, where should the mail get routed and all that. Well we’ve got this great new product for you. It’s called Active Directory.\nBen: It’s pretty incredible. That’s all on the why it’s good for customers. On the why it’s good for Microsoft, Steve also pioneered this bundling idea, which is once you sign the enterprise agreement, you get access to all of this.\nIf you’re a customer that’s only using 30% of the things in the bundle, if you have business needs that involve some Microsoft product that comes for free in your bundle, you’re going to adopt that. Guess what? You just became a stickier Microsoft customer.\nI feel like this often goes overlooked in the, oh, Microsoft’s a big boring enterprise company right now. There was a tremendous amount of business model innovation in figuring out that bundling like that with additional products can create stickiness, which eventually creates more enterprise value for your company because you’ve got these long, durable compounding revenue streams. Oh and all your customers are growing, so you have the whole land and expand thing there. The thing underpinning it all is the software itself has zero marginal costs. You can bundle in all this stuff for free because it actually doesn’t cost you anything.\nDavid: I know it’s enterprise software, so it’s not as sexy or exciting or thought about as much as consumer software. But truly the innovation that was happening here was among the most that has ever happened at a technology company because Microsoft was figuring all this out. Again, these were not lessons that people knew.\nIn the IBM era that came before this, in the enterprise, there were no users. Microsoft is now figuring out how to build and sell enterprise technology systems in this new era to businesses where there are users of the technology.\nOn the business side, yeah, what you just said, this is crazy. Microsoft said, okay, we’re not going to just sell you the software. We’re going to introduce this thing called an enterprise agreement where you, based on the size of your company, will pay us a certain dollar amount per year per employee—actually I think it was per device, but in these days it was like most employees just had one device—and we’ve got you covered. Everything that you would want access to in our whole suite of software products…\nBen: Inclusive of Windows and Office. It’s not just a salesman comes to you and sells you Windows. This is Microsoft amortizing their go-to-market costs across all of their products because when you show up at an enterprise, you’ve got lots of stuff to sell them.\nDavid: Now Microsoft has turned a one-time sale of software into an annual annuity that is going to keep growing every year and is going to grow with headcount.\nBen: And a key feature of the EA is that it is a three year agreement, which means that you really need everything to be aligned to pull this off. There’s something pretty convenient that you may have noticed about Windows and Office. They both tend to release an operating system or a new package of office once every three years or so. Every customer, no matter when they sign the agreement, is essentially guaranteed one upgrade during their lifetime.\nDavid: Here’s something else that you get now as an enterprise IT buyer in the enterprise agreement world with Microsoft. Your needs as IT are actually pretty different than your users. They’re actually very different. If you are an employee of a large company at this time, you are using a Windows PC at your office. What are the set of things that you want from that device?\nYou probably want to be able to procrastinate, you might be able to want to play some games, you probably want to poke around the Internet, you definitely want it to be easy to use, and you definitely don’t want restrictions on there.\nBen: You’re willing to make trade-offs. If you can get a little bit more efficiency but trade-off some security, that’s fine. If you can, maybe use some pirated software but it makes you better at your job, that’s also fine. You’re acting with your own agency, not necessarily the company’s best interest in mind.\nDavid: You want to run some VBA macros, et cetera. Okay, now you are a corporate IT administrator, and all of a sudden you have to manage all these rogue agents all over your systems; rogue agents called your employees. You want the ability to restrict your users from doing what they can do. You want to say like, no, you cannot upgrade this software without us doing it. You cannot install anything, you cannot run these macros, you cannot visit these websites, et cetera, et cetera, et cetera. Part of that is productivity, but a large part of that, Ben, as you said, is security.\nBen: Security, privacy, legal compliance.\nDavid: Am I going to get hacked? Am I going to get sued? Are we going to lose data? Well, Microsoft’s got a beautiful solution that they can sell you. With the enterprise agreement you can customize all of this and we will give you exactly what you want.\nBen: But now David, you’re starting to expose a couple of features of enterprise adoption, which have trade-offs if you’re Microsoft.\nDavid: Oh yes they do.\nBen: First of all, if you are a user, you want the latest and greatest software with all the most innovative features. Your IT administrator has a lot of incentive to say, I don’t really want to go train everyone on anything new. If the software never confused anyone, that’s a win. Even if it means we never get any new features.\nSuddenly, and I have a direct quote from someone who is an executive in Office told me, “When I was in Office, I always thought we could stop bundling new features for 10 years and it would be fine. No one would notice.”\nDavid: I think people would probably pay more for it.\nBen: Office got to this point where, and I think Steven Sinofsky even writes about this in Hardcore Software in his book and on his Substack, that at some point they were trying to ship features that the PMs thought were great and users would love. They would do this user research, they would hear that people want them, and then the sales force would run back to them and say, no, no, no, no, no, no. Do not include that. Are you kidding me? I’m going to have all these objections in my sale if you make me take this new feature or take this ribbon or any big UI change. Everything has to be small, iterative, and not add any training or confusion.\nDavid: I joined the corporate workforce in 2007 when I graduated from college, and I was an investment banking analyst on Wall Street at UBS. I started mid-summer 2007 and our corporate IT systems, my Windows laptop was so locked down. We were using XP of course.\nBen: In 2007 you were using XP?\nDavid: Yes. We were using Office 2003, of course, and over everyone’s dead bodies, would any of that change? Everything was firewalled. We couldn’t install anything. We couldn’t access tons of websites. I remember when I first started, we could still access miniclip.com. The analysts were playing tons of games and pretty quickly IT caught on and that got the kibosh. I’m sure UBS as a customer loved every single bit of that.\nBen: The other big thing that you are talking about, which you were hinting at with VBA macros, the key to enterprise is backward compatibility. Saying, look, we don’t necessarily need to promise you anything too groundbreaking. We need to meet your needs today and be the most cost-efficient, total cost of ownership–driven system that meets your needs and your employees are fine with. And from here on out, everything’s going to stay compatible. Any modifications you make enterprise or software you use and rely on, we won’t break no matter what.\nDavid: And we will continue to support those versions you are using.\nBen: Enterprises love that. We’re going to put a pin in this right now and we’re going to bring it back toward the end of this episode in a really illustrative way that it can deeply, deeply hold you back if you are Microsoft, and you have built an entire brand and reputation around your backwards compatibility.\nDavid: One stat and then one point I want to make to highlight all this, by 2007 analysts estimated that 40%, of all of Microsoft’s revenue, which I think was about $51 billion that year, 40% of $51 billion came from multi-year enterprise agreements. These three year agreements that you’re talking about, Ben—that covered Windows, that covered Office, that covered all the products that Microsoft offered except Xbox—40% of all the dollars were flowing from multi-year EAs, and then another 15% of all dollars that Microsoft was earning as revenue were flowing from single year EAs.\nBen: Wow. More than half the company’s revenue.\nDavid: Fifty-five percent. Yes, more than half the company’s revenue is all from this.\nBen: By 2007. It was really the first seven years of Steve’s tenure as CEO already tipped the balance into majority.\nDavid: And the vast, vast majority of the rest of Microsoft revenues, the other 45% of the company was the OEM Windows business. That was 30%. If you look at Microsoft revenue in fiscal 2007, 55% is this new enterprise motion, 30% is the old Windows business—Dell and Lenovo and whoever selling laptops to consumers and paying Microsoft for the operating system—and only 15% of the company’s revenue is anything else.\nBen: It’s funny. I wasn’t going to bring this up here, but since you brought up OEMs, the OEM business model is completely transformational for Microsoft. When they figured out, actually we shouldn’t be just selling software directly to consumers. Instead we should be selling them to the PC maker and the PC maker should do our distribution.\nHere are a couple of stats. In the 90s, the box software that Microsoft would use to sell Windows, their gross margin on a copy of Windows was 29%.\nDavid: Oof. That’s not good.\nBen: They had to print the disc, which had actual real costs, especially on floppies. You had to put it in the box, you had to ship it to the retailer, you had to split profits with the retailer, you had to pay the sales and marketing costs. It’s like real material cost. This is not a zero distribution cost, zero marginal costs business in the box software retail world.\nBut when they’re selling through an OEM channel, their gross margin was 75%, because you just ship the bits to the OS once and then the PC manufacturer takes it from there. Not only is it amazing because you get that 75% versus 29% of gross margin, it’s also an amazing way to scale because you do a deal with every OEM, as you’re going down the line, it’s the Visa networks of networks thing that I think we alluded to this last episode too. You just get each of them scaling on their own, can accrue to you without you doing additional work to do the scaling yourself.\nDavid, it’s interesting you’re talking about how 85% of the business by 2007 was either enterprise sales of the EA or OEM. They’d basically kicked the can to the curb on that crappy retail box software model. They’re just doing the whale hunting with their sales force and doing these enterprise agreements, which of course have great margin structures and the OEMs.\nDavid: And our annual annuities.\nBen: Exactly. Way better business model in every way. They pivoted the whole business to the two best ways to sell software, and completely eliminated the bad way to sell software.\nDavid: One of which they figured out post-DOJ and it became (by 2007) over half of the revenue of the company, which is crazy.\nNow Ben, when you said put a pin in a minute ago, and I know we’re going to come back to this after all the consumer failures we’re about to talk about, there is a downside to this. When IT becomes your customer, when you become an enterprise business, the quality of the software, especially the user-facing software, is no longer priority number one. This wasn’t a problem for the company until in 2007 with the iPhone. But let’s rewind and talk about everything that happened in consumer software at Microsoft until then.\nBen: What was going on with Windows releases during that time. I think through storytelling, the Windows releases, we can then understand the state of the company. Windows XP, why was Windows XP such a big deal? Well, it was a big deal technologically, it was a big deal for users, and it was a big deal because it’s pretty wild that Microsoft amidst all the antitrust stuff we were just talking about during the 1998 to 1999, the rulings in 2000, the settlement proposal in 2001, they developed and released an operating system amidst all of that.\nDavid: And an awesome one.\nBen: What was Windows XP technically? Well, for the previous better part of a decade, they had two parallel development efforts going on. There was Windows NT for the enterprise and there was Windows 9x—Windows 95, Windows 98—for consumers. Both of these had the same API that developers could write their applications for. But ultimately, the way they were implemented, the way interoperability worked, compatibility worked, user experience, everything about it was actually completely different because It was a completely different implementation of those APIs.\nThe knock against NT was always, well you need really beefy enterprise-grade PCs to run it, it’s not as nice and intuitive, and the knock against the Windows 9x—call it 95—was that, yeah, it looks pretty, but it’s not powerful. I can’t actually do anything. It was a friendly interface but not a powerful set of functionality that came with the operating system.\nXP did the impossible where they figured out how to take the ease of use of the 9x interface and make it run on top of NT. The whole thing is built on the NT kernel, and it has the friendly, approachable, ease of use that you are used to in Windows 95 and 98.\nDavid: Amazing.\nBen: The lineage of that 9x code base that came all the way from Windows 3.0 or maybe even 1.0 or 2.0, I don’t know how long code lived, but—\nDavid: Interface Manager.\nBen: Exactly, is now dead. You had the NT lineage of (I guess) maybe even you could say it started with OS/2, but Windows NT, Windows 2000, and then Windows XP. Everybody’s running XP now. There are two additions. There’s Home and there’s Professional.\nDavid: Oh, got to get the Professional. I always got the Professional.\nBen: Did you?\nDavid: Every time I built a new PC. Oh, got to go Pro. I didn’t even know what Pro meant. I definitely didn’t need Pro because I was not a corporate office worker. But got to go Pro.\nBen: It came with all kinds of great stuff. They’ve got this great slide. It’s a fun announcement to watch the emphasis on digital photography, digital music, digital video, home networking. It ushered us into this age of you probably have media that you’re using on your computer.\nApple famously owned this as a corporate identity with their digital hub strategy. But Windows XP, plenty of people were importing digital photos off their camera to Windows XP. That was a big exciting use case for it.\nDavid: A lot of Napster clients running on Windows XP machines.\nBen: Like I did for every Microsoft Windows release, I went and watched the keynote. The keynote is extremely strange. Think about what a Steve Jobs keynote was back in the day, or what a WWDC keynote is like today, or a Google IO. This keynote opens with a gospel choir singing America the Beautiful, and is followed by Bill Gates and Rudy Giuliani walking out on stage together and talking about how bad terrorism is.\nDavid: And of course the thing you need to know about this keynote is the date.\nBen: This happens one month after 9-11 in New York City, and it really underscores what a strange time it was in the US. If you had this once in three years product release and it was going to be in New York October of 2001, you probably have this question, should we even do it? Should we make it all about the first responders? It grounds the whole thing in a very specific moment in history when you’re watching it in a way that no other tech event really ever has been grounded in history before.\nA few other things that jump out during the keynote. Bill Gates is not the CEO, Steve Balmer is, and yet Bill Gates is the one walking out with Rudy Giuliani to kick things off. That’s a strange and somewhat telling element of what Bill’s role at the company was.\nNow you could argue he was the public facing figure, he was the founder of the company, it seems very natural. But also at some point, why isn’t the CEO the one doing the keynote? Another thing about Windows XP, there was a new release of Office right at the same time as XP.\nThis is a classic Microsoft move. They are able to create great applications available on day one, which makes the OS more valuable. From the applications perspective, they’re able to ensure that they get great market share since they’re always adopting the latest and greatest Windows platform right away.\nWindows success begets office success, It’s important to remember that that worked for many, many years. If you remember back to the last episode, Lotus 1-2-3 and WordPerfect smoked Microsoft in Microsoft’s own backyard. During the DOS era, Microsoft’s productivity apps did not get real adoption in DOS, which is crazy.\nWhen they were making Windows, they basically swore never again. They ensured that they were going to be very early with applications on those platforms. As Windows took off, Office also got huge market share.\nIt’s smart to remember this lesson and carry it forward for years, maybe a decade. But again, they may have bet on this strategy a few years too long. Forever it became gospel at Microsoft. So with Windows goes the company, so you need to do things to make sure that Windows is going to continue to succeed because that is our company’s platform and livelihood. It’s almost like the old Disney adage, so with animation goes the company, and until 2014 Microsoft felt the same way.\nDavid: That is true for all the traditional reasons in the XP timeframe. The reason it was also true in part one of our Microsoft series. It’s even more true as Microsoft becomes an enterprise company because Windows is at the heart of the enterprise agreement. The whole value prop of all of our server technologies is they work great with your Windows devices on your network.\nBen: There are strong incentives everywhere for Microsoft to ensure that Windows is the standardized platform that everyone wants to have on their PCs because it makes everything else work.\nOf course, they’re going to release a new version of Office that shows off the latest and greatest of Windows. I think this XP timeframe is the showcase moment of when that was a great strategy and we’ll contrast that later.\nThe other thing to know about this XP timeframe is last episode we talked about the incredible secular growth trend of the PC that was this crazy tailwind for Microsoft. One of the greatest tailwinds you could ride in business history, PC shipments, I believe the stat, David, was that they grew 98% per year over the 11 years between the founding and 1975 and the IPO in 1986.\nThe crazier thing is even as late as 2001 with Windows XP, they were still riding this tailwind. The US household penetration of personal computers—again, flashing back pre-IPO—was only 8%. That whole doubling year over year over year, by Microsoft’s IPO, they still only got to around 10% of penetrating the US.\nBy 1997—13 years later—it grew to 37%. After a couple of years of XP being in market 2003, it had grown to 62%. I think the craziest stat is actually that last one, 2003 feels like a modern moment in history, but PCs were still only in 62% of US homes.\nDavid: Wow. That’s crazy.\nBen: The PC wave is just one of the greatest secular trends in history, particularly if you have a monopoly share of that market. And as defined by the US government did.\nDavid: Ben, define ‘define’ for me.\nBen: There’s just no question of, as this market grows, are you going to be able to continue to participate in it? It’s like yeah, we basically are a tracker for that market. It grows, we grow with it.\nDavid: Now might be a good time. Certain Microsoft fans have probably been listening to this episode and gripping their phones with all their strength, like when are you going to talk about Xbox ? We are going to talk about Xbox briefly right now. We will do a whole nother episode on Xbox someday.\nBen: Maybe David make your case and then let’s talk about it.\nDavid: My case is I love my Xbox, so.\nBen: Well it’s important to know Microsoft didn’t start in gaming with the Xbox. Windows 95, they shipped DirectX, that changed the world. They became a real gaming platform because of that, is this unbelievably clever set of APIs that went entirely around Windows. Amazing piece of technology. You put Microsoft on the map and you have the whole rise in PC gaming for the next six years, even before the Xbox.\nDavid: That’s funny. Microsoft is so huge that this is one of the things that gets lost to history. But you are absolutely right. DirectX was so important in that late 90s era for PC gaming. You have Quake, Counterstrike, everything that happened, Half Life later, that was enabled.\nDoom came before and was really just the genius of Carmack as a programmer to enable a first person shooter to happen on a PC hardware without something like DirectX and hardware acceleration. But yes, everything that came after that, the birth of the first person shooter genre, huge story to tell another day. But you’re right, that leads into Xbox and Microsoft’s entry into the home console.\nCrazy that happened in November 2001. Just a couple of weeks after the XP launch. It was a big time for Microsoft.\nBen: And how crazy is this? They thought they were getting broken up.\nDavid: As they’re launching a video game console.\nBen: And this operating system that they’ve been working toward for eight years.\nDavid: This is also part of my argument of Microsoft was such a dominant consumer technology company before DOJ, because even though all this stuff comes out right after, it’s the momentum still from before that’s carrying Microsoft through to it.\nBen: Okay, while we’re in Xbox Land, should we finish our Xbox-iness right now for this episode?\nDavid: Sure.\nBen: Xbox has become an important part of our world, but not an important part of Microsoft’s business.\nDavid: Agree.\nBen: David and I heard people utter things in our research like Xbox has been a lifetime break even business or it’s never meaningfully contributed to Microsoft. I tried to figure out as much as I could from financial statements, and I got to thank Alex at The Science of Hitting—it’s a great Substack—for helping me with this.\nIf you look, there was a division called Entertainment and Devices that was part of their old reporting structure. If you look at the E&D reporting over time—let’s start back in 2006—they generated $4 billion in revenue, lost $1.4 billion operating loss. This is five years after the Xbox has come out. Loss-making.\n2008. They do $8 billion in revenue, $400 million in profit. Even as it’s becoming a real business at Steady State.\nDavid: Yeah as 360 is coming into…\nBen: Teeny margins.\nDavid: Yeah, totally.\nBen: 2009, $8 billion in revenue, $100 million in operating income. 2010, another $8 billion in revenue, $700 million. This is $700 million to Microsoft. In this timeframe, they do call it $20 billion of profit?\nDavid: Yeah.\nBen: What’s $600–$700 million?\nDavid:. There’s a great quote. Oh bring it up again later. But we got to talk to Steve again, to Ballmer as we were preparing for this episode. He had this amazing quote to us about some of his acquisitions that didn’t go well.\nHe said, “We only lost money. It’s funny, but it’s such an important point in the context of Microsoft. Money is not the scarce resource. The scarce resource is time and talent and focus.”\nBen: That is exactly the right point. Microsoft, since year two or three has never been capital-constrained. Bill Gates says this in an interview, “Anytime we’ve thought about making an investment, it’s just, do we have enough talented people to pull that off? On any given year, I can’t deploy all of the dollars available as a CEO, as a capital allocator because I’m constrained by the amount of smart people we have to pull it off.” That is a much different position than most businesses are in.\nDavid: But is absolutely the case, not just for Microsoft, but for all the at scale tech companies these days, the top five market cap companies in the world. Money is not the issue.\nBen: In fact, you’re making my point for me. If I had to make the case of why Xbox has been somewhat of a folly and perhaps not worthy of a full acquired episode, it would be, there was a lot of Microsoft’s best people worked on Xbox.\nThis is a group of people that went and created Xbox Live that by 2012 had 40 million subscribers. People who built a core competency of running a big online service. These are some of the best product people. The aesthetics of Xbox from a physical perspective, but also the software.\nI just think it was a sinkhole of some of Microsoft’s best product people and just hardest working people. The culture at Xbox was so hard-driving to produce, at least in this point in history up to the 2010 timeframe, very little in the way of contributing to Microsoft’s business, but soaking up a huge amount of the talent. Imagine if that product design sensibility was deployed across the rest of Microsoft.\nDavid: Totally. I think Xbox Live is debatable. We’ll come back to this with Azure. Xbox Live was one of the original pioneering internet services, subscription services across any category of software and technology. The DNA and experience that Microsoft built from that served it extremely well.\nBen: I think there are two gigantic benefits. Look, the gaming market is massive and important. If you could try to own one market in the world today, in the world of entertainment, it’s gaming. I’m just saying Microsoft didn’t up until that, at least this point in history. But it’s the right market to go after. They were not successful in capturing value from it at this moment in history.\nBut you’re right. The two big things that they were able to do is build out a core competency of running a big online service, which totally led to Azure, which we’ll talk about later. Two, it really did make Microsoft relevant with a whole new set of consumers when Microsoft was completely irrelevant in their lives.\nDavid: Should we talk about Vista?\nBen: Yes.\nDavid:. Oh boy.\nBen: There’s a little tail off of XP that’ll lead to Vista.\nDavid: We got to talk about the code names too.\nBen: The Windows XP code name, David, was what?\nDavid: Whistler.\nBen: Of course. Like the beautiful ski mountain, real close to Vancouver. A lot of Seattleites go there. It’s a favorite of many a Microsoft employee.\nDavid: And Blackcomb.\nBen: The ski mountain right next to Whistler is yes, Blackcomb, which became the name for the theoretical release that they wanted to do just a year or two after Vista. We’re going to follow hot on the heels of that.\nDavid: Oh boy.\nBen: But Blackcomb started becoming pretty technically hairy, so they decided to push the date out. Another reason they had to push the date out was Windows XP, for all of its usability and reliability, was very insecure. Microsoft had a whole thing where they thought they were going to spend three months putting out a service pack. They spent the better part of two years iterating on Windows XP to come out with a release that really people and enterprises could trust as no viruses, this is safe to deploy your enterprise.\nDavid: This was Service Pack 2, I think, was what ultimately.\nBen: Yup. Windows XP SP2 is the stuff of legend. That’s the good one. that pushes Blackcomb data out and it also ties up a lot of the talent that Microsoft needs to start working on the next generation operating system, which again, they thought was going to be a fast follow.\nFor anyone who skied up there, there’s this great ski lodge restaurant right between the two mountains called the Longhorn Saloon.\nDavid: Yup. Longhorn baby.\nBen: That sounds like a great name for a modest release to follow XP before we get to the big hard changes that are going to come in Blackcomb.\nDavid: Oh boy. Oh boy. Oh boy.\nBen: David, the look on your face.\nDavid: I remember being a teenager in high school at this point in time and reading all about Longhorn, Blackcomb, all the stuff on the Internet, on these new tech sites, these blogs being like, this is going to be amazing. I remember downloading new shells for Windows XP to mimic the Longhorn UI with the sidebar and the clock on the side. Oh man, what a disaster.\nBen: This was part of the belief behind Longhorn. They wanted to market all the cool stuff they were doing for it through these like developer blogs and fan blogs, even though the product didn’t have a ship date yet. Everyone got really well-versed in what was coming in Longhorn.\nThen everyone was sitting on their hands like, where’s Longhorn? They’ve been really telling us about Longhorn in a way that you would never see today. No one’s dripping out the features of something that is potentially still years away from a release. Ultimately then years go by. Five years go by.\nDavid: Could you imagine if Apple, on their developer site, were just like, hey, here’s iOS 23. Here are all the great new features we’re building.\nBen: The funny thing is they actually did that this year with all the AI features. All of those are coming soon over the next year, which I’m not saying that’s a bad strategy in the current environment, but it is a different strategy for Apple.\nAnyway, Longhorn is teased for five years. All the David Rosenthals out there are like, what the heck, Microsoft? I’ve been excited for all this crazy stuff you’re showing me. What’s going on?\nWell, what happened behind the scenes? David, what was the initial technical spark that was supposed to be the cornerstone of Longhorn?\nDavid: There were three pillars of (I think) it was all originally supposed to be Blackcomb. Then they were like, no, no, we’re going to pare it down to Longhorn. But it all ended up getting added back into Longhorn. The first of which was called Avalon. It was a new graphics engine that used direct hardware acceleration.\nI think the vision for this was like, hey, we’re going to take DirectX, bake it into the operating system, and allow the operating system to use GPU hardware acceleration.\nBen: That’s more or less it. All these code names ended up referring to multiple things because it was emblematic of the organizational disarray inside the Windows development team. But anyway, it sounds great. We can render all these really great graphics as a part of the operating system. because It’s GPU-accelerated.\nDavid: Who doesn’t want better graphics? Of course, right?\nBen: The thing that ultimately happened is the OEMs were all trying to make netbooks. They’re furious at Microsoft about saying the next new release of Windows, which has five years since Windows XP, they really, really are counting on a new version of Windows to drive PC sales, and the one that they’re getting requires pretty good GPUs.\nDavid: Like a gaming PC, yeah.\nBen: It was a total miss with what their OEM partners were looking for. But if you did buy an nice PC and you did eventually end up with a copy of Windows Vista, this is why you got to see the new, what what did they call the—\nDavid: Oh, the Aero interface.\nBen: That’s right. The blue shiny sort of thing that was ripping off MacOS Aqua. Call a spade a spade over here.\nDavid: We could tell where your true loyalty lies.\nBen: I’m just saying if you run a company where you make all your own hardware and your own software, that it’s much easier for you to hardware accelerate all the graphics in the operating system. But when you’re counting on OEM partners, you need really good communication there.\nDavid: That was one. The other one was a new web services framework called Indigo, which, I don’t know. I did a lot of research and I couldn’t figure out what it was supposed to be. I think it was a fever dream of let’s stuff the Internet fully into Windows.\nBen: Ultimately, there was a very fundamental architecture shift that just did not pan out. If you remember from the last episode, we talked about Chicago—Windows 95—and Cairo, this theoretical thing that never shipped, that was going to be the next generation operating system. Well they basically—\nDavid: They tried it again.\nBen: Did the same thing again, yeah. I think Bill Gates was a big fan of this vision because it was really technically ambitious where they had an object-oriented file system where the file system could specify data types. Then every application would plug directly into the data types that the file system knew about.\nThere were these standards, like a calendar invites a calendar invite, and the operating system has its own fields for date and time and notes. That means you’re not always traversing directory trees whenever you’re trying to search through stuff.\nAlso it meant that the operating system could actually reach into the data within files that were being stored by applications. It was a standard way of storing files in an easy-to-search way.\nDavid: And what you’re talking about here is the third pillar of Longhorn/Blackcomb, which is WinFS, right?\nBen: Yes. Ultimately, WinFS, they tried to build it many times. There was a lot of offsites and architecture reviews talking about how great it was, when in practice there was never any pull from application developers that they wanted this in the first place.\nThis was a huge part of the wheel spinning of, well, we can’t do all this other stuff in the operating system until we figure out the spec and the implementation for WinFS. Then once we have that, then we can start to do all this other stuff.\nPart of the other stuff was the .NET development team wanted to bake .NET directly into the bits of the operating system that shipped in the box and on your PCs, so .NET was everywhere. Ultimately, what happened here is—I heard this from a developer—there was many different groups who were all compiling their own subprojects and they could run them. But when it came time to try to actually do a build of this operating system and say, hey, we’ve had too many offsites and architecture reviews and restarts and this is in, this is out, let’s just try to do like a build of the OS that we could deliver. They never built Longhorn.\nDavid: It did not compile,\nBen: They could not integrate all the different projects into one, and they ended up reforking from an old Windows server version or something and adding things in one by one piecemeal to try to figure out in year four how can we get something shippable out to consumers so we can say this is our next generation operating system, and what is the minimum acceptable set of stuff that we can put in such that it looks and feels new.\nDavid: Okay. Longhorn, this is truly a disaster for the company.\nBen: Well, so 100% it is, but they were trying to talk about it like it wasn’t. I watched the launch announcement for this too. They have to. They can’t really say like nobody’s upgraded this. They come out.\nFirst of all, it’s Bill Gates again in 2006, six years after Steve Ballmer has become CEO. My opinion on this is they clearly had no idea what to talk about in the keynote because the one feature that I can really remember as a flagship feature is that alt-tab switcher that was 3D that kept bringing the windows closer and closer and closer to you.\nThey’ve got the widgets, they’ve got the sidebar, it’s Aero. They had one feature that people hated. There was a revolt called user access control, which the theory makes sense protecting users from running malicious and blah-blah-blah. But in practice, it would just overwhelm you with dialogue boxes all the time. Everyone’s just trying to figure out how do I turn off the dialogue boxes.\nThey’re standing up there at the keynote, the whole thing, the marketing message is the wow starts now.\nDavid:. Oh boy. Oh boy.\nBen: It’s a completely incohesive, incoherent set of things they’re launching, Consumers didn’t like it. Businesses tried not to upgrade. Even as late as 2009, 3½ years after launch, something like that, three quarters of corporate PCs are still running XP and had never upgraded to Vista.\nDavid: Oh it’s even worse than that. You may have this in your notes, but Microsoft OEMs were so unhappy because consumers didn’t want to buy Vista machines. Microsoft had to extend the ability for their OEM partners to keep selling XP machines to consumers for another two years after this.\nBen: Just brutal. This was the Windows culture at its worst. I worked in Office, so I have a bias here when I was at Microsoft, but they weren’t super ship date–driven, whereas Office would set a ship date three years in advance and then they would hit it exactly.\nOffice had all these really robust procedures for shipping, a triage process, an escalation process, a zero bug bounce, everything was run in this dev test PM triads. The excuse was this general guise that this is too hard to use your processes, like we’re doing alchemy over here. And because we’re doing systems level programming, none of your software development principles work on us.\nUltimately, this was the failure mode of a process that really did work for a while, really did enable technical genius, really did enable solving hard computer science problems. This is effectively the company smoking their own supply, just believing they were smarter than everyone else, and what consumers wanted didn’t matter. If they could come up with some hallucinated, cool technical thing, then that is what they should spend years doing, fighting about, and then force into the market, and the market just didn’t take it one bit.\nDavid: A couple of other things on this. One, when Vista actually shipped, just sort of process-wise, it was, Ben, as you’re saying, a complete reset. Brian Valentine comes over from Exchange, in Windows Server in the enterprise world to take over managing, getting something out the door and just cut all the features, cut all the pillars of the Windows Longhorn vision. It still takes two years in that process to get it out.\nThen immediately afterwards, Brian leaves the company. Lots of other great engineers leave the company, too. They go down the street to Amazon, and then Brian ends up leading the entire engineering platform team for amazon.com.\nBen: Wow. Oh, I didn’t know that’s where Brian went. Interesting.\nDavid: He went to Amazon. He was a named top senior-level executive at Amazon for a long time. The other thing about this whole process, that this is purely my own speculation, like nobody said this, but just as I’ve been thinking and reflecting on how seminal a moment the antitrust stuff was to Microsoft after the height of their consumer power right beforehand, I think this might be a case where Bill no longer being CEO and just being chief software architect really impacted this process.\nWhen you’re a CEO, you have to engage with your OEM partners, you have to engage with enterprises, you have to engage with customers. Not that it’s all Bill’s fault by any means, but this Longhorn Blackcomb disaster, Ben, as you say, was a case of getting high on your own supply within the company.\nBen: And if he’s only spending his time on technical decisions, you need some introduction into that feedback loop, some governor on how deep to go in re-architecting Windows for re-architecting Windows’ sake.\nDavid: Remembering back to part one, too, it’s not just that Bill was a great engineer. He was a great business person. One of the greatest of all time. He trained from birth. It’s like what company am I going to be CEO of.\nBen: The issue with Microsoft is that there is only one Bill Gates. Bill was the best engineer. Bill was the best lawyer. Bill was the best deal negotiator to figure out what the right BD situations were. Bill was not the best enterprise relationship builder. I don’t think Bill had a passion for empowering the enterprise and making sure that businesses succeeded the way that Steve was. But nobody should ever sell Bill Gates short and say he was just a technical genius. That would be wrong.\nDavid: Totally. Anyway, this is really bad. At the same time as Vista actually is coming out in late 2006, this is when Apple starts running the Mac versus PC ads.\nBen: Which is just brutal.\nDavid: And oh boy if you’re Microsoft, does that hurt? Mac sales are irrelevant. Even today in 2024, Mac sales are 8% of the market.\nBen: And what were they at this point in time? Like 2% or 3%?\nDavid: Zero. I don’t even know. It doesn’t matter. But the point is not that Apple is taking massive amounts of market share from Windows. It’s that they are hitting a nerve with consumers, with enterprises, and within Microsoft itself most importantly of shoot, we are way behind here.\nBen: And the part that really heard about all those Mac versus PC ads, there are so many were just straight up true. Oh, I’m a PC and I crashed again. To be in the halls at Apple when they’re firing at all cylinders.\nSteve Jobs is back. The iPod was a smash hit. You’re developing the digital hub strategy. Macs are starting to sell because of that. Your iPod attach rate with Macs is actually working. People are buying Macs. Macs are becoming the option that students are starting to pick as they’re picking their college computer. Market share is rising and Microsoft comes out with Vista? You just have to be besides yourself with this gift you’ve been giving. Like oh my God, look at this opening.\nDavid: Here’s where it mattered, and the timing mattered so much, too. This sets the stage for the iPhone because Apple now, in stark contrast to Vista and with these ads, is training consumers with the benefits and the joy of it just works. What did the Mac do? It just worked. What did the iPod do? It just works. What did the iPhone do? It just worked.\nBen: Because there was this pent-up demand. I remember people in 2005 and 2006 when the rumors started. There was this almost like a glint in people’s eyes. What if Apple made a phone? Wouldn’t that be awesome? And it is remarkable, like the iPhone delivered on all that promise. But there actually was, wow, what if we had technology as good as the stuff that Apple makes in the form of a phone? Wouldn’t that be great? Because Phones are so crappy. I think, yeah, you’re right. There’s something there. There was a training of associating the Apple brand with—\nDavid: It was really a setting of the Apple brand promise at this moment in time.\nBen: That’s a great point.\nDavid: And I think we got to call it here, the death of Microsoft as a relevant consumer technology company. They never recovered from this as a leader.\nBen: I think that’s correct. There’s a lot to talk about in their consumer technology offerings. I also think this is the death of Microsoft as an interesting platform for developers. Who is writing Vista apps? The Win32 API as a potential target for my new interesting, innovative application is just not a thing anymore. You have to write a Windows desktop app at this point in history because it’s where a bunch of the users are. If you need a desktop app for real for real, but probably you’re just writing a web app. You’ve lost developer hearts and minds, which is the path to losing relevance.\nDavid: I think with one exception. I think you were totally right. Nobody is writing Vista apps, but the only people left who are writing Windows apps period are enterprise developers writing custom software for enterprises.\nBen: That’s a great point. That is the exception. And of course, anyone that had big legacy applications for Mac and Windows, so Adobe is a great example of they’re going to keep that up forever. But where these new disruptive software players are coming from, they’re just not going to have Windows apps.\nDavid: Facebook is not writing a Windows Vista app.\nBen: Correct. The biggest things to hurt Microsoft coming out of Vista are what we just talked about losing developers, what we just talked about losing users. Consumers who are excited to buy a computer, they’re just not excited to buy a Windows Vista PC. But the biggest thing is they lost years of their very best talent.\nVista was a black hole. As it just kept growing and growing and growing, it would suck in more teams. As it sucked in more teams, you would get the talent that it would suck in, but then it also would suck in executives and distinguished engineer talent from elsewhere to come fix it.\nMicrosoft is about to be in a place where they need to compete and understand a changing landscape in social, in mobile, in search. They still have to fight the browser war. IE is peaking and about to start falling off a cliff and are completely consumed by Vista. I think a lot of the consumer stuff can be answered by Steve Ballmer wasn’t really a consumer-oriented technologist. That seems fair.\nDavid: I think that is true. Sure, true. But that’s not the whole answer.\nBen: Vista consumed a bunch of the smartest people, even if they had the right vision to be chasing, and the DOJ had just crippled the culture among many other things. And they were still recovering from that\nDavid: A hundred percent. In that conversation that we had with Steve, where he made the comment about my acquisitions, my mistakes, we just lost money on the bad ones, the genesis of that conversation was about Vista. He was reflecting. He said that probably was the worst moment, actually, in my tenure as CEO. because all of that best talent, everything you just said, Ben, it was off the field. It wasn’t playing. It was out of commission.\nBen: Money’s not a scarce resource. Bad acquisitions, whatever, who cares? It’s just money. But consuming a huge percentage of Microsoft’s most talented engineers. That’s company killing.\nDavid: Even taking Brian Valentine off of Exchange. Exchange was freaking killing it in the enterprise. He goes and spends two years getting Vista out the door and then goes to Amazon. Oof. That sucks.\nBen: Brutal. One other Microsoft exec put it to me. It hurt so bad that a bunch of our best systems people were leaving the company, driving across the lake, going to work for an online bookseller, and then building that online bookseller into the market-leading enterprise compute company. That is a black eye right there.\nDavid: Oh, I can’t wait to talk about that. Okay, Ben, I’m too excited for Azure. Let’s do search. Let’s do mobile, Windows 8, Zune. Let’s get all that. Then let’s talk Cloud, baby.\nBen: And David, unexpectedly, there is a through line through all of them. There’s a cohesive story that leads to Azure here.\nBut before we do that, this is the perfect time for another one of our favorite companies and longtime Acquired partners, pilot.com. For startups and growth companies of all kinds, Pilot handles all of your company’s accounting, tax, and bookkeeping needs, and is by far the largest startup focused accounting firm in the entire US.\nDavid: Also, as on our first Microsoft episode, we have to give Pilot CEO Waseem Daher a special shout out here because he’s the only Acquired sponsor CEO who is also a research source for us on the same episode. Back when Waseem was a student at MIT, he interviewed Bill Gates for the school paper. He dug it up and sent it to us. Bill talked about Microsoft’s forthcoming 40 gigabyte portable media center, and it was a pretty fun time capsule. We will link to the PDF in the episode sources.\nBen: Back to Pilot. Speaking of Bill, we talk all the time on Acquired about one of his Seattle neighbors, Jeff Bezos and the AWS-inspired axiom that startups should focus on what makes your beer taste better. In other words, only spend your limited time and resources on what’s actually going to move the needle for your company, for your product, for your customers, and outsource everything else that you need to do that doesn’t fit that bill.\nAccounting is just example number one of this. Every company needs it. It needs to be done by a professional. You don’t want to take any risk of something going wrong, but at the same time, it has zero impact on your product or customers.\nDavid: Enter Pilot. Pilot both sets up and operates your company’s entire financial stack—finance, accounting, tax, even higher-level CFO services like investor reporting. Everything from your general ledger, all the way up to budgeting and the financial sections of your board decks.\nThey’ve been doing this for years across thousands of startups in Silicon Valley and elsewhere. There’s nobody better who you can trust to both get your finance right and make it easy and painless for your company.\nBen: When you say thousands of startups, Pilot has done this for OpenAI, Airtable, Scale, as well as large ecommerce and other companies. It’s not just that they have experience across startups. They can also keep working with you as you scale to the growth phase and beyond.\nIf your company wants to start focusing on what makes your beer taste better, go to pilot.com/acquired and tell them that Ben and David sent you. Thank you to Pilot.\nOkay, search, and the alternate title of this chapter could be an acquisition that wasn’t. I think that’s a lost to history moment is the acquisition that almost happened here for $47 billion.\nDavid: Ooh, okay.\nBen: I’m just actually curious. Do you know the company I’m referring to? Do you know the the deal?\nDavid: It’s funny. The way you phrase that, I’m thinking like, oh, did Microsoft try and buy Google? I don’t know about it, but the number of course you’re talking about Yahoo.\nBen: Yes. Let’s set some context before we get to this 2008 Yahoo attempted acquisition. There were two companies that had developed programmatic advertising technology to serve and target online ads, especially in search. There was DoubleClick the market leader, and there was aQuantive.\nMicrosoft had lost the DoubleClick acquisition to Google. They bought aQuantive and that didn’t go well. It was $7 billion, and they ended up declaring basically the whole thing a write-off.\nMicrosoft is desperate for search market share, and between their internal efforts with MSN search and I believe it was called Windows Live Search, they were not making much progress there. At the same time, Internet Explorer had totally languished. Microsoft had completely taken their eye off the ball of the browser wars from 10 years earlier, and IE was just widely regarded as a garbage browser.\nWeb developers hated it because it made you write a bunch of weird, custom stuff, so randomly things wouldn’t work in IE. Users hated it because basically nothing new was coming. Every time a new version of the operating system would ship, it just felt like it’s the same old Internet Explorer over and over again.\nAnd you have Firefox coming on the scene starting around 2007, where it was really making a dent, and Google was the default search from Firefox. Firefox was awesome. It had tabs. IE didn’t have tabs at the time.\nDavid: That’s right. Oh my God.\nBen: I don’t think Safari had tabs either. Chrome wasn’t a thing yet. I know I’m, on the one hand, talking about search, on the other hand talking about the browser, but it’s the same pot of gold.\nDavid: But it’s the same thing. It turned out search was the business for the browser.\nBen: The thing that you have to realize is the browser is the front door to search. Search is heavily, heavily monetizable. If you’re Google and you can monetize it directly, that’s great.\nBut let’s say you’re not Google. Let’s say you’re Firefox or Microsoft or Apple. You don’t have this incredible business model of people bidding on the keywords for search and all the R&D to go into making search good. But you actually do have the user attention the front door.\nWell, you get to monetize it, too. The rumors are that Apple makes something on the order of $20 billion a year today in 2024 from Google as being the front door to Google, sending all of the iPhone search traffic to Google.\nDavid: This is the traffic acquisition cost in Google’s financial statements.\nBen: Absolutely. If you can be in the business of operating a scale search engine, or you can be in the business of directing traffic to a scaled search engine who is willing to pay you for that traffic, it’s going to be a great business. David, as you just said, the way to monetize the browser is owning and operating or directing to a search engine.\nSearch isn’t going well at Microsoft. At first it was because they just didn’t take it seriously enough. When Google first started in 1998, I think there was a lot of skepticism that the auction-based advertising business would really work. Then there was skepticism that it would really scale. And that when it went public, people were looking at it almost freaked out at how profitable it was.\nThen even after that, people didn’t really realize that being the market leader at search was way better than being number two. There are these massive, massive returns to scale. The reason for that is just pure marketplace liquidity.\nIf you have the most searches, you can create the best data from the searches, and you can return all the best results because you have the most data. On the advertiser side, you have the most advertisers who are willing to come in and bid to the highest possible price. You just get to make the most money by a country mile versus other search engines.\nDavid: And then it locks in even further because you can spend more CapEx on the data centers, more on R&D and make the search better, more performant, faster and all that.\nBen: Google is search as monetized by an ad-based auction is one of the world’s true marvels. It’s one of capitalism’s greatest discoveries.\nDavid: We may or may not do an episode on Xbox someday, Ben. That’s for Ben and I to discuss privately, for the parents to discuss after the kids go to bed. But we’re definitely going to do an episode on Google.\nBen: It’s criminal that we haven’t. So Microsoft is really nowhere to be seen in search. Part of it was just thinking, oh, well search is just a feature of MSN, but there are all these other reasons to come to MSN. Or hey, this is a product in the portfolio of Windows Live. We can do it with the talent that we have here.\nUltimately, someone needed to grab leadership at Microsoft early 2002–2003, shake them, and say nothing else matters in the next five years except you figuring out how to meaningfully participate in search revenue, because that is just the next big wave in technology, and it’s a fantastic business.\nDavid: You needed the equivalent of the J Allard Windows: The Next Killer Application on the Internet, or the Sinofsky Cornell’s Wired memo.\nBen: So in 2008, Microsoft puts a deal on the table that gets bid all the way up to $47 billion to buy Yahoo. This was effectively their last Hail Mary to become relevant in search. They actually didn’t launch Bing until 2009. Google was started 1998 and went public in 2004. Microsoft got serious about a branded search engine in 2009.\nBut clearly before that they’re starting to realize this is a big deal, we need to participate in it. What do we do? They’d been negotiated by Yahoo 2008 after a bunch of negotiating and flying back and forth. Finally, both David Filo and Jerry Yang fly up to Seattle, Steve Ballmer goes to Boeing Field, and they have a meeting at the airport. This is one of the great ‘what if’ scenarios.\nDavid: This feels like an episode of Entourage.\nBen: It’s totally right. There are conflicting reports of what happened. From what I can tell, Bill and Steve looked the Yahoo guys in the eye and decided these guys are jerking us around. They really don’t actually want to be a part of Microsoft at all.\nThis has gotten so expensive that if we execute the transaction, or God forbid they even try to negotiate up even higher, it’s just not going to go well because it’s going to be an organ rejection here. The deal completely falls apart. It’s interesting to try to look at the deal and figure out, even at that high price of $47 billion, was it a good deal for Microsoft? So here’s how to pull it apart.\nDavid: I’m laughing here. I was hoping I could surprise you. It’d be at the end of it, have something to say here. But I think you’re going to take my thunder.\nBen: Let me know when I do and tell me if it rhymes with schmalibaba.\nDavid: Yes. It’s because I’m just loving, I’m smiling the whole time. I’m imagining, all of you listening being like $47 billion for Yahoo. What are they smoking? Keep going.\nBen: Here’s how to pull it apart. Yahoo had about 15% market share of search, which I think was number two. Google was way, way, way ahead. On the face of it, you’re thinking wait, $47 billion to buy 15% market share in search? But there are actually two other assets here. There’s Yahoo Japan and there’s a stake in Alibaba,\nDavid: Not just a stake.\nBen: Which famously is one of the greatest investments of all time.\nDavid: 40% stake of Alibaba.\nBen: Collectively, those two assets together are worth over $30 billion. If you back it out, it’s really only $15 billion to buy 15% of the search market. David, what is Google’s revenue today?\nDavid: Alphabet’s annual revenue in 2023 was over $300 billion.\nBen: Would you want to pay $1 billion per percent of market share of that market?\nDavid: Yeah, sure. It’s just money. Why not?\nBen: It’s the craziest thing. This would’ve been ludicrously profitable to spend only $15 to buy 15% of the search market, which is way bigger than $100 billion and still growing.\nDavid: This is the thing people just always continually underestimate and underappreciate about the search market, is it’s just so large and so profitable.\nBen: Yes. Now, because this is counterfactual and we actually don’t know what would’ve happened, Yahoo completely went away. They sold for $5 billion in their most recent transaction to be co-owned by Verizon and Apollo. There’s this real question of like, okay, if Microsoft bought all that traffic, would they actually have been able to harness it and build a Google-like business? Or would it have just gone the way that Yahoo was going to go anyway?\nBut to make the bull case on that, Bing is a good business. It just has a small market share. Microsoft succeeded finally in 2009 at attracting all the right talent, taking it really seriously, and building a super viable search engine that does—I don’t know–something like $1 billion a year in profit?\nDavid: Well, then they do go on and launch Bing and they actually sign a commercial deal with Yahoo to provide the search on the back. They’re not getting the Yahoo traffic. Yahoo’s still monetizing the traffic, but Bing is getting all the data from doing, performing the searches for Yahoo. I know you know this, but most listeners will not remember. You know who the leader of Bing was for a brief period in its early days here.\nBen: Satya Nadella.\nDavid: That’s right. Other piece of Satya trivia that I very much suspect you do not know. Satya joined Microsoft first in 1992 from Sun Microsystems, and he joined as an evangelist for Windows NT.\nBen: He joined as an evangelist?\nDavid: An evangelist. And then he got his first product job. Do you know what product, it would never ship, but a product in development that job was?\nBen: Ooh, no, I don’t.\nDavid: Tiger server, the CableSoft information superhighway fever dream.\nBen: Where did you find that?\nDavid: It’s in his book.\nBen: Oh my gosh.\nDavid: It’s in Hit Refresh.\nBen: I always thought he was in the marketing side. Well at Microsoft, product managers are marketers. They don’t live in the engineering org.\nFascinating. There are so many things about his history that are not a part of the common narrative. Like he (I think) worked in Dynamics, their Salesforce competitor, their CRM for a while.\nDavid: Which they had acquired. Then he (I think) ran BizTalk server, which was another one of these enterprise server products. Then Bing.\nBen: Wow. And then they plucked him out of Bing to go run Azure, right?\nDavid: And go run Server & Tools, which we will get to that in a minute.\nBen: Okay, some of the other fun tidbits of this Yahoo deal. Bing powers Yahoo search. Microsoft does the ad sales for both sides. While Microsoft don’t have the direct relationship with the users, they do get to build up their marketplace liquidity on the advertiser side. As you mentioned, there’s a huge data advantage of actually powering the search.\nWhile Yahoo gets 88% of the revenue in the deal for the first five years, arguably the value from this basically all accrued to Microsoft because they ended up building out not only a proper advertising business, which now is used on a number of different sites—I think even in partnership with Netflix—for their ad supported tier, but also being, once it had all the Yahoo traffic, needed to be a scaled web service. Like a distributed computing system that operated at 24x7 uptime, with super low latency, fast response time, and huge scale.\nDavid: God, that sure sounds like the cloud.\nBen: It sure sounds like the cloud. You’ve got Xbox Live where they have 40 million users. You have a scale search engine, which is like the number one most difficult distributed computing problem, that if you get good at that you can get good at lots of other stuff. The ingredients are really starting to come together for the right talent and DNA at the company to do well in building out the cloud.\nDavid: So funny. The other big piece of it, honestly, maybe even the biggest piece of it from talking to folks was Hotmail. Microsoft had acquired Hotmail back in 1997 and ran it the whole time. It eventually became outlook.com I think. But it’s running a consumer web service for decades at scale.\nBut oh my God, it’s so unfortunate that they didn’t buy Yahoo just because of the Alibaba stake. Nothing else would’ve mattered. Forty percent of Alibaba at IPO in 2014 when Alibaba IPO stake was worth $92 billion. Obviously, Microsoft is not a hedge fund, but—\nBen: These things are hard because how long would Microsoft have held that?\nDavid: Totally.\nBen: But man, if they did, that’d be crazy.\nDavid: It’s so funny, yeah. One of the greatest venture investments of all time.\nBen: Yup. Okay. At the end of all this, you might be wondering why was search so important? How did Microsoft get so obsessed with the search engine? Why are they still running Bing today? Why has it been this white whale for them where they continue to try over and over and over again to do search deals or acquisitions or things like that?\nWell search monetizes incredibly well. Microsoft is sitting there realizing, okay, we’re a technology company. Historically what we’ve done is sell licenses of our software and people have paid us directly. But there’s this new business model emerging that appears to just scale infinitely, where you can make three times or more off of each user, again, using software but not selling the software to them. That’s a much better business.\nIf I could take seven billion people in the world and sell them Windows, or I can take seven billion people in the world and have them use my search engine for free and then make the money from the advertisers, I’m going to make 3x–5x more money from the advertisers that I actually would selling them software. Suddenly this becomes existential where the Windows revenue isn’t going away, but actually the next generation of economics generated from software is not selling the licenses. It is monetizing via advertising.\nDavid: It’s funny. I never thought about it this way, but really what Search did and what Google does is you go from selling software as a technology company to selling everything.\nBen: And offline economy is much bigger than the software economy. Everyone has to acquire customers, whether you make software or tents or airline tickets. There’s only a small set of dollars that goes to software. If I just pull up my credit card statement each month, how much software am I paying for versus how much everything else am I paying for?\nEven if you say, well that’s not really fair because it’s advertising for everything else, it’s not everything else directly, even a small percentage of my everything else turns out to be way bigger than my software budget.\nAt the end of the day, Microsoft made a browser. They didn’t monetize that browser. They monetized using it to defend an operating system that they sold licenses to. Eventually Google comes along and creates a browser. They also don’t sell that browser, but they monetize all the traffic coming through that browser and they do it way better than Microsoft does at monetizing selling licenses.\nMaybe put it more simply, Microsoft built a browser, had a bunch of share, and then looked around and said, we don’t really know what to do with it. I guess we’ll use it for defense. Google built a browser and said, we know exactly what to do with this and they used it for offense.\nDavid: Such a good point. Well, while we’re talking about using software to sell everything and not software, that sure makes me think a lot about social and Facebook. Microsoft has some history there during this period too, doesn’t it?\nBen: They do, David, should we take a brief aside to talk about Microsoft’s intertwined history with Facebook?\nDavid: Absolutely.\nBen: It’s October of 2007. Microsoft is missing search, and they’re realizing social seems to be a wave that’s coming 5–6 years after search. Also a great online advertising business. We now deeply understand and regret not being a bigger player in that business. We can’t let it happen again.\nWhat do we do? We’re not going to build one of these internally. We know better than to do Google Plus. We are not capital-constrained. We are very willing to try to do large acquisitions because we’ve got money lying around, but we don’t have talent lying around and we don’t have…\nDavid: DNA and brand to be able to do this.\nBen: Exactly. What do you do? You try to buy Facebook. Microsoft puts an offer on the table. It’s a very complex deal structure, but effectively what it does is it lets Facebook shareholders cash out over a long period of time as the company’s value grew. You’re not taking all your money off the table today.\nThe important thing to take away though is a very big dollar valuation. News outlets reported it to be worth $24 billion. Again this is way back in 2007, three years after the founding of Facebook.\nDavid: We’re not that long after the Yahoo $1 billion offer.\nBen: Exactly. Facebook’s not interested. I’m pretty sure Zuck doesn’t even respond to the offer. Some of Zucks lieutenants have been meeting with Microsoft people saying, if you get the number in this range, blah-blah-blah-blah-blah, they send in an offer.\nDavid: We’ll have to ask Mark about it in the Chase Center.\nBen: We will. No dice. Instead they work out an investment and a commercial deal. The terms of the deal are in October 2007, Microsoft invests $240 million for 1.6% of Facebook. For those trying to do the math at home, that is a $15 billion valuation on the deal. Microsoft will get the exclusive right to sell banner ads on Facebook internationally until 2011.\nAgain, Microsoft cleverly is using this as a way to bootstrap the advertiser side of their marketplace now that they have all this inventory to sell. Now, it’s interesting to think about, much David like your comment about Alibaba, if Microsoft sold all of it at IPO, which I don’t think it did, that would be a 7x.\nDavid: That’s a pretty good growth investment in a few years. Not bad.\nBen: From 2007 to Facebook’s IPO in 2012?\nDavid: Yeah, 5 years, 7x, that’s good for growth investment. That’s great. I’ll take that.\nBen: If they held for another 2 years and sold in 2014, that would’ve been a 14x. I actually don’t know when they sold, but I feel like these are helpful guardrails to understand what this appreciation could have been. Either way, it’s not really relevant to Microsoft.\nDavid: As I said earlier, they’re not a hedge fund and money is the least important thing to them.\nBen: They’re constrained by talent, execution ability, DNA to pull it off focus, but they’re not constrained by cash. Who cares a few 10x to your 240 million over 5–7 years. It seems like the actual interesting part of this deal is the fact that they had the right to sell Facebook’s international ads for four years, and the companies became friendly. Facebook on the pages for businesses would use Bing maps and there was all this reciprocal things that the company did together.\nDavid: And a lot of Microsoft people went to Facebook, like friend of the show, Vijaye Raji, CEO at Statsy now. A lot of great early Facebook folks came from Microsoft.\nBen: Right around this time, June of 2008, Bill Gates leaves the company full-time. It is an actual retirement. I’m no longer a chief software architect, I am still chairman of the board, but I’m going to go be the…\nDavid: Full-time at the foundation.\nBen: Exactly. At the Bill & Melinda Gates Foundation.\nDavid: Which, of course is right at the time the iPhone of course came out in 2007. But 2008 was when, I think it was iOS 2.0 with the app store opening up and the SDK comes out, and the world completely transforms.\nThere’s a pretty rough quote in Time Magazine from Bill’s retirement that was obviously written about Bill here, but I think it’s just more applicable to all of Microsoft DNA at this point in time. “Gates is probably getting out of technology at the right time. Funnily enough, it’s not really a business for nerds anymore. Gates was at the center of the personal computer revolution and the Internet revolution. But now the big innovations are about exactly the things he’s bad at. The iPod was an aesthetic revolution. Myspace was a social revolution. Youtube was an entertainment revolution. This is not what Gates does. Technology doesn’t need him anymore.”\nBen: That’s a stupid quote. That’s just too reductionist.\nDavid: Yeah, it is totally too reductionist. It’s too personally about Bill and that’s just completely not right.\nBen: But that was the view at the time. This really shows you how irrelevant people thought Microsoft was.\nDavid: That is why we included it.\nBen: No one would’ve been saying this about Microsoft in the Windows 95 timeframe. But after the obsession with enterprise, the complete failure in consumer markets, but importantly the complete ignoring of what the exciting developer platforms were at the time—open source, the web. If you think about where all the development efforts were going, it was the LAMP stack (Linux, Apache MySQL, PHP), the stuff Facebook was written on, that’s in a different universe from Microsoft’s enterprise developer customers.\nI just think you need developer excitement if you’re going to have consumer excitement. Or you need to develop every interesting app on your platform yourself. But that’s just not how it goes. Consumer and developer excitement goes hand in hand.\nDavid: I said to put a pin in the iPhone and the downside of Microsoft becoming the enterprise juggernaut, when we were telling that story. All of the huge advantages in lock-in that Microsoft had built up, the iPhone changed that calculus because the iPhone kicked off shadow IT, bring your own device, and it kicked off the user revolt against IT. This is what this quote encapsulates.\nBen: I think that’s right. I think a set of technologies were breaking through. People are just going to use those devices and that software no matter what. The era today is one where users have way more choice in what they use at work than they did in that early 2000s era, and the iPhone forced that door open.\nDavid: Choice and expectations of what that software and hardware is going to be like. Microsoft for all of its great victory in the enterprise over this period, just fundamentally did not have any of that DNA in the company anymore. That’s what this quote from time is pointing out.\nBen: They were all over an Xbox.\nDavid:. Okay, fair enough.\nBen: Or they were developing cool new stuff that would then get killed because it’s not a part of the Windows machine. You look at Courier, you look at Kin in mobile, you look at all these things that they would let them get so far, and then they’d be like, ah, you guys don’t get it. Windows is the center of everything. If it doesn’t make Windows look great or it competes with Windows, that’s not what we’re doing. I think that DNA was too strong to overcome disruptive innovations.\nDavid: Exactly. Let’s talk about those things and what’s happening in mobile.\nBen: Okay. let’s rewind. What was Microsoft doing in mobile so far?\nDavid: A lot,actually.\nBen: A lot, actually, is right. Microsoft was obsessed with all sorts of things, and particularly Bill Gates for decades before they became true. One of which was Bill Gates was always talking about mobile computing, so much so that in the key slide in the Windows XP presentation, one of the big bullet points is mobile computing. All the way back in 2001. Gates thought natural user interfaces was going to be a thing. Multitouch tablet computing. Pen computing.\nDavid: I had a Microsoft XP tablet edition I think is what it was called PC in college.\nBen: From the early 2000 and sometimes even before that, these were Bill Gates’s visions of the future that he thought were pretty close. In the world of, I suppose they were early smartphones, Microsoft had developed Windows Mobile.\nWhat was this? Is that like iOS? Not really. What Windows Mobile was was an operating system for handset makers to adopt and put on their handsets. These things looked like Blackberries. They’re mostly keys with a little screen.\nWhen you looked at it, it looked like Windows. It had a little start menu. It was much like the rest of the enterprise strategy, David, designed around all working seamlessly together with your Windows PC, Exchange, and your corporate network. Because surely people at home, consumers were not using smartphones. These were for business people who were issued by their enterprise. So it fits pretty squarely into the enterprise category.\nNow, how did Microsoft think about this product? They thought about it as an ingredient into the handset maker’s product. Microsoft was somewhat at the whim of an OEM in the computer ecosystem. The Dell could install some more stuff on top of Windows and customize the installation, but it was still Windows XP no matter who the PC was from. It was a pretty standard thing.\nThat really wasn’t the case with Windows Mobile phones. The handset makers could modify the code of Windows Mobile. When you bought a handset, first and foremost, you were trusting the product quality of the people at the handset maker. They had several OSes that they could buy and effectively start from. One of which was Microsoft.\nWe’re handset makers. We make a phone, and we know how to interconnect and do all the carrier stuff with the carriers because they’re our partners. We need it to do a bunch of computer stuff, too, like email and stuff, so can you guys do all that? Then we’ll make sure when we get that from you that we’ll start changing your code to make it work with our phone, and we’ll do all the phony stuff.\nDavid: Not an iPhone.\nBen: What was Microsoft’s position in mobile? Yes, they had Windows Mobile. But no, it was nothing like what smartphones would become because of the way that the iPhone reset everything.\nDavid: At some point in this journey here, post-iPhone but still in this weird Windows Mobile era, Microsoft buys Danger, the company that made the T-Mobile sidekick. You remember that?\nBen: Which was awesome. You pushed a button and then it would flip around and suddenly you were on a sideways keyboard.\nDavid: Oh yeah. It was in Entourage. I remember watching Entourage. Turtle had one, I think.\nBen: That’s right. That was Andy Rubin before he started Android.\nDavid: Oh you got me. I was hoping I could stump you. I was going to say, do you know who’s the co-founder of Danger was? It was Andy Rubin.\nBen: What do you think I do for a living?\nDavid: What do you think I’d do for a living? Amazing. Andy had already left danger and started Android.\nBen: Which would be the very thing that would destroy their mobile business. But let’s get there. SO 2007 in January, the iPhone is announced. It won’t come out until July. The iPhone comes out. It’s the most spectacular technology demo since The Mother of All Demos, the old Doug Engelbart one way back in the day.\nConsumers are all in awe, the existing mobile industry people can’t really believe it’s real. The founder of Blackberry basically said, I think his exact quote is, “How did they do that?” Then later says, “We’ll be fine.” You have Palm who was already saying things like, I believe the CEO even before the announcement said “The PC guys are not just going to figure this out. They’re not just going to walk in.” Famously, David, I know you have it, Steve Balmer has a quote after the announcement.\nDavid: Yes, and he says, “It’s never going to work at $500,” which is the full quote. You could totally see that phones at this point in time, flagship phones were costing like $100 with carrier subsidies. Steve’s like $500 that price? Who’s going to buy that?\nBen: There are actually two quite interesting things about this quote. (1) Steve is being the company salesperson. If a competitor drops this amazing bomb and you’re interviewed and you have a whole bunch of enterprise customers who are looking to you, what do you say? You say, are things still great? There are things really expensive. Of course you say that you are literally always selling all the time. I always take some issue with that. (2) Apple legitimately had a business model innovation there with the carrier subsidy.\nDavid: But it wasn’t the original. The original iPhone didn’t have it. It was then later, I think the 3G?\nBen: The mobile industry to this point had been how do I make the cheapest possible phone? Certainly not a scaled down version of a Mac, which is what the iPhone was. That was a completely different paradigm. This is a tiny computer, not a crappy embedded system that is optimizing for pennies.\nApple basically said, we don’t care if it’s really expensive. We just think this is the user experience bar and we will figure the business model out. Eventually, my God, did they figure the business model out and the carrier subsidies were that innovation. But Windows Mobile was that old paradigm—embedded systems, cheap as possible hardware where a couple of cents either way determines whether your phone’s going to sell or not, so it was pretty shocking.\niPhones start selling. They’re selling well. It’s 2008. Apps start coming out. It’s 2009. Sales start really picking up. Finally, Microsoft decides, hey, what we’re going to do is we have this old asset, Windows Mobile. We can repurpose some of that to make this new thing called Windows Phone.\nUnfortunately, everything we’re optimizing for is different. The new ecosystem expectation is a super high quality user experience. There’s this way that we used to work with all of our hardware partners, which basically said, we will make the software work on whatever. You can come up with the crappiest hardware you can think of and we’ll make it work.\nIt’s like the Roku strategy, the way that they work with all the embedded TV makers. The new strategy had to be, we will dictate really intense hardware requirements because now with Windows Phone, we are making a promise to users to compete with the iPhone where Microsoft is backing that up.\nThe Microsoft brand is first. We’re defining a really breakthrough new user interface called Metro that actually came from the Zune, which is funny that that’s its lineage. Now, how did it actually play out? Microsoft tried to use their existing business model. We will sell you an operating system, we will charge you a royalty.\nDavid: We will sell you OEM manufacturer an operating system.\nBen: Correct. You sell that phone. People want good phones now. You can probably generate some nice margins on that good phone because the iPhone really set the bar.\nThere’s just one problem with trying to maintain your old business model. It’s that you don’t have the same competitive set that you used to. You now have Google. Google has acquired Android. Google has transformed Android from a Blackberry clone into an iPhone clone. The software is open source. Google’s value proposition is they go to all those same manufacturers that Microsoft used to work with—HTC Motorola.\nDavid: And say, hey, how about a deal for $0?\nBen: Yup. Deal point number one, here you go, it’s free. Deal point number two, you can even have the source code. Deal point number three, we aren’t Microsoft. Look at what they did to the PC makers. Do not let them do that to you. You know those PC makers? They make no money. Zero the profit dollars in the value chain accrue to these PC makers, they all accrue to the software vendor. It’s literally the same people who did that to the PC makers. Why would you let them do that to you?\nAnd remember, in this mobile world, every cent matters. Microsoft is trying to ask for, whatever it is, some single digit number of dollars for a licensing fee of the OS. I think I’m undershooting, but let’s even say it’s $5. That is a mountain of difference between $0 and $5.\nDavid: In a low margin business.\nBen: In the total bill of materials of these things, exactly.\nDavid: And Google also only really cares about their services that they monetize through advertising. One of the deal points in there, I think this may be varied by geography, but is oh yeah, you got to use Google services on there too. But by the way, they’re best in class and they’re free. You don’t have to pay anything for that either.\nBen: I think at first it was, you can have it open source, but you don’t get any of our services. Or you can take the whole thing and you take all of our services, but our services are great and guess what? The Play store is one of our services. if you want all the apps, then you have to take all the other Google services too.\nDavid: Right.\nBen: Now keep in mind, how does Google make money? They make money on search. Google, from the moment they figured out, hey, we can run a call it 2002, when Google’s search business model was really hardened and it was evident this will scale, it’s ludicrously profitable, it’s very high value per user, Google’s going to be the number one at it. It’s almost like if you really thought about it, you could have figured out that Microsoft wouldn’t win in mobile.\nIt’s a really circuitous path, but if step one is Google makes a ton of money on search, then step two is Google should try to get all the searches. Then step three is Google needs to have the front door to search. You have to count on Google being the actor that figures this all out. Step four is Google figures out what the next platform is and make sure that they are guaranteeing all the search volume comes to Google from them.\nWhat do they do? They invent or buy a mobile operating system. What do they do after that? The next step, they give it away for free because again, all they care about is all the search volume. Therefore, unless Microsoft adopts Google’s business model, they’re immediately screwed.\nDavid: This is such a good point. Microsoft’s competitor was not Apple and the iPhone. It was Android.\nBen: It’s a little bit butterfly flaps its wingsy, but there is a direct line over a 10 year period from Google finds its web-based search business model, and Microsoft cannot employ its traditional business model and win in mobile. Microsoft will lose in mobile.\nThere are some pivots in there. I think the biggest moment when the door really shut is when Verizon freaked out after the Apple and AT&T deal, and said we need an answer. They decided that answer was Droid and they put like a gajillion dollars behind the Droid advertising campaign.\nDavid: The Moto Droid, yup.\nBen: I think at that point it was a two horse race. Microsoft probably could have figured out a way to get in before that, but it is all related to Google finding that orthogonal business model.\nDavid: It’s funny. Microsoft did have Bing at this point in time, so they did have a business model that they could have used if they’d been willing to go free on Windows Phone.\nBen: And it would’ve taken a big culture shift at Microsoft to say we’re an advertising company. Microsoft is not a company that is, at least at this point in time, comfortable with their bread being buttered from advertising. They’re the PC company. They want to sell software to people using PCs.\nDavid: They’re the software company. They sell software. Might be via enterprise agreements, but they sell software.\nBen: Then if you really believe this step by step by step thing, then actually what Google should keep doing is finding things that Microsoft sells, figure out which ones are the cheapest per user to run, and then give those away for free. Outlook Exchange, geez, Gmail. Word, Excel, PowerPoint. Oh, G Suite Workspace. All they’re doing is they’re just looking at Microsoft’s core value propositions they charge money for, and Google says, would it really be that expensive if we just gave that away for free?\nAnd the more of those that they do, it’s good for Google’s business model because they just get more data, a closer relationship with you. You’re doing either more queries or you’re interacting on their platforms in ways where they have other ways to show you ads. Maybe while you’re off platform. Now they know a lot about you from data they’ve collected, blah-blah-blah. But even if it doesn’t actually make more money for Google, they make so much money in their core business that if it hampers Microsoft , then it’s a good thing to do.\nDavid: Interesting. That is totally true. I totally buy it in the consumer world. And in the enterprise world, Microsoft lock-in is still as strong as it ever has been.\nBen: And Google has really not figured out how to be an enterprise company.\nDavid: Excel is still the main way that spreadsheets are done around the world. I bet a lot of listeners use Google Sheets. We do too. We love it. Also use Excel. But if you do use Google Sheets, you are in the minority\nBen: Globally you think?\nDavid: Yeah.\nBen: I guess because most consumers don’t actually use spreadsheets.\nDavid: Enterprise spreadsheet work is done in Excel. Full stop.\nBen: Yup.\nDavid: That brings us to Nokia, but I think let’s save Nokia for the end here.\nBen: Yeah, Nokia is our coda. What it does bring us to is a realization from the very top of Microsoft that the profit pools in mobile are changing. This is a thing that I think Steve Ballmer also doesn’t get credit for.\nBill Gates was obsessed correctly with being the software company. It was a brilliant business strategy to be the software platform. Then everything around you had to interoperate with you.\nAgain, the profit pools in the PC world just accrued to software vendors. It was remarkable how the PC manufacturers over time had no profits and Microsoft had tremendous profits.\nSteve Ballmer realized pretty early, I think because of the Google Android thing, mobile was going to shake out differently. Future hardware platforms were not guaranteed to have the same profits in the value chain the way that the PC did.\nHe was pretty aggressive about actually we need to be in the hardware business. I know that seems really unattractive to us as a company because we’ve been in the software business. There’s this great general rule that it’s really hard for any business to enter a lower margin business than the one they are currently in.\nDavid: Amazon can go from ecommerce to AWS.\nBen: Amazon can go anywhere. But for Microsoft, you’re selling software licenses, it’s hard to even get into cloud because cloud is a lower margin business. You have to operate those data centers than just selling the licenses.\nIf you’re Microsoft and you’ve been making software all these years and you’ve been enjoying those margins and suddenly you’re realizing uh-oh, we have to be in the hardware business, or at least if we’re not in the hardware business or the search business, we are not going to enjoy any of the profits in the mobile era. That’s a difficult conundrum. But to Steve’s credit, he acted. They released Surface, they tried to buy Nokia.\nDavid: Let’s talk about it. Let’s start with Surface and Windows 8, which we got to talk briefly about Windows 7 before that, because Windows 7 was awesome.\nSteven Sinofsky ends up running office product management. After the Vista disaster, he gets drafted to come over and run Windows. Ben, like you’re saying, the Office culture was known as we ship product. That’s what you were part of. That was the culture that Steven set\nBen: Mind-bending that three years in advance, a date is set and then 6000 people ship on that date no matter what.\nDavid: Yup. He comes in for Windows 7 and he does that for Windows. We were talking to him, and he had this great analogy of Windows at this point in time, didn’t need technical vision. It was trying to be the Dodge Viper. That’s what Longhorn was. It needed to be the Toyota Camry. He comes in and he makes Windows 7 the Toyota Camry of PC operating systems.\nBen: I love that analogy. That’s exactly right.\nDavid: It’s so good. It’s exactly what it was. It’s exactly what everyone wanted. It’s what the consumers who were still using Windows wanted. They wanted it to just work. Most importantly, it’s what the enterprises wanted.\nBen: Everyone’s like, hey, it’s like XP but modern. Or it’s like Vista without all that random stuff and all the regressions that Vista had.\nDavid: Do not crash my devices or my network. Thank you.\nBen: Nice easy Start button in the lower corner. Normal predictable menu. Fast search, fast file system. I honestly can’t tell you a feature that launched in Windows 7.\nDavid: I have no idea. But I remember I had a Windows 7 laptop when I first joined Madrona and it was great.\nBen: It ran everything the way you expected it to. The product that Sinofsky shipped there was just as much the new organization as it was the actual product that customers experienced. It was a much more slimmed down team. It was dev test PM, it was ability to hit a ship date. It was a proper planning and vision process.\nA lot of what the team was doing with Windows 7 was, yeah, yeah, yeah. We feel like we can do 7 with our arms tied behind our back, but let’s start thinking about the future, about what we’re really going to do now that we have all the infrastructure in place to really ship an interesting product.\nDavid: And then Apple comes out with the iPad in 2010.\nBen: Windows 8 vision had kicked off. The planning process for what it’s going to be had kicked off. They’re starting to play, actually, Steven puts these videos on YouTube, they’re awesome to watch the original vision of what Windows 8 should be.\nThey’re out on a limb. They’re saying the future is touch. The future is tablets. We think that’s going to be a dominant computing paradigm. On the one hand, Bill Gates has been saying this for years. There’s a cultural acceptance with the idea. On the other hand, it really hasn’t manifested in the market, so it’s a little bit dangerous to say—\nDavid: But the iPhone has now come out and multi-touch has shown this is the way to do it.\nBen: But you’re right. The iPad coming out really validates, whoa, big tablets with multi-touch actually might be the computing paradigm for the future. Ph my God, we’ve been in planning, we’ve been in development for a year or two already. This thing hits the market. We’re right, we are so right. We’ve been validated.\nDavid: It validates the product vision and it terrifies Ballmer and Microsoft leadership, because they just watched what happened, what Apple did to the phone market. The iPad sure as hell looks like it’s going to try and come do that to Microsoft’s core PC market.\nThe original Jobs keynote introducing the iPad lays out his vision of the PC is going to become the pickup truck and the iPad is going to be become the car. That would be a truly terrible thing for Microsoft, especially if that goes into the enterprise as the iPhone is clearly going into the enterprise on the phone side.\nBen: Now, there was a little bit of a folly in believing that the iPad was the PC of the future. Standing here today, we all can look at unit sales and realize, oh, the iPad was not the PC of the future. It had its place, but it did not in any way replace PCs. And it turns out that Apple scaling up the iPhone metaphor was good for tablets, but that never was going to take over most PC use cases today. In fact, the phone has far more replaced the PC than the tablet has.\nDavid: A hundred percent, yes. But back in 2010, that sure looked pretty terrifying as a prospect to Microsoft.\nBen: The other thing that’s happening around this time is, I’ve said this a number of times, but Windows, despite having great revenue, great profits, massive penetration in the enterprise, and momentum almost just like staying power in consumers because people were just used to it, it was not relevant for the next Frontier.\nDavid: Totally not.\nBen: It did not have hearts and minds. It was not where the excitement was. It was not what people were building for. There’s a two birds with one stone attempt with Windows 8: (1) Touch tablets. We are going to get out ahead of Apple, we’re going to try to out-Apple Apple here, and we’re not going to let what happened in phone happen to us in our core market of PCs. (2) We need a new developer platform.\nDavid: We need to bring developers back.\nBen: Everyone’s building for the web. Web is agnostic to what operating system it runs on. Can we create a platform that is so exciting for developers that they’re going to use it? And we should lean into the technologies people are already using.\nThe Windows 8 touch mode Metro UI development environment was HTML5 because all these web developers are already writing their web apps, we want to support that too, and we’re going to build a whole new tool chain so that their HTML5 Windows 8 apps run really well on ARM processors, because these tablets are going to run on ARM processors.\nDavid: And we’re going to make our own the Surface RT.\nBen: That’s the two-headed dragon of Windows 8 is new developer platform and touch-first.\nDavid: And the way the touch first manifests in the operating system itself is the desktop is now just an app. When you boot up Windows 8, you are presented with a tablet tiled start screen. If you are looking for a desktop, oh you got to go find it..\nBen: Now in practice, it’s not hard to find the desktop. You learn it in five seconds. You’re like, oh, okay, I see. The start screen is actually the Start menu, but full screen. If I click in the bottom left corner, I can collapse it. I can enter the desktop mode and then it’s like it doesn’t even exist. I can run my Win32 apps, blah-blah-blah. But there is a learning curve.\nDavid: There’s also just the shock value though of I bought a Toyota Camry expecting it to be a Toyota Camry, and I don’t even know what this is. It’s like a scooter.\nBen: It is a little confusing. I used it for a long time when I worked at Microsoft, and figuring out how to app switch between things that are part of the Metro modern UI versus the legacy apps and what’s sitting on my desktop and what’s sitting in the tablet-optimized app switcher, it mixed two metaphors.\nNow the question is why did it mix two metaphors? And it took me a while to figure this out. What ended up happening was the original vision for the Windows 8 touch thing that we’re all talking about, these live tiles, that was supposed to only ship for tablets as it was originally dreamed up. There was a version of Windows 8 that did not have that that was going to ship for desktop PCs.\nDavid: That was going to look like Windows 7 probably.\nBen: Word comes down from on high, Windows is Windows. We need to ship Windows across all devices. What happens? All this effort, momentum, political capital, and betting your career has gone into this HTML5 developer community, the Metro UI, that is the desktop version that ships.\nDavid: I see, yeah. There can only be one windows, so we got to put both of these babies in here.\nBen: What you have is not as bad as Vista, but man, the rollout was pretty bungled.\nDavid: It’s confusing.\nBen: The reception was poor. Interestingly not by the tech pundits. The tech pundits who actually spent some time and figured it out, were trained up pretty quickly, but the cat was out of the bag even before they got to review it on people who were angry. What do the Microsoft people refer to them as? People that…\nDavid: Oh, the basement.\nBen: The basement, yes. The 0.001% power users who are the loudest, of course, on the Internet. That taints the product. OEMs hate it because frankly OEMs weren’t signed up to make these touch devices. But now Microsoft’s putting all this energy behind touch-optimized operating system. There’s this mixed message to consumers. It’s like, are there even good laptops available? Am I supposed to use touch on my desktop?\nDavid: They have to run ARM. They can’t run x86. They got to run ARM processors, they got to run mobile processors. But you’re asking these devices in 2012 to also be able to function as laptops, and the technology just wasn’t there.\nThere’s a reason why the iPad was a scaled up version of the iPhone, not a scaled down version of the Mac. Today, I think it might be a very different proposition and the public might be much more ready to accept something like this.\nI wish Apple would do this with the iPad. I don’t want to have a MacBook and an iPad. I just want an awesome pane of glass that can do everything. Apple silicon totally can do everything.\nBen: My dream machine is, you know those Lenovo Yogas that can flip all the way around?\nDavid: Yeah.\nBen: My complete dream machine is my 13-inch M3 MacBook Air that when I flip it all the way around, they do something like a universal binary with the apps, where all the same apps that I had installed on my Mac, they now run their iOS counterpart. They grab all the data that’s stored in the same places. All my apps, it knows which Google Sheet I’m looking for. It has the YouTube videos cached. It does whatever. It just turns into an iPad with an iOS UI. That is the dream.\nI can’t figure out if I’m a super nerd for wanting that, and most people wouldn’t actually want that. But I travel with an iPhone, an iPad, and a MacBook, and I think I could just do two.\nDavid: A lot of people would want it.\nBen: One takeaway may just be, hey, it was too early. The other takeaway might be, look, it turns out that tablets should have been a scaled up phone, not a scaled down PC. That was certainly true at the time.\nDavid: Certainly at the time.\nBen: So complete commercial failure. The ecosystem of Windows 8 apps did not really galvanize. Where we’re left is the state of the Windows app developer ecosystem in the 2013–2014 time period is right back where we started. No one’s terribly interested in targeting that as a developer platform. All the energy is actually just going to go into the web app.\nDavid: Then all the energy is going to go into the mobile app, none of which is in the Microsoft ecosystem. This is the death of Microsoft as a consumer company. No doubt. Undeniably.\nBen: Zune failed, Bing small market share, Windows Phone lost to Android.\nDavid: Lost mobile, Windows 8. This whole thing didn’t work. The stock price has languished, hasn’t moved in 10 years. Stock stuck at $30.\nBen: This is dark. This 2012–2013 time period. This is dark.\nDavid: And at the same time.\nBen: Well it’s funny. It’s dark and revenues and profits have grown tremendously. The enterprise motion of Microsoft has basically never had a down year. 2008 in the great recession. Other than that, like chug, chug, chug, chug, chug, even through the bad Windows releases.\nDavid: It’s dark, and yet the light is shining so bright on the financial statements of this company. What is going on here? Obviously it’s the enterprise, but it’s even more than that. It’s Azure, it’s the cloud, it’s already humming, it’s going.\nMicrosoft did reinvent itself. Microsoft did position itself to be at the forefront of technology. It just did it all within the enterprise context of the company. The Azure story is absolutely incredible. I think nobody knows how it really happened.\nBen: Yes, as the general public is concerned, Steve Balmer was obsessed with Windows. He built the enterprise business, he left, Satya Nadella came in and launched Azure, and Azure has been great.\nDavid: Not exactly.\nBen: That’s not really what happened.\nDavid: When Bill was planning to fully retire from the company, to retire from his chief software architect role—this is all the way back in 2004–2005—he and Steve know that there needs to be a successor in this role. Even Steve will be the first person to tell you he is not a technologist. He can’t do both roles. He needs a Bill, he needs a chief software architect.\nBen: And realistically, you can’t replace Bill Gates with one person. We need two Bills.\nDavid: So they’re casting about. Craig Mundie becomes one of those two Bills internally. They also know who is probably the perfect person to take the other job. That is Ray Ozzie. Ray of course being the author of Lotus Notes. Ray is a legendary developer, and he has great relationships within Microsoft because Ray built Lotus Notes, not at Lotus but at his own software studio startup, and Lotus was just his publisher. He’s known all the Microsoft guys for years.\nBen: This is so fascinating. I never put two and two together. But Lotus 1-2-3 and Lotus Notes were not peers together. Lotus 1-2-3 was developed by Lotus. Lotus Notes is actually Ray’s company.\nIt’s almost like the way a game studio works. Ray and his company are building it. Their publisher is Lotus. But Ray can have agreements with Microsoft where he’s privy to information that Lotus is not. Ray is really close in the fold with the Microsoft folks. I think he was even a contractor working on, maybe the project was Landman, but he was actively contributing to other Microsoft products.\nDavid: Because he had his own software company.\nBen: He was almost like Switzerland in the middle.\nDavid: By this era—now 2004–2005—Ray has a new startup called Groove Networks, and Microsoft just acquires the company and they get Ray. In June 2006, when Bill announces his coming retirement, Ray gets named as his successor and the official chief software architect role.\nBen: Essentially, what’s going on is Bill and Steve look at Ray and they say, you figure out the vision. We’ve got all these assets, we’ve got a killer business. Got all this great talent. In the coming world, the next generation of technology, why don’t you figure out how Microsoft fits in and what our play is?\nDavid: Ray writes the Internet services disruption memo in October 2005. to quote from it, this is Ray writing, “The environment has changed yet again. This time around services. Computing and communications technologies have dramatically and progressively improved to enable the viability of a services-based model.\nThe ubiquity of broadband and wireless networking has changed how people interact. They’re increasingly drawn toward the simplicity of services and service-enabled software that just works. Businesses are increasingly considering what services-based economics of scale might do to help them reduce infrastructure costs or deploy solutions as needed and on a subscription basis.”\nBen: Wait, David. You’re telling me that businesses may want to basically rent capacity from big data centers to just deploy their applications, not worry about the CapEx of buying the servers and racking them all, maintaining the data center, handling the privacy and blahdi-blahdi-blah?\nDavid: I’m telling you that, and I’m telling you, they might not even just want to buy the infrastructure. They might just want to buy the solution as a service hosted by us.\nBen: All right, so this is Ray in 2005.\nDavid: In January 2006, Ray with Steve Ballmer’s full blessing, goes and starts recruiting for a secret project within Microsoft incubated outside any of the existing divisions. This is super important. This should have come within server and tools, like that whole big new business that we talked about that was the key linchpin of Microsoft’s Steve Ballmer era enterprise strategy. Of course, Azure should have come from within there.\nBen: Microsoft has a group that produces a product called Windows Server. That is an operating system that runs on other people’s servers. That group is not the group that produced Azure, the cloud service that runs at the time Windows Server.\nDavid: The reason for that is that this is completely disruptive to the whole Windows Server and server and tools business model. Their go-to market and their business model is we sell these solutions to be operated in your data centers, in your infrastructure, where Accenture and all the consulting firms and all the value added resellers, they’re all our partners, they’re all our go-to market. They’re all going to go implement that on-prem for you.\nIf we were now to say like, wait a minute, all of a sudden we’re going to do that as a service and we’re going to sell it to you separately, that is a huge issue risking a lot of my go-to market motion.\nBen: Not to mention these end enterprises in some ways are actually the OEMs customers. Yeah, these Dell servers are running Windows Server, but Dell sold a bunch of servers probably through Accenture to the end customer. There’s that whole issue of upsetting the Apple cart.\nThere’s also the internal rewards issue and KPI issue. Everyone in Windows and enterprise land, ultimately their KPI is how many copies of Windows can we sell to end customers and generate the licensing revenue on Windows. This new thing, if we actually pursue a cloud strategy is how can we spend a whole ton of money building out a data center, buying other people’s servers, generating zero licensing dollars, and hoping people use the servers so we can charge them later?\nDavid: Windows is nowhere in this equation.\nBen: We’re going to build out a gigantic server firm and rent usage to people. That doesn’t fit into anyone’s current KPI or compensation.\nDavid: Ray’s recruiting for this project code named Red Dog. He brings in the biggest of big guns. That’s right. The legend himself, Dave Cutler.\nBen: No one builds hardcore, enterprise-ready, close-to-the-metal code than Dave. Dave was the architect on Windows NT.\nDavid: We talked about him a lot on part one. Also another guy named [...]. [...] had also come from DEC, which is where Dave came from. Total beast of an engineer. He had experienced both in the enterprise server and tools products. [...] was also a big part of getting Vista out the door with Brian Valentine before Brian left for Amazon. The two of them recruit a team and they build Azure.\nCutler builds a new hypervisor that Azure runs on from scratch without using open source like himself. Hypervisor, of course, is the piece of software that virtualizes underlying hardware and allows multiple software tenants to run on a single piece of hardware. It’s like VMware was a hypervisor company, it was a whole company building hypervisors. Dave just like, yeah, I got this.\nBen: It’s crazy.\nDavid: So great. Steve Ballmer supported this whole thing, pushed it all through, despite heavy pressure and incentives from inside the company, from Windows, from partners, from the whole go-to market motion that he built, Microsoft’s enterprise go-to market motion.\nSteve didn’t get it right away, but he started talking to enough customers and realizing that this was the future of enterprise computing, that he just flipped a switch and said, I’m all in. We’re doing this. Whatever resources we need. We’re talking billions and billions of dollars of capital expenditure to build up these data centers. This is not just a like, oh, some little incubation project. Sure. We’ll see what happens. This is like, no, we got to like bet the company on this.\nBen: Well it’s funny, I disagree that it’s a bet the company move because of two reasons: (1) It’s only money that they’re spending. Cash is never a resource constraint. The bigger concern is Ray Ozzie and Dave Cutler are working on this. That is why it would be bet the company.\n(2) In its initial incarnation, Azure did not threaten the Windows-centric approach. If you remember, when Azure launched it was Windows Azure. and it ran Windows Server. It was Platform as a Service, and Microsoft in no way changed its tune on open source.\nTo this point in history, Microsoft thought that open source was a complete cancer. And for good reason. At the end of the day, basically Microsoft charged for things that open source was giving away for free From operating systems to programming languages to development environments to servers. Everything about it, it was like, oh my God, is there a future where everyone just expects all of our value to be free?\nThey managed to combat that and build a great business despite that, but they never embraced open source. They never at all wanted to be a part of anything that open source developers were doing until.\nDavid: A couple of years into Azure.\nBen: Not until 2014–2015.\nDavid: And why I would say this is bet the company, you’re right. They didn’t go full Infrastructure as a Service and embrace open source and let people use Azure to run Linux in the LAMP stack on top of it. That was not day one, but they knew they had to and they were going to. It was just a, hey, we’re not going to do this right away because the company would organ reject this so hard, but we are moving in that direction and we will be AWS. We will offer everything they offer and more to our enterprises who trust Microsoft.\nBen: That’s a fair pushback. But Azure came in with an aggressive point of view. We are Platform as a Service, which was distinctly different than AWS, which was we are Infrastructure as a Service.\nDavid: Now, interestingly, Office and applications and Software as a Service actually came pretty quickly thereafter, too. Famously they did a pilot program with Energizer, the battery company, selling just sort of, I don’t think it was the Office productivity suite, but it was SharePoint and stuff I think as a service, as Software as a Service.\nIn 2010, Ray Ozzie actually leaves the company. But as he’s doing, he and Steve roll Red Dog—by this point in time renamed Azure—back into the server and tools business. Two of them go to the University of Washington. Steve gives a speech at the University of Washington. We are all in and we are betting the company on cloud and on Azure. The intended audience of course was Microsoft internally of like, hey, we are sending a message to the server and tools team, this is the future.\nAfter that, Steve replaces the division head of the whole server and tools division, who was Bob Muglia at the time. Bob would later go on to be the CEO of Snowflake before Frank Slootman came in; he did fine.\nBob was great. Bob was crushing it as head of server and tools. Revenue was growing, I don’t know, 30%–40% a year. It’s a $12 billion business. But the reason that Steve made the change was he said, we need a new leader who’s going to come in, change this organization, and make it a cloud-first organization\nBen: And not carry the baggage of all the success from the previous iteration.\nDavid: And the person that Steve taps to do that from Bing is none other than Satya Nadella. To come in and lead that transformation.\nBen: And from what I can tell, it’s just as motivated by Azure is the future and it needs a new leader as it is Satya is a really talented rising executive in this company and needs to be put on an important project.\nDavid: Absolutely.\nBen: Almost like Bing’s not enough for this guy. Where can we put him?\nDavid: It was let’s get this guy the right exposure to the right important things, that he could be CEO of this company someday and not very distant future. To say that this goes well is an understatement obviously. But just to put some numbers on this, Microsoft has three reporting segments. Productivity and business process AKA Office. That includes Office 365 as part of that segment. The more personal computing segment, that’s Windows and Surface and their hardware efforts. Then the Intelligent Cloud segment, and that’s Azure. I think LinkedIn is part of the Office segment, if I have that right.\nBen: I think that’s right.\nDavid: I don’t think LinkedIn is in the cloud segment. Intelligent Cloud today is by far the largest segment in the company by both revenue and profit, and by very, very far the fastest growing within the company. Windows is declining.\nBen: It’s the largest business now and the fastest growing.\nDavid: Largest business, most profitable, fastest growing. In fiscal 2023, Intelligent Cloud did $88 billion in revenue.\nBen: Wow. Crazy. It is worth not to pour cold water at all because I think the high level point stands.\nDavid: I was going to say this too. I know where you’re going.\nBen: Intelligent Cloud includes SQL Server and Windows Server. These are big legacy businesses.\nDavid: I think that is both, especially in the early days when Microsoft and Satya was hyping up how much cloud revenue the company was doing, being able to report the legacy server business as part of that revenue helped a lot. On the other hand, the counter argument to that is this is actually Microsoft’s competitive advantage versus AWS.\nBen: Totally agree.\nDavid: Microsoft can go to enterprises and say we are hybrid cloud. Less so today, but in the earlier days of the Azure transition saying like, hey, you need to be on on cloud? We have a world-class public cloud for you. It works great with our on-prem server offerings, and we can be hybrid for you.\nBen: Totally agree.\nDavid: We’ll talk about this a little more in conclusion. We have one more chapter in Nokia in the end of Steve’s tenure to talk about here. But it turned out actually that the cloud market was so big that nothing else really mattered. All the missteps, all the losses, it makes sense. Cloud powers everything. Cloud powers tech. cloud powers all the consumer services. They all run on the cloud. Every consumer service that is not owned by Microsoft or Meta or Google or Amazon runs on one of their clouds, and some portion of that revenue accrues to Microsoft.\nBen: And increasingly the offline economy is becoming some sort of cloud-dependent service. It’s crazy to just see cars rely on the cloud and restaurants rely on the cloud. Anything that you interface with in the physical world, you expect to have some digital component. At the very least, take credit cards, point of sale systems. All of these things are routed through the cloud at some point.\nDavid, I think you’re making the same point about the cloud today that I was about Microsoft in the PC era. Microsoft was lucky to own 90% market share, and in cloud they own meaningfully less than that. But it’s still basically a tracker on the growth of an insane secular tailwind that is just an inevitability in the world. It’s probably a 30–40 year wave that they get to keep riding.\nDavid: And again, this is outside the scope of this episode, but it’s sure looking like to the extent AI is the next computing wave that is also happening in the cloud in the data center. That’s just going to turbocharge everything.\nBen: To review how it came to be, interestingly it was Ray Ozzie in an incubation group doing it outside the bounds of the business units.\nDavid: Beginning in 2006.\nBen: With Steve’s buy-in and the air cover from Steve to make it happen organizationally. You look at where all the talent came from. Bing taught them how to do distributed systems. Xbox Live was a always-on cloud service, realtime, zero latency with 40 million subscribers. MSN was a super high traffic web property with 750 million registered users. Hotmail was a web application that hundreds of millions relied on. They had SharePoint and Exchange. There was knowledge of how to do server-based application software for the enterprise.\nThere was some conflict business model-wise with Windows Server since Azure would be an orthogonal business model, but the technical chops were there. These are hardcore server OS people. Of course that group is going to be capable of doing things like hypervisors.\nI just think the ingredients were remarkably there from all these other things that Microsoft had been doing over the years. They were kind of the only one who could pull this off at this scale with this set of enterprise relationships to migrate all these people to the cloud as they built out the product suite.\nDavid: Really like we got, I don’t know, halfway-ish through our research for this, and this just hit me of holy crap, this era for Microsoft that everybody thinks of is like the loser era. This is the era where they won or they built the foundation to win.\nBen: There was seven years before Steve Balmer handed the reins to Satya where Azure development was happening under him. That is nowhere near the public narrative.\nDavid: And Steve is the one who handpicked Satya to lead it, get all the credit, the narrative, the win, and then become the CEO.\nBen: Pretty wild.\nDavid: That is definitely not the public narrative out there.\nBen: I could see if you were an Azure doubter and you were sitting there at the top of Microsoft enjoying the Windows monopoly, the tremendous business that is Windows and Office and thinking, why would I do anything to jeopardize this?\nWindows has self-reinforcing network effects everywhere. Huge switching costs for the enterprise. Super profitable, high margin, one of the greatest businesses of all time. Now, there’s this idea that you want me to spend the money to run servers. People can run their own software on my servers, even if it’s open source, so it’s not feeding into my, Windows-centric ecosystem. There’s a chance they’re not paying for Windows licenses.\nDavid: There’s a chance they’re not even paying for my enterprise software services like Exchange or Windows Server or whatever. Like you’re saying, Ben, they might be running Linux on there or my competitor’s products.\nBen: It’s not even as good a business. It’s not zero marginal costs. Running servers, running these big data centers has huge costs. Even if you say, oh, those are fixed costs to rack them and you amortize them over a course of year, but energy has a real cost. It’s shocking that they eventually did embrace this very unproven new business that could potentially be way worse than their current business.\nDavid: Without taking anything away from Satya, because I think he does absolutely deserve a ton of credit for knocking it out of the park on execution, I think all of the credit for the vision for it and the championing it for the initial seven years within Microsoft goes to Steve and to Ray.\nBen: Yup. Now I will say the company stayed the Windows-centric company for too long.\nDavid: Oh, for sure. Yeah, no doubt.\nBen: Azure was being built, so it was successful enough that it erases everything else. A lot of listeners know this. I worked at Microsoft from 2011 to 2014. My internship in 2011 was on the Word web app in the Office 365 Suite, before it was called 365. Then my real job was I worked on, when I came back, Office for iPad, which was super secret at the time.\nIt was really counter strategy because we were the Windows company. But at the same time, what users wanted in this world in 2012 was I want to access my documents on any device that I’m on. We have moved to a world where I have multiple devices, I just want to be able to use your application on my device, please.\nAbsolutely 100%, something that happened is all 200 of us worked for multiple years to get these things ready. We had a ship date. Well, we had what we thought was a ship date. Actually what happened was we were told that actually we’re going to shelve it. Instead of a ship party, we had a shelf party because the product got canceled.\nDavid: Ooh. Oh, that’s brutal. Oh, I’m sorry.\nBen: Canceled.\nDavid: What timeframe is this?\nBen: 2013.\nDavid: Okay.\nBen: And basically it was, hey, we just released Windows 8, we just released the Surface, and we want the marketing message for those things to be, that Office is first and best on Windows, and the only tablet in the world that can run real Office is the Surface.\nI of course am too biased and too personal to really think through this, but I was like, oh, this company has its head in the sand. This is ridiculous. What users want is we have a good version of Word, Excel, PowerPoint that people can run on their iPads and we’ve decided not to ship it to try and advantage Surface and other Windows 8 devices.\nA year later, we did ship it, actually right after Satya became CEO. That was one of the first things he did. Ultimately, that decision didn’t happen that much later than it would’ve otherwise, and kind of an open question of whether it was a mistake. Did Microsoft ever lose a dollar for deciding to hold office for iPad another year? Probably not.\nAt the time I held this belief, we have stayed the Windows company for far too long and need to embrace users where they are. Now, with all this hindsight, I understand why you wouldn’t make the decision when you feel like the iPad could be the end of you. Why would we go all in on that now and put our finest products to advantage that thing when we don’t know if that thing is going to kill us or not?\nThere’s the big downside. There’s not much upside to launching it. What? Am I going to renew a few more enterprise agreements because of it? Probably not. Perhaps young Ben working at Microsoft at that period of time failed to understand how important it is to think like an incumbent when you are the incumbent. And this was a low upside to doing it right away. Plenty of downsides to doing it right away. Really no risk on sitting on it.\nDavid: It really did. It was an easy win for Satya during his first year to say culture has changed here. We are shipping Office on iPad.\nBen: We have shifted from a devices and services company to a cloud-first, mobile-first company. I believe that was the message.\nDavid: That was the message, and that was the great supporting point to example of the message.\nWell, speaking of transitions and transitioning, I think it is time to wrap up our history of this period of Microsoft and mobile and everything and Steve’s tenure, and talk about Nokia as we end things here.\nBen: Who bought Nokia?\nDavid: Oh, that’s a good question. Okay. In 2011, after Microsoft had released this Windows Phone, which like we said was really doomed to fail against Android, like you just couldn’t compete with free. I think Bill Gurley had a blog post about Android back in the day about the less than free business model and why you can’t compete with it.\nBen: In fact, it’s not that they were giving away for free. They were willing to pay people to take it. If you think about it, I’m sure there was money that they spent on the Droid marketing campaign. I’m sure there was money that they paid to the carriers to pay to their salespeople, to incentivize people to buy it versus the iPhone in stores. That was a common practice in the mobile industry. I think less than free is actually the correct way to frame Android.\nDavid: Totally. There was one phone OEM that was willing to play ball with Microsoft and Windows phone. And that was Nokia.\nBen: Well sort of. Nokia basically had Symbian as its OS. They tried to start another OS because Symbian was reaching the end of its life. That wasn’t going well, so they were left without a platform. They either needed to pick Windows Phone or Android as their platform of the future despite being what used to be the dominant phone maker for all cell phones.\nDavid: And the then CEO of Nokia was a guy named Stephen Elop. Folks will almost surely remember that name. He was a former Microsoft guy, and he had come over to run Nokia, so there were deep relationships there.\nIn February 2011, Nokia agrees to adopt the Windows Phone operating system as its primary smartphone OS for its devices. Like you said, Ben, it didn’t have a lot of options and it wasn’t willing yet to go Android. Pretty quickly, though, as we get into 2012–2013, it’s clear Windows Phone isn’t really working and Android is the future.\nAs we get into 2013, Nokia comes to Microsoft and says, hey, we got to talk. We’re going to go Android unless you make it worth our while, or something happens here and changes, and as Steve put it to us, it was only money.\nBen: That is actually the right way to think about it. We’ve been joking about it’s only money, but honestly, what was Microsoft’s market cap at this time?\nDavid: Call it $300 billion.\nBen: And what was the forthcoming acquisition offer for Nokia?\nDavid: $7 billion.\nBen: So that is 2.3% of the company. You’re willing to give up 2.3% of your company for some particular bet. I actually think that’s a very reasonable way to think about this. aQuantive, Skype, which we didn’t talk about, which actually was a pretty good deal especially because of the tax treatment, Yahoo, Facebook, you should think of these things as a percentage of market cap. And sometimes things could go really, really right.\nDavid: It’s even less consequential than that. It’s not even a percentage of market cap at all. Microsoft’s operating income in 2013 was $27 billion. It’s $7 billion out of $27 billion in just cash that they don’t know what to do with and that they aren’t getting credit for.\nBen: Well, but your cash is valued as a part of your market cap.\nDavid: Sure, but Microsoft stock is in the dumps here. The cash flow geyser is not appreciating the stock price here. Wall Street does not appreciate what’s going on.\nBen: It’s funny. I delivered you a technically correct answer and you delivered me back a very pragmatic one.\nDavid: Yes, right.\nBen: Which is, that’s not accruing to your market cap anyway, so you may as well spend it.\nDavid: And I think it was probably in Steve’s mind here of like, I’m not getting any credit for this, all this cash I’m generating. Eff it.\nBen: When it doesn’t cost you focus or your best people or whatever the scarce resources are and it only costs you cash, then you should totally think about it as, am I willing to bet 2.3% of my company or whatever percent of the cash that I’m not getting any credit for if something could go really right? It’s a venture capital bet.\nDavid: And Nokia is basically holding a gun to my head.\nBen: There’s actual downside to it also.\nDavid: There’s actual downside here. So that’s how the deal comes together. It was super controversial within the company and on the board, obviously. At one point, as Satya talks about in the book, there’s a straw poll taken of all the division heads, all the top leaders in the company, whether they’re for or against the acquisition, the majority are against the acquisition. Satya is against the acquisition. The board basically says to Steve clearly there’s not support for this.\nBen: My understanding of the timeline is there’s a $7.5 billion offer on the table. Steve mulls it over, plays with it, is for it, proposes it to the board, and exactly the board comes back and says, hey, there’s not support for this.\nDavid: After that happens, a series of discussions start and culminate. We’re in late summer, early fall 2013 when all this goes down. On August 23rd, 2013, Microsoft and Steve Ballmer announced that he is retiring within the next 12 months, and that the board and the company have started the search for a successor as CEO. That was August 23rd, 2013.\nOn September 3rd—10 days later—Microsoft agrees to buy Nokia’s mobile unit for $7 billion. We heard a bunch of different stories. How it went down, we don’t know exactly, but the fact pattern is Steve announced that he was leaving. Ten days later, Microsoft agreed to buy Nokia.\nBen: The question remains, who bought Nokia?\nDavid: We don’t really know. In any event, here’s what happens next. February 4th, 2014, Satya Nadella is introduced as the next CEO of Microsoft. Steve Ballmer steps down. On that same day, Bill also steps down as chairman of the board, and John Thompson becomes chairman of the board. It’s a wholesale changing of the guard within Microsoft, Bill, Steve, the original folks we’re retiring. We’re done, it is a new day, and that needed to happen.\nThe office for iPad discussion we had a minute ago, I think was emblematic. There is truth to what Satya wrote in his book that we said at the very beginning of the episode of, hey, this company culture needed a reset. It’s like a bigger version of Brad Smith’s presentation to the board of it’s time to make peace. It’s time to make peace internally and there just needed to be a reset.\nBen: There was a lot of baggage. It’s just what? Forty years of baggage—Bill, Steve, old wars, antitrust, bad releases of windows. You just got to get it out to move on. It was Bill and Steve leaving in one fell swoop to clear the path.\nDavid: And at the same time everybody knew, hey, there is a huge win that we are sitting on right here. A huge, huge, huge win in Azure. It is going to be really good for everybody’s personal net worth, if nothing else. If we can just let that be appreciated and let a new day dawn here.\nOn February 4th, 2014, on that day, Microsoft stock price was $30.50. As we said a minute ago, the market cap was, I don’t know, call it $300 billion, slightly below. Today, 10 years later…\nBen: Whoa, whoa, whoa. This is volume three, David. Don’t.\nDavid: Yeah, yeah, yeah. Well just to…\nBen: Foreshadow.\nDavid: Show that this was the right decision. Ten years later, stock is at $465. Market cap is $3.5 trillion. Probably, I don’t know, I haven’t done a sum of the parts analysis, but I think you can say probably at least half is Azure propping up that market cap.\nBen: They are currently the most valuable company in the world.\nDavid: The once and future king, Microsoft. That’s our story for part two. We still have a lot to talk about in analysis.\nBen: I’m sure someone’s looking down at their podcast player right now. Like why are they acting like they’re done? There’s so much time after this. Are they just going to like play some music or…\nDavid: Lots to talk about.\nBen: Okay, I have got some start and finish stats on Steve’s tenure as CEO.\nDavid: Ooh, great.\nBen: This episode we started a little bit before Steve took over because we wanted to put the Internet chapter in and the antitrust chapter in, but I think everyone feels it by this point. The question really is like what happened when Steve was running the company?\nHere are the numbers, and this is the timeframe from 2000 when he was announced as CEO until 2014 was Satya was announced, so a 14-year period. Revenue went from $23 billion to $84 billion, that’s a 3.5 over 14 years. Operating income went from $12 billion to $30 billion, so almost a 3x. Important to pay attention to is the price-to-earnings ratio. When Steve was announced as CEO was a 75x.\nDavid: That’s high.\nBen: It was real close to an all time high, which was in the month prior at an 80x. It is worth pointing out, it still has not been that high to this day. Even today with all the excitement around Microsoft, AI, everything going on 40x.\nDavid: Steve comes in at an all time high multiple and right before the DOJ verdict and the breakup of the company.\nBen: The dot-com bubble is exploding. and you’re taking over from Bill Gates.\nDavid: All the things.\nBen: Essentially, if you’re doing an analysis of what happened in Steve’s tenure and you’re trying to grade that, you are implicitly saying, did Steve make a good investment? To be honest, I think Steve took one for the team in taking over as CEO in that moment. He was handed a bit of a…\nDavid: Impossible situation.\nBen: Garbage sandwich, inheriting something when it is valued that highly.\nDavid: Not to mention as we talked about during that period, all the frankly shit going on at the company.\nBen: Completely. I worked at Microsoft during this period. I was a big open source guy. I was a big Apple guy, I was all these things, and I hated Steve’s Windows strategy. Frankly, I didn’t like using any Windows products. I felt like they were all crap. It is still true that it’s totally insane to evaluate how did someone do with an asset that they were forced into buying at 75x earnings.\nAt the end of his term it was 14x, the PE multiple went from 75x to 14x. The market cap when he was announced went from $600 billion to when he left at $330 billion. A lot of that is basically the price-to-earnings multiple rationalizing in that first year. Then after it did that, the stock price was basically flat for his entire tenure, no matter how much the revenue or the profits grew. One crazy stat on this is you could have bought Microsoft in 2009 for 2.1x annual revenue.\nDavid: Oh my God. Everything was on sale back then, but wow.\nBen: Listeners, a sleight of hand here. We switched from earnings to revenue. But David, I thought that too. I was like 2009. Come on. In 2013 you could have bought Microsoft stock for 3x revenue.\nDavid: Oof. Wow.\nBen: The question is why? Why did investors give Steve zero credit for any of this growth. Cut off that first year when the multiple was coming down. Why is it that effectively what happened from 2001 to 2014 is for any gains that they got in revenue or profits, it was offset by multiple compression coming down and saying the asset’s still worth the same thing?\nOne is very legitimately the investors had little belief in Microsoft’s long-term relevance. Not the place for user excitement, not the place for developers. They doubted that there was real vision from leadership.\nYou went from Gates, this guy who created it all to someone that everyone was chalking up to be the sales and marketing guy. There are the product strategies all over the place, and Windows isn’t getting any more relevant. They’re trying all these new things that are failing. Search passes you by, social passes you by, blah-blah-blah.\nBut the interesting thing is investors basically didn’t think Windows and Office businesses were sticky, and they were only valuing the newer bets, which was super wrong. Windows and Office have proven to be these ridiculously durable franchises generating more revenue today than ever.\nIt is ultimately on the CEO to help shareholders understand where the value is. But shareholders obviously did not price in the retention and growth within the existing Windows and Office customers through a new era of technology. I think people were just betting that Microsoft would lose it and they didn’t. They held onto these durable franchises.\nDavid: You know? It’s funny. When you asked this question a minute ago, I hadn’t prepared for it ahead of time because as listeners know, we don’t share notes. The first thing that popped into my mind about why Wall Street did not appreciate the revenue and profit growth during this time was just simply Microsoft did not do a good job telling its story.\nBen: It was horrible.\nDavid: I think you’re saying the same version here. It’s so funny. It’s part of why I love doing Acquired, part of why I think the show resonates with people. Telling stories is the most important thing. If you cannot tell your story right and in a compelling fashion, this is what’s going to happen to your stock price. Even if you triple revenues and profits and build Azure and all these things.\nBen: Consumers had no idea what Microsoft’s strategy was and neither did developers, so neither did investors.\nDavid: CIOs probably did.\nBen: Sort of, but they were probably like, what’s going on in search and what’s going on? Sorry, what’s Zune? Is it winning against iPod? What’s losing? Oh, mobile. What’s losing too? Huh?\nDavid: And it’s for another episode, but it really was brilliant what Satya did and the company did when he came in of they got the story right.\nBen: The messaging reset.\nDavid: This is a mobile-first, cloud-first company. That was it. That was the key. Just saying those words over and over and over again.\nBen: Anyone who’s listening, who’s a leader at a company right now knows that the right amount of repeating yourself to do is about 10 times more than you think it is. You need to just keep delivering the same message over and over and over again, and that wins.\nThe other way to look at Steve Ballmer’s tenure is comparing against what else was going on in technology from 2000 to 2014. On the one hand, like we’ve been talking about, you have the rise of Google in search, and you have social networking with Facebook. And yes, you absolutely can compare a CEO to these category-defining startups that are in adjacent fields.\nBut that’s a little bit of an odd way to evaluate A CEO. They aren’t even really competitors of yours in your exact market. By the way, they created the best businesses in history that were also the fastest growing and capital-efficient. How did you do versus those two particular related outliers? I think this is a funny measure, even though this is the measure we all use.\nBut if you actually just look at the peer set, what other big companies were there in 2000 and tech? You had Yahoo, AOL, the whole cable and media sector. You had HP, Nortel, so many of the great companies of the previous era completely fell apart. The three who actually survived and potentially thrived were Microsoft, Dell, and only Apple after Microsoft bailed them out and Steve Jobs came back personally.\nDavid: I would throw Oracle in there too, but yeah.\nBen: Yeah, Oracle. But, surviving puts you in the top 5% against the pure set of that era. Even if you overlook all the revenue and profit growth and you just look at pure enterprise value and relevance, there is actually a success in that the core asset was preserved.\nThis whole notion you have, David, that Satya came in and we were great and then we sucked for a while and then we were great again. Even just setting up, we preserved the talent asset and that we had continuity in our businesses for another 15 years on what is already a 30-year-old business. I don’t know. That’s way better than anybody else does.\nDavid: Totally.\nBen: Anyway, this is all analyzing the tenure from a business perspective. I am very amenable to the idea that products completely languished. I had no interest in using any Microsoft products during this period.\nDavid: Despite being an employee of the company?\nBen: Yeah. I’m very amenable to arguments of yeah, but they didn’t make anything good.\nDavid: And that is I think particularly resonant to me, at least in my history because they used to.\nBen: They totally used to.\nDavid: They used to be the consumer technology leader. Windows 95, Windows XP, everything we talked about at the beginning of the episode, Internet Explorer, the browser wars, they were the leaders.\nBen: They did make some good. Xbox is good. I actually thought Windows Phone, particularly Windows Phone 8 was a beautiful new crack at what does a phone look like. I thought it worked well. But I guess what I’m saying is the products that ended up being their big profit drivers were never their good products.\nDavid: Well, they were their good products. Just the enterprise products. They weren’t the good consumer products.\nBen: They weren’t good for me as a user. They met the needs of customers. All right. Move into analysis.\nDavid: Great. Let’s do it.\nBen: Seven powers. Listeners, this is the part of the show, analysis broadly where we analyze the business after we’ve completed the story. The first one is a section called Seven Powers, which is named after Hamilton Helmer’s book.\nThe question that he poses is what is it that enables the business to achieve persistent differential returns, or put it another way to be more profitable than their closest competitor and do so sustainably?\nThere are seven different powers, sort of categories that it can fall into. There’s counter positioning, scale economies, switching costs, network economies, process power, branding, and cornered resource.\nDavid: I think on part one, we said Microsoft in that era had all of these, right?\nBen: I feel like there were one or two that I was shaky on, but most yeah.\nDavid: Well in this era they definitely don’t have counter positioning, that’s for sure.\nBen: That’s the interesting thing. Once you’re an incumbent, you can almost never have counter positioning.\nDavid: Actually, I would say they had some of it in the development of Azure because they could say to Fortune 500s, we will do hybrid cloud with you and we can be your trusted partner in a way that AWS couldn’t.\nBen: Counterposition against AWS, yeah.\nDavid: But broadly as a company, no way.\nBen: They were getting counterpositioned in mobile. Google was saying, we’ll give it to you free.\nDavid: Less than free, yup.\nBen: Perhaps the single greatest asset they have is scale economies with the number of users and customers they have. Any investment that they make gets amortized over such a massive user base that it’s worth it. If they can charge a dollar more on EAs, they should do almost any amount of incremental R&D or acquisitions.\nDavid: And that translates directly into the cloud era too.\nBen: The cloud era even more. I think there are crazy returns to scale on cloud economics.\nDavid: I think process power, I would argue they actually lost during this era. The Blackcomb, Longhorn, Vista thing illustrates that.\nBen: They went from knowing how to ship the most beloved operating system of all time with Windows 95, managing to pretty much do it again even during the antitrust thing with Windows XP with I think zero blunders in between. They had ME, but that wasn’t a blunder as much as a, I don’t know, fresh coat of paint that wasn’t really real. Then yeah, with Longhorn and Windows 8, separate problems but completely forgot why those franchises have economic value.\nDavid: I think they also definitely lost branding power in the consumer world.\nBen: The question is, did they become more trusted by the enterprise, where if you’re offered the exact same service from Microsoft and AWS, are you more willing to pay Microsoft for it?\nDavid: Definitely yes, they gained it in the enterprise world.\nBen: Microsoft has unbelievable switching costs. The EA, you just can’t switch now. You have to switch sometime in the future. Then that time comes, you’re probably not going to switch then either because the next EA is going to offer even more value.\nDavid: It’s funny to the extent that the DOJ and governments were concerned about Microsoft being a monopoly when it came to product tying on the consumer side. They really should have been concerned about product tying.\nOn the enterprise side where you pay us a dollar amount per device on your network and you get all of our software, for sure there would be way better point solution software for any one of the hundreds of things that Microsoft is providing for you, but there’s no way you’re going to switch.\nBen: You’re so right. It’s so funny you reflected it back to the DOJ. It’s been so long now since we covered that hours ago. I forgot about it. In that era, there were literal switching costs to getting a different browser. The one that came with your computer was the one you were going to use because a different browser was going to take 5–24 hours to download over your internet connection in the dialup days. It was good for consumers to receive a browser with their computer because getting another one was almost prohibitively difficult.\nNetwork economies, it’s actually a little thin.\nDavid: They had the great network economies with Windows that we talked about last time, but that starts to erode here.\nBen: As interoperability becomes a thing, as file format standardized and I can open the same documents on Macs and PCs. It’s like, okay, file formats stop being a network economy that accrues only to the operating system.\nI’m trying to think. Are there any other, like if you are an enterprise and become a Microsoft customer, and I’m an enterprise and I become a Microsoft customer, do we really benefit from each other being?\nDavid: I don’t think so.\nBen: I don’t either. That just leaves cornered resource. No, I don’t think they have that meaningfully.\nDavid: No, I don’t think so.\nBen: The fact that we came up with, they don’t really counter position, they have great scale economies, they have a lot of switching costs, and that’s it, that’s pretty illustrative of why you feel like this is the lost era of Microsoft.\nDavid: And I think it also illustrates that sounds like an enterprise company to me.\nBen: Yup. Okay, playbook?\nDavid: Playbook.\nBen: The first one that talks to mind that I want to address a little bit more specifically is this idea of a cultural shift. Because we’ve mentioned it many times on the episode. Oh, with the DOJ there was a cultural shift. Oh, with the new leadership there was a culture shift. But what does that actually mean and how do you go about quantifying that?\nThe thing that I kept hearing in all the research interviews we were doing was that when the stock price was flat and flat for a long time, people became convinced it’s just going to stay flat. Basically, whatever the cause of that was, it created a zero sum environment. Nothing I do is going to make the company more valuable. Therefore my value, the only way to grow value accruing to me is to win at the expense of someone else at this company.\nI’m going to get promoted over them, my product’s going to eat their product, my team’s going to eat their team. I get kudos and at the expense of them looking like an idiot. That’s the incentive.\nDavid: This is the cartoon org chart of all divisions of Microsoft pointing guns at one another?\nBen: Right. And of course it’s amplified by stack ranking, which I don’t have a problem with stack ranking generally, but famously at the company, everybody was ranked one to five. Every manager was only allowed so many ones and so many twos. Ultimately, it was an environment where everyone, every 6 or 12 months, sometimes there were midyear check-ins was being baked off against your immediate peers in your group. And because the company wasn’t growing in value, you had to outcompete your friends to win.\nDavid: The pie was not growing.\nBen: So why was the pie not growing? We talked a lot about that. There are a lot of reasons. You could argue why it wasn’t, but the culture is an effect of that.\nThere’s a big one I’ve been thinking on, which is how to go about placing your bets for the future as a company. I think in the 2000s, Microsoft was viciously trying to fight against the tide. There was open source, there was the web, there was all these things people wanted to do.\nUltimately, over time, you cannot fight what people want to do as a company. You can put up all these barriers, you can steer them back into your ecosystem. But ironically, the playbook that Satya is now running is a return to a classic Microsoft one—embrace and extend.\nRather than fight what users are doing—I want to use open source software, whatever. I want to make web apps, I want to host a web app—you just figure out what people want, you embrace it, and then you figure out what product you can build with a business model that extends that existing user behavior. But it does require you to be clever and outcompete a lot of other people to invent that new business model that is created on top of new user behavior.\nDavid: I just want to double underline and highlight this one because I think also this same dynamic played out in the building and evolution of Microsoft’s enterprise business. Really IT just wanted to control the network and prevent users from messing it up.\nEventually when the iPhone came out, that dam broke and IT could no longer hold back users within their company from doing what they want and having what they wanted.\nThis is where the shift to the cloud was another reason it was so strategically important. Shifting to the cloud is what enabled IT to say okay and become a partner to their users in a way that they paid lip service too before but they were really antagonistic to their users. And it works exactly with what you’re saying for Microsoft as a company and its products too. You want to use an iPhone? Great. You want to use open source? Great. We can still serve you.\nBen: The trick is figuring out how to make money when you lean into what people want. Because ultimately, if you just reduce it all to economics, what people want is free value, but you can’t actually build a business on giving away free value.\nI can give you $1 for 90¢, but ultimately I’m just going to go out of business. I need to figure out some way that you’re happy from value creation and willing to pay me more than it costs me them.\nDavid: Anyway, the trick is getting the business model right.\nBen: There’s this other one of what was going on, given that the ideas were good. This is going to sound harsh, but timing, implementation, and taste at Microsoft from, call it Windows 98 on, were just terrible. Or maybe put another way they had the right ideas, but late timing and bad execution. Strategically correct, but tactically misguided.\nBill was super right that touch computing was going to be a thing. He referred to this idea of a natural user interface very often. Bill was super right that interactive TV was going to be a thing. Think about how I watch Netflix. I will watch Netflix tonight after we record on my Apple TV upstairs. Bill was right on mobile, that that was going to be a huge part of the computing landscape.\nYet all of these started at Microsoft 5–20 years before the tech was actually ready, and they would often bet on the wrong standard or paradigm. Touch computing ended up being capacitive, not resistive with a stylus. Tablets have proven to be a cousin of phones scaled up, not PCs scaled down. Interactive TV came after the Internet, not before.\nOnly once there was a tremendous amount of bandwidth. Think about how much more bandwidth it consumes for all of us to ad hoc start Netflix streams versus there’s one broadcast happening and we all just tune in when we tune in and we just catch whatever part of the broadcast is over anyway.\nDavid: Not to mention interactive TV looked like YouTube and Netflix and not like a layer on top of Comcast.\nBen: Totally. Mobile was five years early and it was more akin to embedded devices than it was to scale down PC OS. Something was off in Microsoft’s ability to leverage their future predicting into creating the right products. Which is weird because historically they had been good at it.\nWell they at least employed the, one Microsoft employee referred to it as bracketing. You basically develop two products concurrently, one aimed below what the current technical capabilities are and one aimed above. As you get closer to shipping or as you get closer to letting the market play out, you pick whether you’re going to make the low end one better or you’re going to start reducing functionality of the high end one.\nIn the IBM days, you had Windows and OS/2. In the Internet era you had the web browser versus all the interactive TV stuff. Or Longhorn which was supposed to be little and iterative versus Blackcomb, which was so ambitious it actually got canceled.\nDavid: The problem was during this era that optionality in multiple bets collapsed down to now we’re going to make one bet in each of these.\nBen: Or the bets somehow couldn’t continue to flourish internally. I don’t really know why, but it seems like for some reason bracketing worked well for a while, and then eventually their ability to take a good idea and implement it at the right time, the right way fell apart.\nMy next one is the idea of positive sum leadership. This one’s a little bit more personal than our playbook themes typically are, but I think it’s an important takeaway. Bill Gates plus Steve Balmer in the right roles with the right level of respect for each other and who made which decisions when that was all humming, that was way more valuable than Bill alone or Steve alone. It was like one plus one equals five.\nDavid: They were so great together.\nBen: This is actually pretty common among teams that most high performing teams are so much better together than they could possibly be apart.\nDavid: Well hell look at you and me, right?\nBen: I totally agree. I was going to make that analogy but it’s too much [...].\nDavid: There is no way we could do this on our end. Too much navel gazing, but yes,\nBen: Bill alone, at least in this era, was totally at risk of getting too excited about theoretical technologies like WinFS. That’s the perfect illustration of this. Steve needs a great technology partner and one who has the extreme loyalty of the thousands of brilliant engineers at the company. They’ll align and follow the vision.\nSteve also needed someone willing to change their mind in the face of new data. Bill was constantly processing new information and as new things came in, he would say, I don’t care how in motion things are, if you’re right—which is rare, usually Bill’s right—and you’re arguing something to me like screw it, we got to change everything. New data, new thing. The Internet Tidal Wave.\nSteve was much more like we have to align an entire aircraft carrier in the company and then all the aircraft carriers outside the company. We are going to make a decision and that we are going to implement and execute. I think together there was some magic where there was just the right amount of sticktoitiveness versus adaptability.\nMy next one is being extremely partner-focused is a gift and a curse. Microsoft is an extremely partner-oriented company. There are far more profits who have accrued to Microsoft’s independent software vendors, resellers, retail partners than just to Microsoft itself. But it basically makes it impossible to reset.\nApple, when jobs came back, hit a full reset. All new developer tools, all new products, all new software, all new platforms. But when you have all these externalities depending on you, you actually can’t really hit a reset button to adapt for a new era. You have a whole ecosystem to preserve. I think this is the more nuanced view of the idea that well if you miss one wave then you’re actually well suited for the next wave.\nPeople often say the only reason Apple was able to win in mobile is because they totally lost in desktop or whatever. I think really what the answer is, the more externalities you have depending on you, the more difficult it is to reset, and usually a next generation…\nDavid: The more switching costs you have.\nBen: Right. A next generation technology requires you to hit a big reset button. That’s all I had for my playbook.\nDavid: Great. I have just one big one, but I’m going to save it for takeaway and landing the plane.\nBen: Let’s do that now. Listeners, we’ve been trying out this new way of ending episodes. How do we land the plane? What is the one takeaway that is really sitting with me after having done all this research, talked through it with David, hardened our thinking by bouncing ideas off of each other, what is the thing that you can’t get out of your mind?\nDavid: For me, this only came to me just a few minutes ago, but I think is the right and most complete version of what I’ve been been feeling about this part of the Microsoft story for a long time since we’ve been doing the research, and the feeling started with as we were talking to people and digging in, we were just like, this story is not understood right. This narrative about these were the losing years of Microsoft. Yes, there were a lot of Ls during this time, but that’s not complete by any stretch of the imagination.\nAs we were preparing, I really felt a lot of weight on this one of like man, we really have a responsibility to try and get this right here. I think what I realized a few minutes ago as we were talking is this was the biggest failure of the company during this period. They did not tell their story right. So much of what we think of as the losses from this timeframe and certainly everything baked into the stock price not moving was because of that.\nYes, Steve came to the CEO role at an all time high multiple, it was the tech bubble and all that stuff. Sure, that’s a big thing. But why did the stock price stay in the 30s for his whole tenure? They just couldn’t tell the story right. There are all sorts of reasons for that, but the story does not have to be so negative because there is so much positive that happened during this time, and yet the narrative became this self-reinforcing Microsoft sucks narrative.\nBen: Irrelevant, failing, can’t do consumer. The counterfactual is Amazon. If they had a consistent message that they went forward with such as, we are a company who invents and wanders. Amazon has failed at so many things.\nDavid: So many things.\nBen: Publicly huge bets that have totally failed and yet—\nDavid: Huge consumer failures. The phone.\nBen: People are like, what a beautiful thing that Jeff Bezos has imbued into this company. This idea that we invent and wander, we make these bold bets, we embrace failure. Kindle Fire or I guess Kindle Fire counts, certainly the phone.\nDavid: At this point I feel like standing here today we can say Alexa.\nBen: Maybe if LLMs hadn’t become a thing I’d be with you. It turns out it might be good distribution for a good LLM if they actually—\nDavid: Yes, sure. But the thing itself anyway.\nBen: It’s an option on LLMs.\nDavid: There are so many. There’s too many to count.\nBen: There’s grocery, Amazon Go, local, all the restaurant stuff, it’s a narrative problem.\nDavid: And yet the narrative about Amazon is what a beautiful thing Jeff imbued in the company. And the narrative about Microsoft was they can’t get anything right.\nBen: Yup, you’re right. I think yours is better than mine. Now that’s my new land the plane. Do you want to hear what mine was before?\nDavid: Yeah. Tell me what was on your mind?\nBen: All right. Ultimately Bill Gates is right. Technology companies are always extremely at risk of disruption. Even if you won the battle today, even if you’re the most dominant company today, it is so easy for you to lose and become irrelevant tomorrow.\nYou may keep a great business because these things are sticky. As we know, IBM made a lot of money for a long time. But even without the whole DOJ thing, Microsoft probably would’ve visited themselves. Microsoft almost certainly would’ve missed mobile because there’s no chance they would’ve realized that the business model that Google had meant that they were going to win in mobile when they came in from the side and gave away the software for less than free. Microsoft was going to have these huge downstream misses because technology moves so fast and is such a dynamic landscape.\nDavid: I think this is why I feel so adamant that Microsoft during this era, and Steve deserves so much more credit than they get because Microsoft is not IBM today. It is not large but irrelevant. It is very relevant. And what they have done with Azure and in cloud and now with AI is, hell, they’re the most valuable company in the world.\nBen: If all this era did was give them a free option to play in the cloud and AI era or even just say the AI era, that would’ve been great. But also what they did was they tripled revenue and profits.\nDavid: Yeah, they did that while building this whole new great business.\nBen: It’s a great takeaway. Carve outs?\nDavid: Let’s do it. Okay, I have two hardware technology products. One is a re-carve out from you, past carve out. The RayBan Metas. Finally got a pair. They’re great, they’re awesome. The use case of the audio, ambient audio in my ears without earbuds is great, particularly for a baby monitor when I am talking to my wife or other family members or friends or whatnot, and I want to be able to hear what is going on in the baby crib and not wear earphones in my ears. That is great. They’re also just a great product in general.\nAnother related hardware carve out is a startup called Oslo and the Oslo Sleep Buds. In the last couple of years I have slowly and then pretty much every night gotten into using some form of audio to help fall asleep, or if I wake up in the middle of the night, get back to sleep. I used AirPods for years and years and they’re great, but if you sleep on your side or do anything you know you got the AirPod jamming into your ears. These are little sleep buds that are made for sleeping. If you lie on your side, on your ear, they don’t stick out, so you can lie.\nBen: Oh, text me a link. I’m buying this immediately.\nDavid: Yeah, they’re great. This is the team that was at Bose that made the Bose, I don’t even know what the product was called, but Bose had this product. They killed it. The team left, started a startup, so it’s all Bose engineering. Anyway, it’s great. I love them.\nBen: I’m buying this as soon as we get off.\nDavid: They’re fantastic.\nBen: Awesome. I have two and they’re the most absolutely basic products of all time, and I’m okay with that. The first I mentioned earlier, M3 MacBook Air. It’s the finest computer I’ve ever owned, which I say every time I get a new Mac.\nDavid: If only you could turn it around and touch the screen.\nBen: I know. I’m rocking the M1 MacBook Pro at home. It’s a 16-inch and gosh that thing is just a beast to fly with. For all the travel we’ve been doing recently, David, it has been awesome to have this incredibly lightweight, incredibly fast, just beautiful machine for flights and all sorts of travel stuff.\nDavid: Nice.\nBen: So it’s my on the go. Then sticking with this theme of staying incredibly basic and predictable, the Tesla model Y is an awesome car.\nDavid: Oh yes, that’s right. You are finally doting the club.\nBen: We just took a weekend and drove up to Orcas Island, and it was so sweet. I never once charged it, drove multiple hours, took a ferry, we’re on an island that’s sparsely populated, hung out for the weekend, drove all over the island, did the whole thing back, got back with 18% battery.\nDavid: And had you needed to charge it, there’d be a supercharger network.\nBen: Yeah. it’s unbelievably fast and fun to drive. I finally get the, it’s an iPhone with wheels. Whenever I drive my other car, it feels icky and this one feels clean.\nDavid: It’s perfect.\nBen: Yeah, it’s amazing. I get it. I get it Tesla people.\nDavid: All right. We got a lot of thank yous here.\nBen: Yeah, we have a huge set of thank yous. First, of course, is our sponsors, JP Morgan Payments, ServiceNow, and Pilot. You can click the link in the show notes to learn more and tell them that Ben and David sent you when you get in touch.\nI was trying to count, David. It’s definitely over 20 people that we talked with this time. On my end, thanks so much to Brad Silverberg. Brad led Windows for a while, notably the development of the Windows 95 product and that team.\nThomas Reardon, who was one of the original team members on Internet Explorer and actually went on years later to start CTRL-Labs, which sold to Meta and is a part of Meta’s effort now to do the neural interface. You can twitch your hands and I don’t know, we haven’t actually seen a product yet, so we’ll have to see what that looks like. But that was Thomas Rearden in his next act.\nSteven Sinofsky who led Windows in Windows 7 and 8 and led office before that. David, you read quite a bit of Steven’s words to prepare for this.\nDavid: His blog, hardcore software he published in book form. It’s a thousand-page book. It’s a textbook sitting on my desk. It’s awesome. We talked to Steven for a few hours, he’s great. He’s a board partner in Andreessen Horowitz now. that was super fun.\nBen: Julia Larson-Green was also great. She worked closely with Steven in Office and also on Windows.\nMy old coworker, Anna and Raja [...] who worked with me on Office for iPad, helped refresh my memory on what the blow-by-blow was like in those days, where we almost shipped the product then didn’t, then got a new CEO then did.\nA huge thank you to Fritz Landman, who worked in some strategy and corp dev roles at Microsoft. Just an awesome guy. Actually, now he is the CEO of the combined company, ClassPass and Mindbody, and talk about a person with multiple lives and careers. He was great.\nSomeone that he worked closely with at Microsoft, Charlie Songhurst, Charlie’s one of the smartest people I’ve ever met. That could go for a lot of people on this list.\nDavid: Didn’t Charlie do the best interview with Patrick a couple of years ago?\nBen: Did he? Oh I got to go listen.\nDavid: I think he did, yeah.\nBen: Absolutely brilliant mind expanding person. Jon Rubinstein who led engineering at Apple and actually went on to lead Palm. It was fun talking with him about what was it like from the Apple side, from the competitive perspective competing against Microsoft all these years.\nHuge thank you to Ray Ozzie, who David and I both spoke with. Ray is so damn delightful.\nDavid: He’s such a legend. Delightful the right way to put it. Ray is now running another startup, a new one called Blues Wireless and was just so generous to give us a couple of hours. He had some amazing, things that belong in a museum in his office that he showed us over Zoom, like old computers and hardware from the 70s, the 80s, the 90s. It was super cool.\nBen: More on my side, to Rob Glaser who worked at Microsoft in the 90 and founded and ran Real networks.\nTo Joe Belfiore who played a large role in Windows and Windows Phone. Actually, he demoed Windows XP the way back 2001 in the launch announcement to Regis Philbin. That’s how the second half of the keynote works is Joe is demoing features to Regis.\nDavid: It was Jay Leno for Windows 95 and Regis for Windows XP.\nBen: Yes. Joe’s got this beautiful long history of Microsoft and was just really great.\nTo Vivek Varma who was at Microsoft, deeply involved in the comms and legal stuff during the antitrust era.\nOf course to Steve Ballmer being very generous with his time and helpful in helping us sharpen some of our thinking.\nDavid: And especially being generous with his time as we were entering free agency here. He’s got a busy day job these days at the Clips.\nBen: That’s right. Our good friend who runs the science of hitting. It’s a great substack that does investment analysis and just was very generous sharing a large spreadsheet of historical data from Microsoft. It’s very easy to parse and look things up live while we’re doing the episode.\nFinally, last one from me. To Todd Bishop at GeekWire. Todd has these unreleased recordings from when he was covering Microsoft at the Seattle PI way back in the early 2000s, and he sent me the raw recordings, when he was standing there with Bill and Steve just being a reporter. It’s very fun to hear their voices in ways that I don’t think were ever released or publicly heard.\nDavid: Super cool. A few more on my end. Terry Myerson, the CEO of Tru Veta in Seattle. Terry ran Windows and Windows Phone at Microsoft for a long time.\nTo Soma Somasegar, who is a managing director at Madrona but is a legend in the server and tools business at Microsoft. Soma, we talked about him on part one, but he’s wonderful.\nTo Mary Jo Foley. It was so fun to talk to Mary Jo. Mary Jo dedicated her career at probably the last 20-plus years to solely covering Microsoft, and she is the best in the business. Today, she’s the editor in chief at Directions on Microsoft. It’s a research firm like Gartner, except it only covers Microsoft. She is super kind and generous.\nThen the last one, Dave Marquardt. It was so fun to talk to Dave. Dave was a 33 year board member at Microsoft.\nBen: The only outside capital.\nDavid: The only outside capital into the company before IPO from TVI. Then Dave went on to co-found August Capital where he is a partner emeritus these days. I think Dave was the longest-serving Microsoft Board member besides Bill Gates. Three decades plus.\nBen: Wow. Oh and I have one more. Thanks to good friend Arvind at Worldly Partners for some of the research that he provided as well. So thanks Arvind.\nWell with that, you should check out our previous episode, Microsoft Volume I. If you’ve already heard that, check out our AWS episode. We also recommend our Nvidia series. Part one intersects nicely with this era of Microsoft and we tell some of the PC gaming story from the Nvidia angle.\nLastly, of course, if you are sitting around right now and you’re thinking, oh no, what should I do next? The answer is acquired.fm/sf. We cannot wait to see you at the Chase Center. Mark fricking Zuckerberg is going to be there. It’s going to be the event of the century in the acquired world.\nIf you’ve always thought like, oh, I’ve always wanted to go to something like Omaha, for the Berkshire Hathaway annual meeting where I’ve just wanted to celebrate with other business and technology nerds who also like Acquired, this is going to be the greatest way you could have ever imagined to do that.\nDavid: If you are wondering what you should be doing on September 10th, 2024, there is only one acceptable answer and that is to be in San Francisco at the Chase Center celebrating with us. It’s going to be awesome.\nBen: Yup. With that listeners, we’ll see you next time.\nDavid: We’ll see you next time."
}