{
  "url": "https://www.acquired.fm/episodes/remote-work-no-code-and-products-that-sell-themselves-w-zapier-ceo-wade-foster",
  "title": "Remote Work, No-Code, and Products that Sell Themselves (w/ Zapier CEO Wade Foster)",
  "heading": "ACQ2 Episode",
  "date": "February 24, 2020",
  "description": "We're joined by Wade Foster, cofounder & CEO of Zapier, a company that basically hasn’t raised capital, doesn’t have an office, doesn’t have salespeople, and whose product consists solely of connecting other people’s products. And yet today they are doing well over $50M in profitable ARR, have hundreds of employees and thousands of hyper-passionate customers, and are one of the most interesting private SaaS companies in the world. We’re super excited for Wade to join us and dive into the full story of this came to be!\n‍\nThe Zapier Playbook:\nOr, 5 reasons why a company with no headquarters is the go-to for software process automation\nThanks to listener Jeremy Diamond for contributing these Playbook notes! He’s one half of Automatter, a newsletter about processes and the people who automate them.\n‍\nThe Company\nGetting to $50M in revenue while raising a mere $2.7M of venture capital is virtually unheard of in modern tech startups. Some founders will raise more than that in a pre-seed round. But, coming from Columbia, Missouri, the founders avoided Silicon Valley conventional wisdom that lionized fundraising, prioritized growth over everything, and couldn’t imagine how a 100% remote company would achieve massive success.\nSo how did they do it?\n1. They nailed the timing. In 2012, the first generation of SaaS companies (e.g. Salesforce, DocuSign) were building externally-facing APIs and the first generation of API-first companies (e.g. Twilio, Sendgrid, Stripe) were getting off the ground.\n2. They reduced complexity so much that non-engineers were able to start doing engineering work. When the company was founded, Wade was wrestling with the Marketo API and, in his words, “I was a bad engineer… I write code because I have no choice.” In other words, he set out to build Zapier’s core value proposition: “The easiest way to automate your work.”\n3. They took key steps to lock in their network effect. A standard SaaS approach may have directed development resources towards building new integrations in-house, refusing to leave this core element up to chance. Zapier recognized the impossibility of this task and took a different path.\n4. They aligned their business and pricing model with customer expectations -- and they didn’t overthink it. The apps Zapier connected early on were primarily purchased via self-service, not through dedicated sales teams. The team knew that their target customers were used to purchasing software this way and so they never invested in a dedicated sales team.\n5. They didn’t leave their distributed work culture to chance. They started building the remote muscle from the beginning when the company was a side project. After they graduated from Y Combinator, the founders wanted to live in different places and the first few hires were already able to work remotely. According to Wade, the keys for Zapier’s remote culture are a disciplined workforce and excellent written communication. These are important elements at much larger companies that come to the fore much earlier in the lifecycle of a company with a distributed workforce.\n‍",
  "transcript": "N/A"
}