{
  "url": "https://www.acquired.fm/episodes/starbucks-with-howard-schultz",
  "title": "Starbucks (with Howard Schultz)",
  "heading": "Season 14, Episode 5",
  "date": "June 3, 2024",
  "description": "The Complete History & Strategy of Starbucks‍\nStarbucks. You’d be hard pressed to name any brand that’s more ubiquitous in the world today. With nearly half a billion global customer purchases per week across its stores and 3rd party retail channels, a significant portion of the human population gets their daily fix in the green and white paper cup. (Including our own Ben Gilbert who famously enjoys his daily spinach feta wrap. :)\nBut it wasn’t always this way. Long before the frappuccinos and the PSLs and the cake pops, Starbucks was just a small-time Seattle roaster that only sold beans — and was started not by Howard Schultz but rather the guys who later ran Peet’s (!). Starting from six tiny stores when Howard took over in 1987, this quirky coffee company named after a character from Moby Dick has scaled to nearly 40,000 locations worldwide.\nToday, in a first for Acquired, the protagonist himself joins us as a third cohost to tell the whole story of Starbucks. And Howard is in the perfect moment to do this — after three separate stints as CEO he’s now retired, off the board of directors, and in his own words “not coming back.” So place a mobile order (or not! as you’ll hear Howard speak about), sit back with your own favorite Starbucks items, and enjoy.\n‍\nThe Biggest Thing We’ve Ever Done:\nLinks:",
  "transcript": "Ben: Welcome to season 14 episode 5 of Acquired, the podcast about great companies and the stories and playbooks behind them. I’m Ben Gilbert.\nDavid: I’m David Rosenthal.\nBen: And we are your hosts. Seven years ago, David and I did an episode on the Starbucks IPO, just the IPO. That episode was a mere 1 hour and 24 minutes, and Starbucks is a $90 billion institution in our world that deserves the full Acquired treatment.\nDavid: What were we thinking?\nBen: Well, it actually was amateur hour back then, David.\nDavid: Got to start somewhere.\nBen: Well today, we have a very special third co-host to discuss this third place, Howard Schultz. Howard started working at the small chain of three Starbucks stores in 1982, eventually buying it and becoming CEO. As you probably know, he is effectively the founder of the Starbucks we know today that exists on every corner of the earth.\nI come to you, David, and listeners as an unabashed Starbucks fan. In this tumultuous time for the company, I am absolutely pulling for them in every way possible, and that is going to come through in our conversation.\nYou may have seen the news recently that they had a very rough last quarter with a key metric that you may remember from previous episodes as same store sales. These dropped and their stock price plummeted as a result. This is on top of a tumultuous pandemic era, some of their stores unionizing, and a change in leadership.\nWe thought that this would be the perfect time to sit down with Howard and unpack why Starbucks worked in the first place, and how it works at such a grand scale. What can other founders and business leaders learn from what got them here? And although he is no longer CEO, where do they go now?\nDavid: It really is incredible. One of the very, very small number of food and beverage establishments that has scaled to the entire world.\nBen: Most of those types of concepts do not work in different countries and continents. But Starbucks is different. Today, they’re in over 80 countries with 39,000 stores across the world. They’re even huge in China, a country that didn’t consume very much coffee until Starbucks arrived.\nThey are a bank scale financial institution as well. At any given time, Starbucks holds $1.7 billion that customers have loaded onto gift cards but not yet spent. So how did they go from one store selling beans—not even drinks and cups, just beans—to the default meeting place in communities everywhere? Today, we tell that story. And listeners, this episode has video. We recorded it in person in Seattle at the Schultz Family Foundation, and you can watch it on YouTube.\nAll right, well listeners, we have a gigantic announcement for you.\nDavid: Yes. Save the date. If you love Acquired, you are going to want to be physically in the city of San Francisco on Tuesday, September 10th, 2024.\nBen: And we can’t say much about every detail of it just yet, but it will be the biggest thing that Acquired has ever done. It’ll be in partnership with our good friends at J.P. Morgan Payments. So mark your calendars now. Save the date. And if you want to be first to know details, you can sign up at acquired.fm/sf or click the links in the show notes.\nDavid: Speaking of J.P. Morgan Payments, just like how we say every company has a story, every company’s story is powered by payments, and J.P. Morgan payments is a part of so many companies’ journeys from seed to IPO and beyond.\nBen: And if you want more from David and I, you should check out our second show, ACQ2, where we interview founders, investors, and experts, often as deeper dives into topics that we covered on the main show.\nRecent episodes have been awesome with the CEO and the founder of Synopsys, of Starfish Space, further exploring the space industry, and we’ve got some great stuff in payments coming up next, too.\nDavid: We do.\nBen: All right, so with that, this show is not investment advice. David and I may have investments in the companies that we discuss, and this show is for informational and entertainment purposes only. Onto our episode with Howard Schultz.\nWell, I do have to tell you, and I think I’ve told you this off camera, for the last almost 10 years, every single day starts with a spinach in feta wrap. I assume there are other people like me in the world, but it’s always an iced almond milk latte with whipped cream and a spinach in feta wrap. So thank you for powering approximately a third of the cells in my body.\nHoward: Oh God, that’s a great start.\nBen: I also—here’s another stat that David…\nDavid: You’ve done the math on.\nBen: I have done the math. I exported all of my credit card transactions since 2011.\nHoward: Of course you did.\nBen: And I wish I had more history than that, but that was the oldest I could get. I’ve spent $23,000 at Starbucks since 2011.\nHoward: Oh God. Okay.\nBen: We want to start with Starbucks 1.0. Listeners may know that there were three founders of Starbucks, none of which were named Howard Schultz.\nHoward: Correct.\nBen: So take us back in the Starbucks prehistory before you arrived. How did the company start?\nHoward: Well, since I wasn’t there, this is what I know. There were three founders, Jerry Baldwin, Zev Siegl and Gordon Bowker. The story that was told to me is that one or both of them were going to school in California in the Bay Area, and they became enamored with Peet’s coffee company which—\nBen: Alfred Peet?\nHoward: Yeah. Alfred Peet, more than anyone else in the history of coffee in America, was the true pioneer. He brought specialty coffee, Arabica coffee to Northern California. Jerry Baldwin and Zev became so interested and intrigued with what Peet’s was doing, and given the fact that they were from Seattle, decided they would try and bring Starbucks coffee in the form of Starbucks to Seattle, Washington.\nNow, what is not known is that when Starbucks opened in the Pike Place Market in 1971, they were using Peet’s coffee.\nBen: Really?\nHoward: No one knows that. That’s new. Because they were not roasting coffee. They were bringing coffee from San Francisco to Seattle. They were not calling it Peet’s. They were calling it Starbucks.\nBen: It was Peet’s coffee in Starbucks bags.\nHoward: Yeah. Again, I wasn’t there, but that’s the folklore. After the three founders built that store, opened that store, I get the sense that there was some fallout between the three of them. Zev Siegl eventually left the company.\nThat brings us to 1979–1980, around that time when I came to Seattle, Washington for the first time. I was working for a Swedish housewares company based in Sweden called Hammarplast. That company had a beautiful, non-electric coffee maker, kind of a thermal unit.\nWe had a big customer in Macy’s in Northern California. I was in California on a sales call and I had heard that there was a small company in Seattle, Washington that was buying a lot of this product. Given the fact I’d never been to Seattle, I was already on the West coast, I figured I’d come to Seattle and see what was going on.\nDavid: Was Starbucks buying it for use in…\nHoward: They were selling it in their store.\nDavid: Because this was a consumer device.\nHoward: Yeah, but you have to remember. Starbucks coffee company from 1971 until around 1985–1986 only sold pounds of coffee. There was no beverage. We’re going to get into the epiphany of that. I walked into the Pike Place store for the first time on a beautiful day just like this.\nThe sun was out, there was snow on the mountains, the clean, fresh air, and I walked into the Pike Place Market. I walked into the Starbucks store, and I was blown away by the experience, the romance of coffee, the education. It just spoke to me.\nI had never met Jerry Baldwin, the founder, who was the CEO at the time. I became interested and intrigued with what Starbucks was doing, and asked if I could meet Jerry.\nOne thing led to another, I met Jerry Baldwin, we really hit it off, and we established a vendor-customer relationship over a course of a year or so. Starbucks had three stores at the time, only three. Over the course of the next year or so, I became more and more interested and intrigued with the possibility of leaving New York City.\nSheri and I were dating, we’re not married, and I maneuvered my way into a job working for Starbucks. So Sheri and I drove to Seattle, Washington on Labor Day weekend in our old Audi car with a golden retriever. We came here because I was offered the job as the head of marketing for Starbucks when they were getting ready to open their fourth store in 1982.\nDavid: Still just selling beans.\nHoward: Only beans. Yeah, still the beans. The interest that the company had in me at the time (I think) was they were really interested in expanding, but their dream or the plan at the time was, could we expand to Portland, Oregon? Remember it was a tiny company.\nBen: It was a grand ambition.\nHoward: Yeah, and I never had any idea (of course) what was about to happen and unfold over the subsequent years. I arrived in 1982 as a head of marketing.\nDavid: When you and Sheri arrive here, what was the coffee landscape? There were these three-soon-to-be-four Starbucks beans stores right here in Seattle. Alfred Peet was down in the Bay Area. What was coffee culture? I mean, it was like Folgers and Maxwell House, right?\nHoward: Yeah, it was de minimis. It was another coffee company, which was Seattle’s Best Coffee, which was another retailer that was at the same size and scale at Starbucks, both equal at the same time. But you couldn’t even get a New York Times in Seattle in 1982–1983. It was no good food to speak of, and Starbucks was a true pioneer where they were educating customer after customer about what good coffee tastes like.\nThe Pike Place Market gave them an interesting vehicle because of the tourists. So Starbucks actually started establishing a mail order business as a result of all the people who were coming into Seattle. If I remember, there were so many points that I can remember where people were talking about Starbucks way outside of Seattle as if it was some iconic big company. I think people came to Seattle and were like, this is it? This is the 800–900 square foot store in Seattle, Washington and Pike Place Market. This is the Mecca.\nBen: Tourists would come, they would buy a bag, and then they would fill out some information, say I’d like to have this mailed to me. Because I don’t have anything like it in my city.\nHoward: Yeah, that’s what happened. And because coffee has a shelf life of basically a week to 10 days, and we didn’t have a vacuum bag at that time, we were shipping small amounts because to Jerry Baldwin’s credit, he had such a fastidious point of view about quality and freshness, and I think that had a huge impact on me.\nDavid: But this couldn’t have been a great business. You’re shipping small amounts. . The logistics costs, the scale…\nHoward: This was a small business, but the equity of the brand even back then was much larger than the size of the business. The opportunity that I saw, even when we had four or five stores, was well beyond Portland, Oregon. I was always pushing, we could do so much more, and then the whole thing blew up for me when I went to Italy in 1983.\nBen: Before the Italy trip, I just want to really contextualize coffee in America. I think coffee has been declining since like 1940. It’s still part of the American culture, but it’s not that it’s on the way out. There’s nothing new or interesting except for this little segment of—\nHoward: Especially coffee, which was tiny. I think what you’ve just described, the reason for that is that coffee was terrible. It was instant coffee, stale coffee, and primarily Robusta beans, which was the low-grade coffee that Starbucks was never involved in.\nDavid: Walk us through the two types of beans.\nHoward: There’s mainly two types of agricultural coffee grown for commercial use—Robusta beans, low-end coffee, primarily in instant coffee, and high-grade Arabica coffee. But even within the Arabica coffee, there’s significant segments of quality and integrity, and Starbucks has always played from 1971 to today at the highest level.\nDavid: My understanding from our research is that the Robusta market really developed (as you say) with the instant coffee market, and that was a product of World War II. It was like, hey, we got to get the troops this product to survive. We just need a lot of beans, and we need to ground them up and create this instant product. I believe Maxwell House was involved in inventing.\nHoward: You’re exactly right. It was just fuel, bitter, acidic. I think World War II and the GIs were the impetus for that quality coffee, or not quality coffee to exist and have any run after the war.\nBen: So you show up at Starbucks, you know a little bit about the market because you’ve been a supplier of theirs, but you happen to be a pretty talented salesman from your time at Xerox. I want to make a tie here. Our previous episode was the Microsoft episode, or at least Microsoft Volume I. You were selling word processors made by Xerox. Tell me what word processors were in the mid-70s.\nHoward: My territory was 42nd to 48th Street, from Fifth Avenue to the river. I had to make 50 cold calls, physical cold calls a day. That was the job. The Xerox job taught me incredible amounts about not only selling, but humility. Because the rejection every day was so significant.\nYou put on your suit and tie, you go in an office building—there was no security at that time; just go in and you go from the top floor to the bottom—and then there are other people selling other products who are doing the exact same thing. And you had to get by the receptionist. I was making $1000 a month and living at home when I started. Okay. The word processor was a big machine in which you are editing on that machine to basically create a letter.\nBen: Does it have a screen or is it like a typewriter?\nHoward: It’s a typewriter. No screen.\nDavid: It’s like a typewriter with a little bit of cache so you could fix mistakes for one line, right?\nHoward: Exactly. The job at Xerox at the time was like working for Google. Xerox and IBM were the two pillars of technology and high-tech companies. You told somebody you’re working at Xerox, you had a whole different patina that you were wow, that’s working for Xerox, wow.\nBen: So you quitting what seemed like a stable or pretty good job to drive across the country to provincial little Seattle is nuts.\nHoward: I knew after a couple of years if I stayed at Xerox for a longer period of time, I was going to be locked in there. But I’ll tell you the story that got me to realize I’ve got to get out of here.\nAt the end of the year, the performance appraisal at Xerox was basically a scorecard from one to five. You’d have a qualitative discussion with your manager, and then he would give you a number. When I got a three, I said to myself, I worked all year, I just had a performance appraisal for my manager, and I’m a three.\nDavid: This is amazing. Howard Schultz got a three. This inspiration for all entrepreneurs out there.\nHoward: I got a three. As soon as I got to three, I swear at that moment, I knew I’ve got to get out of here. That’s when I started putting myself in a position of meet other opportunities, and by and large, I was able to get the Hammarplast job, which was the general manager of the company, which was based in Sweden in the US. But I was a three.\nDavid: Do you think having that background at Xerox give you a piece of perspective that helped build Starbucks to what it is today?\nHoward: When I hear the question, I have to go back to my childhood and think everything that I’ve experienced growing up in the projects in more or less a dysfunctional family because of the pressure of money. Getting the Xerox opportunity and having some level of success but realizing I wanted more, the humility which came with rejection, the shame I had as a poor kid living in the projects, all of that I think crystallized in me.\nI give Sheri so much credit in realizing that together we wanted to build a different life, and gave me the courage, the conviction, and the drive to try and do something that I felt I was destined to do. I didn’t know what it was. I certainly didn’t know moving to Seattle was going to create the opportunity of a lifetime. But I always felt I had to get out of that station in life where I was positioned not to get to the level that I thought I deserve to be.\nBen: I don’t think it is common with someone for your background—poor kid in the projects coming from nothing—to get two great jobs, be wildly dissatisfied, and not feel like I’ve made it, but rather, no, there’s got to be something more than this. There’s something deep inside you that caused you to be willing to take a risk.\nHoward: I was really insecure about not succeeding. I didn’t view what I was doing as the success that I was, not destined for—that sounds wrong—that I had the appetite for.\nBen: All right, so we’re getting to the big risk. The year ticks over to 1983. You are sent, or maybe you asked to go to an international housewares conference in Milan. What do you discover?\nHoward: I went to a trade show called Macha with a big convention center. It’s a giant houseware show with equipment and all kinds of stuff. I was staying at a relatively cheap hotel within walking distance to the convention center.\nI get out of the hotel—I’d never been to Italy before—and all of a sudden I am being intercepted with the physical manifestation of one coffee bar after another in the business that I’m supposed to be in. But it wasn’t the business that Starbucks was in.\nI walk in like a normal person that’s never seen this before, and I am just like, I’m in a black and white movie, and all of a sudden everything was color. It was so rich. I couldn’t get enough of it. I just went from one to the other, to the other, to the other. I was just blown away, and more or less raced back to America, sat down with Jerry and Gordon, and said, holy shit. What’s happening in Italy is the business that Starbucks has to be in. They had seen it. They’ve been to Italy. And they said, no, that’s not what we want to do. I just said, seriously?\nI banged on the door for two years. In two years they finally let me open up a coffee bar on the corner of Fourth and Spring in Seattle. It was the sixth Starbucks store. Out of about 1200 square feet, I got 100 feet. I designed and opened the coffee bar, worked behind the counter as a barista. Starbucks probably had 200–300 customers a day selling/holding coffee. We were at 500 in a week introducing lattes, cappuccino, and espresso.\nBen: And there’s nowhere else in town to get a café latte.\nHoward: No one in Seattle had it. Well, Café Allegro had it and that was Dave Olsen. After a few months or six months or so, Jerry said, I don’t want to repeat this. I don’t want to do it. I don’t want to be in the restaurant business.\nDavid: What was the objection? Was it the stigma of the restaurant business?\nHoward: I don’t want to speak for Jerry, I have so much respect for him, but he didn’t think it was clean. He didn’t like it. Now, between 1983 and 1985, Jerry Baldwin, because of his love of Peet’s and his relation with Alfred Peet, had an opportunity for Starbucks to acquire Peet’s coffee company. And they did. Unfortunately, Starbucks buys Peet’s and they get into financial trouble.\nBen: So really at this point, it was like their mentor was retiring. This person who was a steward of the industry, we’re operating six points of retail distribution in Seattle for our beans. Why don’t we just buy your effectively the same business, but in Northern California? Keep them separate for now.\nHoward: Well, it’s important to know that between the opening of the Fourth and Spring coffee bar inside of Starbucks—\nBen: Starbucks number six.\nHoward: Yeah, and Jerry and Gordon saying, we don’t want to repeat this, I was so frustrated. I said, I’m going to leave Starbucks. What did I do? I had no money to open up a coffee store. Jerry says, Starbucks does not want to open up coffee bars, but we will invest in Il Giornale.\nDavid: Which was the company you started too.\nHoward: Yeah, so before they get into financial trouble, Starbucks is an investor. I’ve always thought he did that, so I would sell and market Starbucks coffee in the coffee bar, which I would’ve done anyway.\nStarbucks makes an investment, a couple of people that we know make an investment, but I didn’t have enough money. I go to see two Italian companies. I’ve never told this. One is the espresso company, Faema, and one is the large Italian coffee company, Lavazza. I asked them both to invest in my idea, and both of them turned me down.\nBen: At this point, you’re in Italy, you’re trying to get ideas and investors for what would become Il Giornale, and only Starbucks and a couple of other people have committed,\nHoward: But I didn’t have enough money. I still needed more money.\nBen: You were raising $1.6 million?\nHoward: Yeah, about $1.6–$1.7 million. They said no one is going to buy Italian espresso in Seattle or in America.\nBen: Which is stupid because you watched it happen. I ran this store for six months and it was flying out.\nHoward: They didn’t want to do it. Lavazza and Faema—just get that on the record—turned me down, okay? They’ll deny it. That’s a fact. So then I go back to the US, I’m trying to raise money, and I hit the three titans in Seattle—Jack Benaroya, Herman Sarkowsky, and Sam Strum—three of the leading citizens of Seattle, Washington at the time.\nThe three of them have a little bit of an investment together in other things. They say, we’re going to believe in you, and they take me over the hump. We opened three Il Giornales—two in Seattle, one in Vancouver, BC—and all three are doing well. All three. But I didn’t have enough money to expand.\nDavid: And needing the money to expand—just to pause on that for a minute—businesswise, obviously coffee bars are a much better business long-term than coffee beans, but probably more capital-intensive, right? Needing more staff?\nHoward: More labor, yes. But the stores weren’t that expensive to open because they were small, less than 1000 square feet. We understood how to do it. I was working as a barista with Dave Olsen and other people to keep the cost down. We were behind the counter and I had no salary. I had no salary for almost two years while Sheri was working and pregnant with our first child.\nBen: So looking increasingly worse from a traditional perspective of leaving a high-quality job, moving across the country, than just a couple of years later, here you are not making any money again, while raising millions of dollars to try to start your own business.\nHoward: It gets worse. Sheri is 6–7 months pregnant, she’s working, her parents visits you. They’re from Ohio. Father asked me to take a walk.\nDavid: Oh no.\nHoward: As God as my witness, my true story. Take a walk. He says whatever you’re doing, I respect it, but it’s not a job. It’s a hobby. You need to get a job. My daughter’s pregnant. She’s working. You’re not. I start crying.\nBen: I bet\nHoward: Yeah, so embarrassed. I come home at 3–4 o’clock in the afternoon, whatever it is, I don’t say a word, completely shaken by the whole conversation. Her parents go to bed after dinner, I’m sitting with Sheri, and I said, I got to tell you something that happened. She was so angry at her dad and so upset. She said, there’s no way we’re turning around. We are going.\nShe is the glue to everything that’s happened. I don’t know if she ever had a conversation with her father—I’m sure she did—but the whole thing could have been over.\nBen: And that would’ve been a very understandable response if Sheri had said, I wasn’t going to say anything, but look at our situation objectively here.\nDavid: Putting ourselves in your father-in-law’s shoes, how could you not feel that way for your daughter and her impending family?\nHoward: Her father was a great guy. I understood, but I was embarrassed and humiliated. How could I not be?\nDavid: I guess that’s another dimension here, too. This was not 2024. It’s not like being an entrepreneur was a glorified profession here.\nHoward: In a business that he clearly did not understand, a coffee store.\nBen: The other interesting thing to point out around this time is, for the people who were seeking high risk business investments, this is the late 80s. It’s time to look at tech. We’re now 12 years into Microsoft, Apple’s four years past the Macintosh, and you’re trying to raise money for a coffee house chain.\nHoward: With names that people couldn’t pronounce, and serving it in a paper cup to-go.\nBen: That does not sound innovative to me. I don’t know why I’m putting my risk capital into your…\nHoward: I would bring investors to the two or three stores, and I would make sure there was a fair amount of people in the space. That’s when I started talking about the language of community in the third place. That’s what I saw in Italy. The unlock and the epiphany, of course it was the romance of espresso, but it was the sense of community. That is what was happening very early on in the two stores in Seattle and the one in Vancouver. You could see it.\nDavid: What would people do after they bought the coffee? You said, these are very small places.\nHoward: They would stand up because the two stores didn’t have seating right away. They would stand up at the coffee bar at the window on Columbia Center. It was at 8–9 o’clock in the morning, they were hanging out there, and then late morning they were coming back. You could just feel the relationship that people were having with one another around human connection. I know it sounds trite, but I could see it back then.\nAs I was talking to people about the investment opportunity, I was pointing out, look, what’s happening here. There’s something happening. There’s some magic going on here. It’s not just the coffee. The coffee was the conduit.\nBen: All right, so we’re at the pivotal moment.\nHoward: Starbucks and Peet’s gets into financial trouble. The debt to equity was north of 6:1 for a company that was tiny. Jerry comes to me and says, Jane (his wife) and I are going to move to California. We’re going to keep Peet’s and I’m going to sell Starbucks. My heart is pounding. I said, okay. Then he finished it and he says, I think you’re the person to buy Starbucks. I said, that’s fantastic, but I don’t have any money.\nDavid: You going to give it to me?\nHoward: I have no money. How much is it? $3.8 million. Now we’re in 1986–1987. Now we get into a story I have told but not 100% because I protected the guy, but I’m going to tell it. I go out to raise money. I’m having a hard time.\nJerry gave me about (I think) 90 days to raise $3.8 million. Around the second month, he just came to me and said, where are you with all this? I think I had about half of it raised. I might have fibbed a bit and said I had a little bit more, but I had about half. He lays a bomb on me and says, Howard, listen. We’re in a tight situation here, and one of your investors has put an all cash offer on the table with no due diligence, and wants to close right away.\nBen: For him to take it over, not you.\nHoward: Yeah, I’m out. I’d be out. I said, who is it? He told me, I’ll save that. I’m absolutely annihilated, crushed because I didn’t have the wherewithal, and I could just envision, as soon as I heard that name, I knew it was over.\nI was in a basketball league at the Seattle Club. I’m playing basketball that night. My good friend Scott Greenberg, who’s an attorney at a prestige firm in Seattle, the Gates firm, I’m basically crying to him after the game and telling him the story. He says, you’ve got to come to the office tomorrow and meet our senior partner and tell him the story—Bill Gates Senior.\nBen: A titan.\nDavid: Incredible.\nHoward: The other Titan.\nDavid: We foreshadowed this on the Microsoft episode.\nHoward: There were three titans there, but here is the titan.\nDavid: And Bill was 6’7”?\nHoward: He’s 6’7” a mountain of a man and very imposing. So nine o’clock in the morning I put a suit on. I must’ve been sweating through my shirt. I was just so anxious, so nervous, and at the same time, so scared about what was going to happen. I go in there and I must’ve been trembling. I was just so nervous. I tell him exactly what I just told him.\nHe interrupts me and he says, Howard, I’m just going to ask you two questions. Is everything you told me true? I said, Mr. Gates, yes. Have you left anything out? No. And he says, come back in an hour. I said, okay, to do what? He says, I’ll see you in an hour.\nWe walk out, and walking around I think we probably went to Columbia Center to get a coffee and come back. I go back with Scott and Mr. Gates says, Scott, I’m going to see Howard alone. Scott leaves. Now I’m alone in his office. I hardly sit down, and he says, we’re going for a walk. I said, where are we going? He says, we’re going to see the man, who was Sam Strum.\nBen: One of your investors.\nHoward: One of the investors. We walk across the street to the old Rainier Tower. I think Sam had one of the biggest offices. We walk in there, and I swear, even though it’s so many years later, I have a perfect vivid account for what took place.\nSam is sitting behind his desk and this is what happened, because it was five minutes. Bill Gates—remember he’s a huge guy—leans over to the desk with his hands on Sam’s desk and says, I don’t know what you are planning, but whatever it is, it’s not going to happen. And he says, Howard Schultz is going to acquire the Starbucks coffee company and he’s never going to hear from you again. That was it. And we walk out. That’s it. That’s the whole thing.\nBen: Did you hear from Jerry that the bid had been dropped?\nHoward: We walk out, and I say to Mr. Gates—\nBen: There’s one little problem. You still need the money, right?\nHoward: Yes. I say to Mr. Gates, what just happened? He said, you’re going to buy Starbucks coffee company, and my son and I are going to help you. We raised the money and that’s the story.\nI never spoke to Sam Strum again. I’ve never mentioned his name publicly. I never mentioned his name in this book. And I say it respectfully. I’m not trying to, but that’s the story.\nBen: And Sam—for anyone who doesn’t live in the Seattle area—his name is on buildings and community centers. I mean, this revered philanthropist, I actually don’t know his business background. How did he become the titan that he was?\nHoward: He was involved in real estate and also in those auto stores.\nBen: How did you get him off the Il Giornale cap table? Wasn’t he an investor in your existing business?\nHoward: No, he was still an investor. He and his family were investors to the end until they got out.\nDavid: Looking back now, what do you think happened? Did he have any legitimate criticisms of you as running the company?\nHoward: No. He had a henchman who was his money guy who figured out we could just take this company, and what do we need Howard Schultz for? He’s this young kid. Mm. He and Sam had experience with retail, with those auto stores.\nBen: I see. He could install some professional management from some other venture.\nDavid: Run the playbook.\nHoward: It would’ve been over. But the thing about Bill Gates is I saw him socially 100+ times. He never ever said anything public about what he did. He never took credit for it.\nBen: For listeners, Howard told this elsewhere. You spoke at the Microsoft CEO summit. You recounted this story to the Fortune 500 CEOs, and Bill Gates III, Microsoft founder comes up to you afterwards and says yeah, who was the guy?\nHoward: But Bill did not know the whole story. He didn’t know any of it. He didn’t know what his father had done for me. He’s hearing it for the first time.\nBen: This is 2015 or something. You would think—\nHoward: No, he didn’t know.\nBen: Someone would want to tell their family I played some significant role in this, but that’s not the type of guy he was.\nHoward: Bill Gates Senior never told a soul what he did for me. Again, humility. Incredible lesson about humility.\nBen: It’s amazing. Were Bill Gates Senior and Bill Gates III investors in that $3.8 million round?\nHoward: Bill Senior was, but I don’t know if it was part of Bill or—\nBen: Yeah, Microsoft. Interesting. I asked Sheri about this when I was preparing for the episode, and her recollection was, it was something like one to two weeks before the three-month exclusivity for you was going to be up. This event happens, but now you need to come up with the money, and you have this unbelievably short period of time to do so.\nShe said that you were calling everybody you knew. She was calling her clients—because she’s a designer—trying to just find pockets of $50,000 here, $100,000 there, anywhere you could to make it happen.\nHoward: Yeah, but I had another angel who helped me by the name of Jack Rodgers, who became a lifelong friend who passed away a couple of years ago. He was part of an investor group and he brought them along.\nDavid: So the acquisition goes through.\nHoward: Yeah, August of 1987. We bought the six Starbucks stores, we had the three old Il Giornales, and there were two stores under construction. At the end of the calendar year, we had 11 stores and 100 employees in 1987.\nDavid: All in the Northwest. Meanwhile, the original Starbucks folks, they’ve now gone down to California.\nHoward: They went to California.\nDavid: When did Peet’s open coffee bars?\nHoward: Many, many years later.\nDavid: Ah, so you weren’t competing right away.\nHoward: No.\nBen: But this is one of the great observations, David. Il Giornale buys the Starbucks stores, rebrands Il Giornale Incorporated as the Starbucks Corporation, and the original Starbucks had owned Peet’s and now needs a new name, so it rebrands the company, Peet’s. So Peet’s was actually Starbucks. Starbucks was actually Il Giornale. It’s amazing.\nSome stats just for listeners to understand the gravity of this situation. For the initial $1.6 million that you raised for Il Giornale, you talked to 242 investors, 217 of which said no. Anybody who’s griping about their fundraising journey, and those are rookie numbers—\nHoward: But you asked me a question earlier about what did the years at Xerox teach me? The rejection I was going through, the Italians turned me down. People in the US turned me down. Nobody would believe in the idea. It was like I was cold calling again at Xerox.\nBen: The other thing that is worth pointing out is the Starbucks company with the six stores, when they bought Peet’s with that 6:1 debt to equity ratio, basically backed themselves into a corner, where now they had these big debt service payments to make. There was really no risk they could take or innovation that they could do because the whole business needed to spit out a certain amount of cash every month so they could pay down the debt.\nWhen you’re in that situation, Starbucks in the 40 years ahead from this point in the story, has tried all sorts of crazy things to become the business that it is today. When you first created this combined company, you were pretty religious about no debt.\nHoward: No debt. I want any debt again because of my childhood.\nBen: I was going to ask you, was that informed by what you had seen with the Starbucks situation or more your childhood?\nHoward: It was totally my childhood. My parents were always in debt. Bill collectors were always calling, and no, we never had any debt the entire time. Never.\nDavid: This is probably a good point in time to talk about the business model a little bit. You’ve alluded to a stigma at least among potential investors and the original Starbucks founders of the restaurant business. What did the economics of the business of the coffee bar business look like when you bought the Starbucks stores?\nHoward: What did we buy? We had the stores, we had the brand name, and we had a roasting facility on Airport Way in Seattle. The ability to source and roast coffee, and put that through the supply chain of a beverage gave us probably at the time an 80% gross margin.\nDavid: That is not the “restaurant business” that people are imagining.\nHoward: And I could begin to see even early on the accretive nature of frequency, where I can see what was going on here is people were not coming for coffee in the morning anymore. The morning rush was getting bigger, the need for more labor, and I could sense that the business that Starbucks was in was going to be significantly in the back, and the beverage and the romance of the theater, and the third place was the hero. It didn’t take us long to realize we had the beginning of lightning in the bottle.\nDavid: Even the best, most successful restaurant you could possibly imagine, how many times are their most loyal customers going to come there in a week?\nHoward: There was a time in the northwest when we were really at our peak where the average customer was coming 18 times a month. I should rephrase it, maybe the most loyal was coming 18 times a month.\nBen: There’s some magic to this idea that it’s not a terribly expensive item. I think I saw some research that said that it’s sub-1% of someone’s household income and often far less than that. But it is repeat and it is high gross margin.\nWhen you say lightning in a bottle, there’s a cultural lightning in a bottle, but there’s also this ridiculous business model where the way it shows up is your stores basically from this point forward, for all of Starbucks’s life, you build a new store and the profits from that store would totally cover the costs within two years, and often a year-and-a-half.\nHoward: But I’ll tell you the economic model that we applied to every single store we were opening. By the way, I chose the first 500 locations myself. I was in it in so many ways. But the economic model and Wall Street, when we went public in 1992, when they heard the model, I said, well, we’ve never seen a model like that. The model basically was a sales to investment ratio of 2:1 and an operating profit of 20%.\nBen: What does that mean, sales to investment ratio?\nHoward: If the sales were $1 million, the investment was $500,000. Just the sales to invest had to be a 2:1.\nDavid: And you’re one of operations?\nHoward: Yeah, and the operating profit was north of 20%.\nDavid: You get that two years at the last payback. The retail world had never seen a model invest before. There was no physical storefront that had this business model before this.\nHoward: Early on it became clear to us that customers were also starting to customize the beverage on their own. The barista was behind the counter and somebody would say, can you put something else in there? Yeah, what do you want? The average ticket started growing as a result of the customer’s personalizing and customizing their beverage.\nBen: And to be clear, the era of Starbucks we are in right now, you produce drip coffee and you produce espresso, and you can put that espresso in froth milk. Those are basically your options. None of this…\nHoward: Exactly. But can I tell you a mistake I made?\nDavid: Please.\nHoward: When Il Giornale was getting ready to open, the standard cup in the world was that terrible styrofoam cup that is used in diners in New York City. Remember that cup?\nBen: Yeah.\nHoward: I put boiling water into that cup. Five minutes later, the cup is starting to turn a golden color because of the chemical.\nBen: That can’t be good for your insides.\nHoward: Or the taste of the coffee. We had to change the cup. This was such a smart move in retrospect, but we were just trying to figure out, now no one in America that is in the paper business had any cup or lid that was compatible with what I was trying to do. In fact, they didn’t understand it. Why not just use the cup that exists? I said no, because it doesn’t taste good and it doesn’t feel right.\nBen: Why go to the trouble of this perfected roast of these beautifully sourced Arabica beans from all these farmers if you’re going to pour it into styrofoam?\nDavid: Do people think you were a hippie?\nHoward: They dismissed me. We went to Chicago, to the International Paper company. They had a cup, but the cup didn’t have a lid, a compatible lid. They found a lid, that beautiful sip lid which is now ubiquitous in the world. Howard Schultz should have said to them, I want an exclusive on that lid, because that lid became the standard for the world. If I would’ve just understood that.\nThe other thing I didn’t do is we introduced café latte to America. We didn’t trademark it. We trademarked Frappuccino later on, but we didn’t trademark café latte. I wasn’t thinking.\nBen: You got enough right. You don’t need to get them all right.\nHoward: No, I missed it.\nDavid: When the sizing—grande, venti.\nBen: The hidden trenta.\nDavid: Right. When did that start?\nHoward: There was a brilliant, brilliant guy who was the architect of the name Starbucks, named Terry Heckler in Seattle, and he was a fantastic design guy. We’re just sitting one day and I was just talking about the importance of language. We got to get the language right. We got the cup, we got to get the language. We just started talking about changing it from the pedestrian words of small, medium, large to what it became, which was short, tall, and grande. People made fun of it, but they loved it.\nBen: Was venti not an original?\nHoward: We didn’t have that size when we started. That was later on. Who would’ve thought somebody wanted this?\nBen: This is America.\nDavid: Yeah, this is. My one more question on this. Writing the customer’s name on the cup.\nHoward: That didn’t come from me. As the stores got busier and busier, the baristas were having a hard time with whose cup is it? What are we going to do? Someone at Starbucks, I don’t know who it was, started writing names on the cup, and it just became standard. So much of Starbucks’ success came from customers asking for things we weren’t doing, and Starbucks employees who became partners in 1991, understanding the business better than me.\nDavid: This is all to my mind, just starting to create this incredible flywheel of you’ve got this 80% gross margin business, where the key lever is repeat loyal customer visits. You’ve got customization that is making customers more loyal, and increasing your margin at the same time because you can charge more for it. You’ve got the interpersonal relationship with the baristas, sure, but also the name on the cup, that’s something that scales even as thousands and thousands of people come into the store.\nHoward: The intimacy with the customer and the barista became a very powerful component of the equity of the experience. And I’ve always thought in so many ways, Starbucks became the first experiential brand at scale. We didn’t spend any money on marketing. Zero. There was no money for marketing. And the iconic cup became a badge of honor, because people were doing something that was new and novel and walking in the street with it, and people what is that? It’s a lot of that kind of stuff.\nDavid: It’s your free billboard that people are proud of.\nDavid: In this era, you must just be getting more and more excited every day.\nHoward: I was out of my mind.\nBen: David, Howard sent me a 1988—I can’t believe this was filmed—shareholder and employee meeting, where it’s great. The whole thing’s like an hour-and-a-half. It’s all there. You are using all the same language that you use today back in 1988. We focus on our people. Those people delight the customer. The customer delights or satisfies the shareholder. The conviction that you have is like watching a preacher.\nYou’re up there, you’ve got I think 11 stores or something, and you’re like, you have no idea what we have here. We are on top of something that is going to change—you don’t say the world—America, and this thing can become America’s coffee house.\nIt was interesting because I think the whole room was already scared of your ambition of going nationwide with this thing that there did not exist another example of a national coffee house chain. Everything was just these little cities, these small markets.\nThere’s this great quote that you have at the end of the meeting that says, “The company since 1971, has been growing at a very, very slow pace. As a result of that, you combine Il Giornale and Starbucks together. We’re going to take your 6 stores that you’ve built in 17 years and we’re going to go to 26 in one year, and we’re going to go to over 100 in 5 years.” That must have just sounded bonkers, but that is literally what happened.\nHoward: That’s what happened.\nBen: The pace of growth approximately, you just doubled stores year over year over year. Was there some moment in 1988, 1989, 1990 where you’re just looking around realizing, we must expand as fast as we possibly can because this concept is the concept the world needs now. And if we don’t pull out all the stops, someone else is going to do it.\nHoward: There were regional competitors who were making noise about doing what we were aspiring to do. I was very mindful because one of them was franchising, that was Gloria Jeans out of Chicago. At one point, I think they had more stores than we did because of the franchising opportunity. That’s one of the reasons why I went to Chicago as well in 1987–1988.\nBen: Because Chicago was the first market outside of Seattle and Vancouver. right? Even before LA.\nHoward: Yeah, and it didn’t work right away. Howard Behar should be credited with so much of the cultural texture and the tapestry of the humanity of the company. Said, I will go to Chicago and fix it. He went to Chicago and stayed in Chicago through the winter, and recalibrated the mistakes we were making. Of course, he and Orin were so instrumental into the loneliness that exists as a entrepreneur and their ability to help me build the company that you know today.\nBen: I have in my script here; this is literally labeled the H2O era. For anyone who was a partner at Starbucks, knows what I’m talking about. Anybody else outside has no idea. There’s two Howards. There’s Howard Schultz and Howard Behar. Howard Behar joined in 1989. Orin Smith joined in 1990.\nThe way that it looks to me from the outside—and you can tell me if this is right—you were the vision and ambition that would almost take any ambition that anybody else had and force them to think bigger and faster. Howard Behar was in many ways the soul. He brought the idea of servant leadership. He brought the idea of nothing else matters if we aren’t people first. Obviously, that became a huge tenet of Starbucks as we knew it through the 90s and 2000s, but that seems like it really arrived with him. And then Orin is like a numbers God.\nHoward: No. He was the adult in the room. More than the numbers. He had the style, he was quiet, he was a gentleman, he was the only MBA in the company, but he was the wise man who behind the doors could say to me and Howard, you’re both full of shit. We’re not doing that. And we listened, more or less.\nBen: Is it true that the three of you had dinner every Monday night for a decade?\nHoward: More or less, that is true. Sometimes more than once if we had a crisis or two, which generally we did, or we had a disagreement. There’s a lot of creative conflict, especially between Howard and I. Because he had to operate what we were trying to do, and at times he thought we were growing too fast or ahead of the resources.\nBen: Because he was basically training all these operators, the management fleet of the company.\nHoward: He was building the operating system for us to be able to open the store, design the stores, which more or less I had done, build them, operate them, train them, and create the system to handle the flow of customers. His job was much harder than mine.\nDavid: Speaking of system, what did your technology look like at this point?\nBen: Don’t embarrass him.\nHoward: No. There was no technology.\nDavid: Were you running like an Oracle system or?\nHoward: Not at that time. No.\nDavid: We’re talking paper?\nHoward: Yeah, it was mostly manual.\nBen: Eventually, when they did get point of sale terminals, they were DOS-based all the way through 2008, right?\nHoward: Yes.\nBen: The iPhone was out and you guys had DOS-based point of sale systems.\nHoward: Sounds right.\nBen: But obviously technology—\nHoward: Technology was not the secret sauce.\nDavid: I’m foreshadowing here of the future of the company.\nBen: Let’s take it forward from this 1988, 1989, 1990. The first market after Chicago, after you rided that ship, that you decide to enter on the West Coast is LA.\nHoward: That’s the big fight between Howard and I.\nBen: I don’t think I realized it was a big fight.\nHoward: I just felt in my bones we had to go to LA. He said, we’re not ready for LA. We’re going to San Diego. I said, San Diego? Who’s in San Diego? No, we’re not going to San Diego, We’re going to LA and I’ve got the location.\nBen: You wanted to play in the majors.\nHoward: Yeah. So we had a meeting about it and it erupted, erupted into a bad scene. One thing led to another. We did go to LA.\nBen: I’m shocked.\nHoward: We did go to LA and it was fine. The equity of the brand, I could see, I could envision the warm weather, everyone walking around with our cups, the media, the celebrities, and just the iconic way. There was nothing in the market. Nothing at all that even appeared to be in the business that we were in. Anyone who was doing it was not doing it well. We had to go.\nEven though we maybe were not ready, we just had to do it. And we did. I think Howard would agree today that that ended up being the right decision. And LA, the halo on Starbucks from Seattle to Vancouver and Chicago was nothing. When we went to LA it just exploded because celebrities embraced Starbucks.\nBen: Was there an intentional strategy to create a luxury brand out of Starbucks? Like the cool people were carrying the Starbucks cup? It might be a little bit expensive, but you can afford it.\nHoward: No. I can never remember a discussion about segmentation of the brand because we wanted Starbucks to be accessible to all. You’d have a CEO of a company and the person behind him was a blue collar truck driver because everyone could afford the affordable luxury of Starbucks at the time.\nBen: When you say affordable luxury, what about it was luxury?\nHoward: The quality of the coffee, the experience, and what it felt like to walk around with that cup at the time. It was a badge. It was like you were in the know. It wasn’t a badge of luxury. It was just something new.\nBen: It became a trope for decades now that it’s, oh, it’s a $6 latte or an $8 latte. Where does that come from? In your mind, is Starbucks premium priced? Is there actually a Starbucks gets to charge a little bit more because the brand has more cache? Or is that just completely a farce or myth?\nHoward: I think the pricing of Starbucks was directly linked to the economic model that I alluded to earlier, and the rising costs of labor, rent, and the fiduciary responsibility that we all felt to achieving the promise we had to our shareholders. Now we’re talking about as a public company.\nThere certainly was a fair amount of discussion all the time about the sensitivity of the price points. In later years, maybe in the last couple of years, given the consumer inflationary time, I think it’s become a bit of a problem.\nCertainly, I’ve always said as Starbucks was growing, that the ubiquity of Starbucks was an enemy to the company. The challenge was we have to figure out a way to ensure the fact that we are getting smaller as we’re getting bigger, specifically how do we maintain intimacy and the currency of trust with our customers and our people.\nThat unto itself is the capsule of making sure that the growth doesn’t become so intoxicating and so seductive that we lose sight of the really secret of the company, which was the internal culture and values, which built the brand and built a relationship with the customer.\nDavid: Can you tell us about the people? This is such a huge pillar to our minds of building Starbucks.\nHoward: Again, we started this conversation talking about childhood. I really want to build a different kind of company. How do I do that in a way that provides respect and dignity, because I was so imprinted with how my father felt disrespected, devalued, and vilified as an uneducated blue collar veteran working in a series of jobs that he just never made it, and living through the dysfunction of a poor family always under pressure with money.\nI wanted to crack the code on how do we create benefits that would in a way take the company in a direction no one’s ever been in before. So early on, we started talking about exceeding the expectations of our people so they can exceed the expectations of the customer. The first time we actually were able to manifest, that was a year before the IPO.\nThat was an incredible struggle because I had on my board two venture capitalists. I was proposing something that had never been done before, and that was, I wanted to give equity in a form of stock options to every single employee in the company. They just said, what? What are you talking about? We’re not doing that. So the fight became.\nUltimately, we gave 14% of everyone’s base pay in the form of stock options at the end of the year based on the strike price. I had to do it the year before the IPO. Had to, so everyone wouldn’t miss it. I think the turning point of the culture of the company was the day we announced that and we became partners.\nTo the credit of Craig Foley, who was the VC, and Jamie Shannon, they believed that performance would be enhanced, attrition would be lowered, and that the brand would just elevate as a result of that. And it was true. Completely true. That changed Starbucks for decades, along with some other events based on doing the right thing.\nBen: The healthcare for part-time workers.\nHoward: Healthcare, I think 25 years before the Affordable Care Act, what we did with Comprehensive Health Insurance. That also I grew up in a family with no health insurance, and I saw what happened. All of that is that is the origin story of mine, and the tragedy is my father passed away and never saw what we were able to do.\nBen: Do you want the stats on that initial employee stock grant?\nHoward: I’d love to hear it.\nBen: The program was called Beans Stock, listeners that Howard was alluding to. Amazing name. In 1988, the health benefits roll out even to part-time employees, including gay couples in domestic partnerships, I believe the first of its kind, that was a 33-store company at that point.\nA few years later you had grown to 55 stores, you did the LA expansion. Then in 1991, which is the year before the IPO, Beans Stock happens, equity in the form of stock options goes out to everyone working 20 plus hours a week. There were 1300 employees at the time. I believe is the first time in history that part-time employees were offered a program like this.\nThose initial grants, the strike price was $6 per share. Today as we speak, the share price is $77, but there have been six splits since then, which comes out to a 64X. That initial grant has 800X’d since even the part-time employees and baristas were offered the opportunity to buy Starbucks stock.\nHoward: A lawyer, I think Scott Greenberg at the time came to me and said, we can’t do this unless we get approval from the SEC because we were over 500 shareholders.\nDavid: We’ve studied lots of amazing companies on this show who have lots and lots of different business models. But one thing that just kept striking us as we were preparing for Starbucks are the similarities to your neighbor here in the Northwest and Costco.\nHoward: Costco, right.\nDavid: And how you treat your people, specifically.\nHoward: That’s not by accident.\nBen: Both from a it’s-the-right-thing-to-do perspective and the amazing business model benefit of retaining employees. It’s so expensive to train a new employee. It’s not expensive to keep an existing employee, so you can just pay people more if you keep them for longer. You just basically have extra money lying around is what Costco discovered.\nThere’s so much about Starbucks to David’s point that’s similar to Costco. Did you ever speak with Jeff Brotman or Jim Sinegal or any of those guys about this concept?\nHoward: Do you know the answer to that or is that I actually—\nDavid: No, we don’t.\nBen: I assume the answer to this, but I don’t know it.\nHoward: First, Jeff Brotman invested in Starbucks in the round to buy Starbucks.\nDavid: No way.\nHoward: Yeah, in that 1987 round. That’s when I met Jeff for the first time. Jeff became a board member of the early imprinting of Starbucks and clearly a mentor of mine. Then he introduced me to Jim Sinegal.\nThere were many moments of me sitting with Jeff and Jim, including the huge decision to put Starbucks coffee in Costco, which there was a revolt inside the halls of Starbucks saying no effing way. And we did it.\nJeff and Jim took me to a parking lot in Kirkland when I said, I don’t know if we can do this. I don’t know if I can sell it inside. I don’t know. Okay. Meet us on a Sunday morning, whatever it was. Look at the cars. These are your customers.\nIn fact, putting Starbucks in Costco, we were able to measure directly the increase in volume in the stores on the east side as a result of the proximity to the Costco store.\nBen: You sold beans in Costco.\nHoward: We sold beans, yes.\nBen: And that brand awareness of I buy Starbucks beans at home meant that that group of people went to the stores [...].\nHoward: Because we introduced thousands of beverage customers to Costco through the beans. Jeff and Jim were instrumental in so many things and were so kind to me as a young kid. And then we went nationwide with Costco.\nBen: This is a thing that I think many people don’t realize now that Starbucks is ubiquitous. We forget about this time when it wasn’t and where people had to find some way to experience Starbucks. You only get a few stores in each of these cities, you’re only in a few cities, but there are ways to scale brand awareness.\nYou can do things like become the official coffee of United Airlines or be in Costcos all over the US. You did this a number of times and I feel like the rest of the world did not catch on to what you were doing, was just finding little billboards everywhere where you could put the Starbucks logo and create that ubiquity.\nHoward: If you thought the Costco revolt was high, you can imagine when I said we have an opportunity for United Airlines. People thought that was absolutely blasphemy. Don’t do that. Again, the exposure and the opportunity to surprise and delight customers in places that they’d never had anything close to good coffee. All these things when you consider, we didn’t spend a dollar, a dollar of marketing dollars ever.\nThe reputation of the company was built basically word of mouth, both inside our stores and exactly right in places that we could surprise the customer. Then we also started putting Starbucks coffee in grocery stores, which was the other thing. Because remember, we were building a beverage business, and we were then going back to our core business in new channels of distribution.\nBen: It’s like the ultimate goal is to capture those margin dollars from selling cups of coffees in the stores that you operate. But there’s all these other things that you can do that actually might spit off some profit dollars, but at the very least, it’s a break even way to do customer acquisition and brand building in the rest of the world.\nHoward: I don’t know what our cost of customer acquisition was back then, but it was low.\nDavid: You weren’t spending any money on marketing, so.\nBen: United Airlines was paying you for coffee, I assume. I don’t know exactly how the thing went down. I have to assume the Barnes and Noble is basically the same thing.\nHoward: Barnes and Noble was a different deal. I met Len Riggio, the founder of Barnes and Noble. Very interesting guy, very smart guy, great merchant. We just started talking. He was from Brooklyn. I was from Brooklyn. We had a natural relationship. I said, what do you think about us opening Starbucks inside Barnes and Noble, given you are the ultimate third place is what we are. And it just, again, became a natural extension of our stores.\nDavid: We have a fun piece of trivia that you may know related to Costco. Do where Jeff Bezos and Jim Sinegal met for the first time?\nHoward: Sounds like in a Costco?\nDavid: Not in Costco, in the Starbucks, in the Barnes and Noble in Bellevue.\nHoward: Did not know that.\nDavid: That led to so many things, Amazon Prime among them.\nHoward: Did not know that. And I still am friendly with Jim Sinegal today.\nBen: Your companies rhyme in so many ways. That’s not surprising at all.\nI want to talk a little bit before we get to the IPO here about what the strategy was when you expanded market by market. Did you try to sprinkle a few stores in and see? Did you try to move into a market with force and be the dominant coffee house chain in that city? In particular, it could be worth talking about Boston.\nHoward: Boston’s an anomaly because of the acquisition. Behar was so strident in not expanding to multiple markets at once. He was 100% right. We went to Chicago, Went to LA, and we stayed there for quite a while. Went to Portland. We weren’t ready for New York City in terms of the issues there, but we were very diligent.\nBen: You went to DC first.\nHoward: Went to DC. We were not expanding to multiple markets until we had enough evidence in the existing market that we had success, and we weren’t going to compound the growth in another market with problems that we’re having in the existing one. And I think that’s all Behar, because was managing all the operations.\nBoston was very different. We had a very strong, high quality competitor called the Coffee Connection in Boston, with an owner-operator in George Howell, who was not unlike Alfred Peet, kind of a gospel of coffee culture on the East Coast. We knew Boston was going to be tough for Starbucks to enter. We also had Dunkin Donuts there.\nBen: A lot of the good real estate was taken by the Coffee Connection, right?\nHoward: Yeah. So George and I never saw eye-to-eye, but it was clear that if we came to Boston in a significant way, we were going to impact his business. I think to his credit, he was willing to sell. So Coffee Connection was the first acquisition. We had to tread very lightly after the acquisition because of the loyalty, be careful with the name, solicit George’s help and advice. Also we needed him to validate for us what we were trying to do. Ultimately, it ended up being a very good strategy.\nBen: I think the numbers are—it was a little bit after IPO in 1994—$23 million. They had 23 locations and they were doing $16 million a year in revenue. If you just look at the purchase—\nHoward: I think it was a one-time sale.\nBen: Or maybe a little over a one-time sale. And the original Starbucks, ironically enough, was exactly a one-time sale, right? That’s what you bought it from the founders for. If they had the lock on all the best real estate and they had burned all the capital figuring out what stores we should be in, what stores we shouldn’t be in, and then you just get to move into that market for one-time sales, 1.5 whatever it is, with all that already figured out, that’s pretty amazing.\nHoward: It probably seemed high at the time, though.\nBen: I’m sure it did. Well, isn’t that the thing about valuations? It always seemed like in the good old days everything was undervalued.\nOkay. Let’s talk about the IPO. It seems like you knew the moment that you bought Starbucks from the founders, this going to be a public company.\nHoward: There was so much about being a public company that meant something to me personally, that it validated the company. It validated me, my own shame and security as a kid. I was a driving force all along. Certainly the year before with Beans Stock is an indication what I was planning. If Beans Stock was turned down, I would’ve waited. That had to be done. I think we only had a couple of quarters of profitability and I think we had about 130 stores.\nBen: What was the revenue at the time?\nHoward: I don’t remember exactly. I know what the market cap was the day it went public.\nBen: I think you ended up doing $93 million that year, but the year before was $50 million or something like that. Companies went public when they were smaller back then.\nDavid: You were a small cap IPO.\nHoward: Yeah, we were, and, we got turned down by Goldman Sachs, you know that?\nBen: I did not know that.\nHoward: I couldn’t believe it. I wanted Goldman Sachs. They were the patina on the prospectus to have Goldman Sachs.\nBen: It would be a very Starbucks thing for Goldman Sachs to be the lead left.\nHoward: Well, Blankfein. I had a good friend who was a senior partner there who since passed away. I thought I had it locked. It was just so many things about it. New York, everything. And they said, no, you’re too small.\nBen: Well, the thing that Dan Levitan told us years ago when we did an episode on the Starbucks IPO was that you were really only considering smaller banks because it was going to be a smaller IPO.\nHoward: Well, I was considering it because Goldman Sachs [...]. I had no choice. Brotman at the time was not a big fan of [...] Schroeder, which was Dan Levitan’s thing, so Alex Frown became the lead. I had my own ego attached to this. I had so much fun on the road show. I was just in my element.\nBen: I was trying to figure out your public comps at the time. I think there were zero publicly-traded coffee companies. Not bean companies, not retailers, not coffee house chains, truly unheard of. So when you’re going on this road show, I think people of course are mystified. There’s literally no public companies like yours.\nDavid: You have a huge investor education problem, right?\nHoward: Yeah. I think we had to take them through everything. We had the product there. We served coffee. I gave them the whole show. We had a short video that was probably in black and white. The comp always was a restaurant, and I was always fighting, we’re not a restaurant. We’re a hybrid retailer. I never referred to us as a café. It was always a store. We are a store. We are merchants.\nBen: Fascinating. I go there and eat many, many meals sitting in your store.\nDavid: But as we’ve been talking about, I mean the economics, you were a store.\nHoward: We were a store. We were a retail store.\nBen: Howard, I’m going to take us through the IPO. You’re the first publicly-traded coffee company. You do end up doing $93 million in revenue that year. Do you remember the exact price that you IPO’d at?\nHoward: Yes. We went out at $17 and the price was $21. The market cap (I think) was $250 million.\nBen: Can you imagine today a $250 million market cap company going public? And people considering that a success. This is great…\nHoward: At the time.\nBen: For your employees, how crazy is that? What—12, 18 months before? I guess 12 months before, it’s $6 a share.\nHoward: We tripled their money.\nBen: Fantastic. And that was when you started calling them partners, right? When they became—\nHoward: 1991, as soon as Beans Stock was instituted, everyone was a partner.\nBen: Is that when titles all became lowercase also?\nHoward: No. Everyone was lowercase from the beginning, out of respect. Everyone was lower case.\nBen: Listeners, when you look up a Starbucks employee on LinkedIn, it always looks like, is that a typo? And then you realize there’s a pattern. All employees always put lowercase titles.\nAnother interesting thing, I was reading The S one last night, the management team inclusive of you owned 18%, but only 9%–10% of that was you personally. The rest of the management team owned just as much as you did as the founder. That does feel unusually high. Do you think that that played a role in getting people’s buy-in and getting them to bleed Starbucks as much as you did?\nHoward: Not intentionally, no.\nBen: Okay. Not a strategy.\nHoward: No. That was not a strategy.\nBen: Interesting. From there, you open in Washington, DC on the East Coast. I think that the reason you picked DC was because your mail order business was strong there. You had proprietary data to know that that was going to be a good coffee city.\nHoward: I don’t know how you found that out, but that’s accurate.\nBen: In 1995, you crossed 500 stores. You had just bought the Coffee Connection, as we talked about in Boston. They had one asset that was perhaps much more valuable than any of the real estate or any of the sales that you would generate from there. They owned the trademark on the word ‘Frappuccino.’\nHoward: And I’m so smart that I looked at that Frappuccino with disdain.\nBen: Really?\nHoward: I didn’t like the name. I didn’t like the beverage. I didn’t think it was appropriate for Starbucks. I just saw Starbucks as such a purity with regard to coffee. I was wrong. Dead wrong, obviously.\nDavid: Putting myself in your shoes back then. Now Starbucks and Frappuccino are like a synonym. You can’t disentangle them. But yeah, it’s very different than coffee.\nHoward: Completely different. A blended cold drink. That was the first cold drink we’ve ever introduced. It was not a coffee forward beverage. When we introduced it in Southern California, it went crazy.\nDavid: What changed your mind to green light it?\nHoward: I didn’t have a choice. Coffee Connection had it, then we had it in Boston, people wanted it. I just went along.\nBen: You ended up like reformulating it, right? It wasn’t exactly—\nHoward: A store manager in Santa Monica reformatted it, and she was on it. I think Howard Behar loved it. People in California loved it. There’s a fantastic story about Frappuccino because of what we did with it. Not in its existing form of retail, but what we ended up doing with it in terms of leveraging the brand and distribution. That’s a another great story.\nDavid: Was that your first bottled drink in retail?\nHoward: Yeah. I went to Atlanta and Pepsi in the same day.\nBen: Atlanta being Coke.\nHoward: I went to Coke, I went to Pepsi in the same day. The Coke meeting was a meeting lasted less than 30 minutes. I can’t remember who I met with. They dismissed me, didn’t view Starbucks, didn’t understand what I was trying to do, and didn’t give me much time to even explain it. Then I went to Pepsi.\nBen: And this is 95-ish?\nHoward: Mid-90s.\nBen: Five hundred stores, you’re a public company.\nHoward: Yeah, but on East Coast, Starbucks wasn’t really well-known. I went to Pepsi and purchased New York, met Roger Enrico, the iconic CEO, and Craig Weatherup, the president of Pepsi. They loved the idea, and we started talking about this.\nSubsequently, Craig Weatherup and I, on a napkin, I swear, shook hands and created a multi-billion dollar business for Pepsi and Starbucks and a 50/50 JV and bottled Frappuccino. Craig Weatherup deserves all the credit for that.\nCraig became a board member of Starbucks. Roger and I were friends until his death, and served on the Dreamworks board together.\nDavid: How did you find yourself at Coke and Pepsi pitching a bottled beverage?\nBen: And was there an internal revolt? Because I could imagine people saying this is a bridge too far.\nHoward: I don’t think people knew what I was even doing. I think maybe a few people. I just had the thought we got to put this in a bottle. We have to put this in a bottle.\nBen: This product, if I’m remembering right, was so successful the instant that it hit short store shelves. You had to pull it all off because you needed to create new manufacturing processes and spin up new factories in order to make enough to actually satisfy demand.\nHoward: Basically correct. We also early on had a recall where they found glass in the bottle. Pepsi, to its credit, took all the blame for that and fixed it. But yeah, from minute one, the power of Starbucks and bottled Frappuccino and doing something we had never—there was no bottle of coffee, let alone. Again, just like the Costco story and the United Airline story, the flywheel of the awareness and people drinking something they could enjoy at home or at work, again, it just created another level of velocity on the brand.\nBen: I’m just thinking about between the cups, but then United Airlines and Costco and the CPG products, there’s got to have been 50 billion Starbucks logos printed.\nHoward: I’m sure that was maybe more.\nBen: I’m sure I could estimate it better at another time.\nHoward: But you can see where the size of the equity of the brand was much bigger than the size of the company. Much bigger.\nBen: Because at this point you were then 800 stores?\nHoward: Yeah, then something else happened. We wake up one day and someone says Starbucks is in a movie. We said, what movie? You’ve Got Mail.\nBen: That wasn’t coordinated?\nHoward: First of all, Starbucks never paid for placement. Someone must have approved it. I knew nothing about it. And then someone said, you got to see this movie. Starbucks is all over it. I said, what movie? Tom Hanks, You’ve Got Mail with Meg Ryan. I knew nothing about it. It was just another thing where it was just like a little fairy dust on the brand.\nDavid: Did you know that it was like the good old days where you’re like, this is just like…\nHoward: We were so in the mud. We were so in it that we didn’t have time to look up. We were just running so fast, so hard. When you’re growing at this pace, it’s almost virtually impossible to catch the growth in terms of the infrastructure.\nYou’re constantly back and forth trying to create that fragile balance between the seductive nature and the intoxication of growth and success, and the foundation necessary to support it, and not falling too far behind where you lose it. But you never are in a position. At least we were never in a position. We were ahead of it. Never.\nThere was a constant push, and I think this is where Orin was the wise man in the room to say, Howard, we just can’t do that now. We don’t have the infrastructure, we don’t have the people, we don’t have the systems. I’d be screaming, we got to do it. If we don’t do it, someone else is. We got to do it. That takes us to international. We weren’t ready for that.\nBen: I want to putting a bow on Frappuccino. The year after it launched in 1996, Frappuccinos were 7% of revenue, which I can attest to maybe freshman year of high school. I had my first tall Mocha Frappuccino with whipped cream and a little chocolate drizzle on top. And now here I am drinking, what are we drinking here?\nHoward: You’re drinking coffee from India.\nBen: No cream, no sugar. The Frappuccino began my journey to the good stuff. So that’s the Frappuccino story, 1996, 1997, 1998. This is the international story. I love the Japan story. You’ve told this to me before, but I’d love to hear.\nHoward: Okay. There’s a couple of things about this. I started taking a couple of trips to Europe and Asia just to get a sense of what the opportunity would be and how would we do it. I quickly wrote off Europe because coffee was there. I didn’t think we could possibly enter as an American company.\nDavid: This would be like an American luxury leather goods company coming in and competing with Hermes.\nHoward: Yeah, not going to happen. So we just took it off the map. Then we narrowed our focus very quickly on Japan. Japan had a couple of thousand coffee stores named Doutor. You walk in there and it was smoke-filled, mostly men, dark, but they were successful. I said to the board, we want to go to Japan.\nThe board was incredibly resistant to the idea. Why? You’ve got all this white space in America. There’s no need to do this at the time. I just said, okay. One thing led to another and my board member said, if you’re considering this, hire an outside resource to do a study. I was a livid about that.\nBen: Aren’t there some consultants you could possibly pay to help?\nHoward: Yeah. We hired a consultant who came back with a big book, presented it to the board. I had a preview, and it basically was, this is a non-starter. You can’t possibly succeed there. In the meeting, I could feel my blood just boiling because with every statement it was getting worse.\nThe economics won’t work. No one in Japan will ever walk in the street with a cup of coffee. They would lose face. Your no smoking policy, which we had from the beginning, is a non-starter. You can’t afford the economics, the rent. Don’t go. Well, that only made me more furious.\nBen: It’s like they’ve never met you.\nHoward: And more intentional. So we kept thinking about this. Then one day we get a handwritten letter from a Japanese company. The founder of the company, Yuj-san, had an LA restaurant, and he was enamored with Starbucks. We sit down with him, we fall in love with him. We weren’t ready, but we decided we’re going to give it a shot.\nWe go to Tokyo, we meet him, we ended up forming a JV. The folklore at Starbucks, which is not that unrealistic, is the reason we went to Japan as an international market is because it had a direct flight to Seattle. That was the extent of our understanding.\nNow we open up in August. If you’ve been to Tokyo in August, it’s hot. It’s like 95 degree temperature and 100% humidity. It’s like getting out of a New York City subway in the middle of August. As soon as you walk out, you need a shower. It’s going to be a tough opening because of the hot weather. I’m very concerned about it.\nI get back to my hotel room and I have a message that CNN is covering the opening live. They got cameras.\nBen: High risk, high reward.\nHoward: I’m so nervous. At 6:00 AM we get in the car, it’s so hot. The tie around my neck feels like a noose. We’re driving up to the store in the Ginza and there’s like 200 people on line. I turned to the translator and I said, did he hire extras? I cut the ribbon, and a young man who slept over the night before to be the first person, a college student, speaks no English, rushes to the front of the line. I follow him, no English, and he says, double tall latte.\nAs God is my witness, just like that. And I said, holy shit. How did they know? And Japan was an extraordinary success from minute one. We got 2000 stores there. I was there a lot two months ago. Incredible. We have a roastery there.\nBen: Why were there people lined up around the block? Why did it work so well instantly? Was it a strong coffee culture or…?\nHoward: No, it was the iconic reputation and anticipation of something that they had convinced themselves was unique, proprietary, not in Tokyo, not in Japan, that they wanted to have. By the way, the research, that cup was all over Tokyo in months. Everyone was walking around with that cup.\nBen: This is nine years after you bought the six stores. It has turned into this icon. In all the events we just covered, Starbucks has already become Starbucks. It is already this globally desirable brand, thereby 1996.\nHoward: I honestly haven’t thought about it in that way, but…\nBen: That’s so fast to build something that—\nHoward: It did seem fast to us.\nBen: I bet.\nDavid: The parallels to the Microsoft story are just so apt. Japan was Microsoft’s first international market.\nHoward: Did not know that.\nDavid: It was half their business, and it started in the same way. Bill and Paul got a cold call from Kay Nishi, who was guy in Japan, who had somehow gotten a hold of the BASIC interpreter, loved it, and said, I’m so passionate about this, I want to bring it to Japan. Fifty percent of Microsoft’s revenue for the first, at least five years.\nBen: They stayed 50% international permanently after that.\nDavid: And that’s what took them from this Albuquerque to like, hey, we’re international.\nBen: So Japan’s 1996 in 1997, you cross 1000 stores globally. You’re getting your feet under you. You’re saying, okay, international is going to be a thing. In 1999, you—\nHoward: Two thousand stores. Because we had a goal of 2000 by 2000. We beat it by year.\nBen: Ah, 1999 you also opened in Beijing. What’s the calculus on entering China, and did you realize it could become such a pillar of the company like it is today?\nHoward: I honestly don’t think we had any real understanding of what we’re getting into. We went there with a partner that didn’t work out. I should tell you that we had a theory of the case that any international market that we opened that didn’t speak English, we needed a partner. Japan was a partner, successful. We entered in a partnership in China early on that was not successful, did not share our values. We got out and ended up going.\nBen: You closed all the stores?\nHoward: No. We got out of the partnership, bought them out and became company owned.\nBen: That was legal to do that, to be an American-owned company operating in China.\nHoward: But we struggled in China for almost a decade. Lost money. There was tremendous pressure inside the company to closed China. Until Belinda Wong, maybe the most valuable person in the company from my view.\nBen: Really?\nHoward: Yeah.\nBen: When did Belinda get involved with the company?\nHoward: Belinda started with Starbucks in Singapore, but she was working in Hong Kong. We were open in Hong Kong. I saw something in her, it was just extraordinary operator and had a touch with people. I said, we were dying in China. We’re really in trouble. Would you come to China and run it? She said, I would consider doing that, but you’ve got to decentralize it. We couldn’t do that right away. It was just too much. But she changed the course of history for Starbucks in China.\nBen: What year was that that she took over the role?\nHoward: I think it’s about a decade after we opened. But she’s still there today.\nBen: I asked because I want to come back to it. There’s a whole interim between 2000 and 2008 where you are not the CEO of the company. If you’ve been listening to this episode, the theme that should be occurring to you is, oh my God. Basically everything worked. I know it didn’t feel like that on the inside.\nYou read all those investment banking reports and it’s like, here’s all these price targets for Starbucks and here’s what we think they’re going to do in earnings. And oh, they beat it again. And like, I dunno, 30–40 quarters in a row. It’s just like this. I would say perfectly predictable, except you actually kept exceeding the expectation, so it wasn’t predictable.\nHoward: I did 100 quarterly conference calls as CEO. A hundred. That’s a lot.\nBen: I bet. That’s a lot of earnings prep because each one of those has two weeks before it.\nHoward: The truth is the majority of those were no script, which became the lead. The lawyers took over after that many years, but no script.\nBen: Which is your preferred communication style. It seems like whenever I see you up speaking, there’s no teleprompters. It’s from the heart.\nAt this point, I don’t want to say it, it would be incorrect to say Starbucks is running itself, but it’s in a great place, and you step into the role of, is it Executive Chairman?\nHoward: Yes, Executive Chairman with Orin as the CEO.\nBen: In 2000.\nHoward: Yeah.\nBen: What was your—\nHoward: I think I was physically and emotionally exhausted. Kids were getting older. I had missed a lot. Just think about all the things we’re doing. I had so much confidence in Orin, so it was no problem. That’s what I did. I was still engaged, but I was not running it day to day.\nBen: At this point, it’s 3500 stores, the company’s doing $2.2 billion in revenue. It feels like, okay, I can get some distance. I can do other things in life. It’s going to work out. At some point, Orin transitions the CEO role to Jim Donald, which I assume you’re also very involved in working with him. What was that transition about?\nHoward: Orin never wanted to be the CEO. He’s not a front guy. In fact, he’s shy and never wanted to be on the stage as a CEO. So he said, I’ll do it for a couple of years. But he’s always knocking on my door saying, we need a new CEO. We didn’t have anyone internally. Behar didn’t want it. So we did a search.\nWe met Jim Donald, great, great guy. Had all this operational experience. Then certain things started appearing that we would just weren’t hitting our stride the way we usually do. The economic environment was getting tougher. Things just unveiled itself that it wasn’t going to work out. By the way, Jim is a great guy, a really good person, but it just wasn’t the right fit.\nBen: How long had he been in that role of CEO?\nHoward: I’d say less than three years. Two years maybe.\nBen: But basically the 2008 happens.\nHoward: The cataclysmic financial crisis is unfolding, and that plus the cracks that we were experiencing. I don’t think the board meeting was set up for me to return, but it just happened in the meeting about, okay, we got all these problems. What are we going to do? Do you want to come back? Yeah, I’m going to come back.\nBen: That was never your intent. When you stepped away, you thought you were staying away.\nHoward: It was not my intent to come back. It was certainly not my intent that we’re going to run into problems. In the Christmas vacation of 2007, I knew I was going to return in January. I was on holiday and I was starting to think through what I was going to do.\nOn that holiday, a friend of mine, I didn’t know he was there but it was Michael Dell was there, and I must have talked to him almost every day about the transformation of Starbucks. He was going through a similar thing at Dell, almost at the same time. We had so many things to talk about. We were comparing notes and everything. So in early 2008, I spoke to Jim and I came back in 2008.\nBen: When you came back in 2008, this is the whole crux of your book, Onward. There’s an entire book’s worth of material here, so we’re not going to do it all. But suffice to say, just to put some numbers on it, the market cap had dropped from $30 billion to less than $7 billion. Same store stales. The comparables number, when you compare the store this quarter last year to this quarter, or this year to last year had dropped, growth began to slow. You come in and you have to make these really horrible decisions. You’re faced with two terrible options, and you got to make the right decisions for the business.\nHoward: First off, every rock I turned over was worse than I thought. There were a lot of unperforming stores that should have never been opened that we need to close. I think we closed a thousand stores. I had a company-wide meeting. I remember it vividly because I started crying and apologized to everybody that we got to close doors, we got to lay people off.\nWe were on our trajectory for all this time, and all of a sudden we not only hit a speed bump, but the world, the music was just stopping. The stock price (I think) broke $6. I was so afraid that we were going to get acquired, but the only cover we had is that the world was coming undone so no one had any resources. I was terrified. I just stood up, apologized, and said we’ve let you down. I promise I’m doing my best, but we’re trying to save the company. Literally we were trying to save Starbucks. Things were that bad.\nBen: You say that we were trying to save Starbucks. In my head, I always thought, well, it couldn’t have been that bad. This is a big, successful company, it’s fast growing, it’s profitable, and then I read you were seven months from being insolvent.\nHoward: We didn’t have enough cash. We never had negative comps in the history of Starbucks.\nBen: Every single quarter was better than [...]\nHoward: Never had a negative comp month in my history of the company. I didn’t understand that. Such an anomaly. We close all those stores and then you got to decide, okay, how do we turn it? What do we do?\nGoing back to your line of questions in the past about the people, is of all the things that I could point to that demonstrates what Starbucks is, has been, and needs to be, it’s the humanity and the people of the company. The company was built on being a performance-driven company through the lens of humanity. That’s how it was built. Whenever we’ve lost our way, we’ve lost our way because people in power didn’t understand that equation. I just said, I need to be in front of every store manager. I need a meeting with 10,000 people.\nBen: It’s a big conference room.\nHoward: So in 2008, no American company was traveling. The municipalities were hungry for Starbucks to potentially have a meeting at a discount. We had Detroit come in, we had Houston come in, and then New Orleans came in. What they presented to us was the need for Starbucks to come as a result of Katrina.\nWhen we heard that, we realized we’ve got to go to New Orleans. In fact, what we’re going to do in New Orleans is we’re going to have one full day of 50,000 hours of community service in the ninth ward.\nNext day, we walk through and we built basically a tutorial on how to restore the business and have people walk through it. We had classes and we had all these things going on.\nOn the third day was my speech in the basketball coliseum to 10,000 people. About an hour before, I was really feeling the burden of how important what I was going to say is. The CFO at the time who subsequently resigned a week later—wasn’t my guy—asked me what I’m going to say. I said, I’m going to tell them the truth. He says, you can’t possibly do that. You’re going to scare the out of them. I went up there, and I laid it out chapter and verse. I think we have seven months left. We are going to be insolvent.\nDavid: I can see why he was freaked out about this. If word got out to Wall Street that you—\nHoward: Social media didn’t exist at that time, but I just laid it out. What if that store was the difference between the food on your table and its success? Then I had this economic formula of how many customers it would take per store to turn comps around, and the number was low. It’s less than 10 per day, or 11 per day. I said, let’s just talk about New Orleans. How many new incremental customers it’ll take in your store? It was manageable and tangible.\nBen: Because you could actually imagine, okay, if 10 more people walk in the door today, and I delight them in a particular way that brings them back tomorrow, we’re turning this thing around. We’re turning this one store around, and if everybody does that.\nHoward: The problem when you get this big is you start thinking about large numbers. But if you reduce it to the locus, lowest common denominator, one store, one cup of coffee, one customer, one partner, and what if all of that works? Well, we rushed out of New Orleans like an effing tidal wave, and we never looked back. And less than a year was turned.\nBen: You did crazy. I mean, the tactics involved in the turnaround.\nHoward: We closed the stores.\nBen: For what, noon onward, right? For an entire afternoon and evening.\nHoward: Because the previous administration had done things that diluted the integrity of coffee to maximize yield.\nBen: What does that mean?\nHoward: Let’s say you’re making a batch of brewed coffee. Well, what if that brewed coffee was based on a number of ounces of coffee? What if you just reduced it just a little bit? No one’s going to know. Just little things.\nBen: Ten thousand little scratches of efficiency that dilute the experience.\nDavid: But that does reflect a misunderstanding of the fundamental business. that this is a business about a store with high gross margins based on customer loyalty.\nHoward: But we were beginning to face headwinds.\nBen: What are the headwinds?\nHoward: Headwinds were the level of attrition of customers.\nDavid: As the financial climate deteriorated, spending that $6 on the latte daily habit gets harder to justify.\nHoward: And we weren’t as good as we were when we were small.\nDavid: Then it makes it easier to give up.\nHoward: This goes back to what I said earlier, growth covers up mistakes and success breeds hubris. And it did.\nBen: How could it not? Starbucks today is so fricking ubiquitous, which again, is one of the things I love about it. It’s consistent. Anywhere I travel in the world, I can count on it. I can mobile order and pay. There’s all these wonderful things. But when you become government-level scale in the world, people assume it’s a piece of public infrastructure. I assume employees even must feel that way during some periods of time like, we’re so big.\nHoward: The worst thing that Starbucks could have become, and the worst thing that Starbucks could become is a utility. Scale and ubiquity creates complexity. Complexity demands efficiency. But we are in a business where that touch point between the customer and the barista has to be protected and has to be elevated. Now, you get stores that are so busy where the barista can’t even look up. Then you get mobile order and pay, which we haven’t even talked about.\nBen: Which is a thing I love and do every day, and depersonalizes the experience by definition.\nHoward: Starbucks demands nurturance. It’s a company that has to be nurtured like a young child. That is an anomaly, inconsistent with scale. You get people coming into the company with different experience, different language. The immersion doesn’t quite hit them in the heart or the soul or the conscience of the company. They feel like they’re doing a good job, but it’s not the job that’s consistent with the integrity and heritage of what the company has been.\nMetaphorically, let’s say that’s a giant reservoir. If you’re taking a deposit on a consistent basis out of the reservoir and it’s getting dry, you better stop. You better make sure you’re making a deposit so they’re equal and it’s balanced. When you get this, that’s when the company loses the plot. And if you get this and you’re making a lot of money, and the stock price is high, people say, it’s okay. We’re fine. And that’s fool’s gold. It’s a camouflage because eventually it’s going to bite you in the ass.\nBen: Have you ever figured out a way to measure these things in a way that, as long as these numbers are a direct tie to our values are good, we can actually put a KPI against them, we know that the core is solid?\nHoward: I haven’t been smart enough to figure that out. But the interesting thing to me today is that the Asian business is operating at a much higher level of the soft side of Starbucks than we are in the US.\nBen: Now I understand your Belinda Wong comment.\nHoward: That doesn’t answer your question about quantifying it, but when I am in Asia, I see things that are very elevated to the brand that speak to the financial performance of those markets, which are very high.\nBen: Okay. Before we get to today, I want to talk about some other things that happened in 2008. 2008 was a big year. So 2008, 2009, 2010, there’s no way to put it other than a wildly successful turnaround. Your low point in 2008 profits were $315 million, and by 2010 they were $945 million.\nHoward: I don’t know how we did that.\nBen: Well, we just went through a lot of the ways of how you did that. There’s a couple of other things here, one of which is technology. I’m told there’s a story you have about Steve Jobs around this point in time too.\nHoward: It’s a funny story. Another story. In Hawaii, when I was on vacation, I’m talking to Michael Dell and Benioff.\nBen: You’re cycling with Michael Dell, right?\nHoward: Yeah, cycling with Dell almost every day, and I’m talking to Benioff. Michael introduced me to Benioff, didn’t know him.\nBen: It’s a pretty good Hawaii crew.\nHoward: I get back, and Adam Brotman who’s a key person in all this in terms of mobile order and pay—\nBen: He ran digital for Starbucks.\nHoward: Yeah, he ran digital. I’m trying to make sure I got sequencing of this right. I think there was a future meeting scheduled for Starbucks and Apple around mobile order and pay and other things. I met Steve on a phone call. I never met him. I was talking to him on the phone and I’m telling him what’s going on. He said, you should come down. He had a whole thing about walking. He would go out and he’d walk around the building. Have you heard this before?\nBen: The infinite loop at their old campus? Yeah.\nHoward: I went down there and basically we took a walk. I just told him all my problems, everything was going on. He just stopped me and he said, this is what you need to do. He looked at me and he said, you go back to Seattle and you fire everyone on your leadership team.\nI thought he was joking. I said, what do you mean fire? What are you talking about? Fire everybody? He said, I just told you. F-ing fire all those people. He’s screaming at me in my face, Fire all those people. That’s what I would do.\nI said, Steve, I can’t fire all those people. Who’s going to do the work? He said, I promise you, in six months, maybe nine, they’ll all be gone. He was right. Except for one, the general counsel, they were all gone.\nBen: Your whole leadership team turned over after.\nHoward: Yes, they were all gone.\nBen: Wow.\nHoward: That’s the story about Steve Jobs.\nBen: Wow. Did you ever call him back and tell him?\nHoward: I talked to him since then. We were on stage together at an event. I told him they’re all gone as well. You’re six months, nine months late, man. Think about all the things you could have done. That’s the whole story.\nBen: Of course. All right. While we’re in technology land, I think today 33% of Starbucks orders are done with mobile order and pay. Obviously, this huge pillar of Starbucks as it exists in our world. How did that start?\nDavid: You had been on pen and paper, then you moved to DOS. And now you have the most sophisticated technology platform of probably any retailer in the world.\nHoward: At the time. You’re talking to a non-tech person. I’m not focused on anything other than the customer experience. Adam Brotman, to his credit, along with Steven Gillette who was at Starbucks very shortly, came to us with the idea of building a mobile app. I didn’t even know what it was. Honestly, we’re in the meeting. I’m trying to figure out what are you actually talking about? How are they going to do that?\nBen: And apps at this point, if it came out in 2009, which was the first version, the iOS SDK came out in summer of 2008. If they’re having this idea and bringing it to you, it’s months after apps exist.\nHoward: Well, they get complete credit for assembling the pieces of all this, convincing us to fund it, and we were off and running. I don’t think any of us, honestly for myself, really knew what they were actually going to create. They explained it to us, but I didn’t really get it until I saw it. And then holy shit, overnight, it was just an unbelievable new vehicle.\nNow, if we fast forward—I don’t know if you want to do that here on what it’s become—it is the biggest Achilles heel for Starbucks. And it’s not even a close second. The mobile app created unbelievable convenience for our customers. But remember, we are an experiential brand. As this thing was growing, there was never an opportunity because it became so seductive for the company.\nDavid: It also created an even better business model for you. It was more efficient and you get the float with customer funds.\nHoward: All that is true, but it was beginning to deteriorate at a rapid rate, the third place experience in the sense of community. Then it overflowed to the point where it disproportionately created an environment in our stores where the mobile app became the primary vehicle as well as the primary vehicle for dissatisfaction, because people couldn’t get their drink on time, people were confused whether that was their drink. A lot of anxiety.\nThe thing I remember the most is that we were in Chicago at 8:00 AM because people wanted to show me the problem. Everyone is getting off the loop, the train at 8:00 AM, and everyone who ordered on their app says the same thing, your drink’s going to be ready in seven minutes. Everyone shows up, and all of a sudden we got a mosh pit, and that’s not Starbucks.\nThe company did not do a good job of anticipating the technological refinements that needed to be put in place to avoid what was happening. I want to be fair to everyone who’s managed the company. For about a five year period, remember, I wasn’t involved in the company from basically 2018 to 2022. I was not involved.\nBen: You stayed CEO from 2008 until 2017.\nHoward: Then I left. There were no bad people and no one had bad intentions, but the heritage and tradition of what I’ve described which is so vital to the nurturance, was lost.\nDavid: It must have been so seductive.\nHoward: Yeah. The stock was at record high, the company was not investing ahead of the curve, not paying attention to the velocity of the mobile app and what it was becoming until it was too late. Now, and the company has that problem today, which they will solve, but it’s late. Also, everyone has caught up to and we were the only game in town, the novelty of that and the uniqueness of it, especially for our product, and everyone pretty much copied it.\nBen: David keeps saying it’s so seductive. To put some numbers for listeners wondering why is the mobile app such an interesting thing, David pointed out the float. If you look at Starbucks’ financial statements right now, at any given time, there’s about $1.8 billion of cash that Starbucks has gotten in the form effectively of as an advance from customers that Starbucks can use to operate. It’s like this amazing—\nDavid: [...] growth capital store expansion, et cetera.\nHoward: We’re not the only one.\nBen: Amazon has this—\nHoward: Apple.\nBen: Yeah. Apple has this—\nDavid: Berkshire has this insurance business.\nBen: But it’s effectively interest-free loan from customers, and a loan that’s not all going to get called at once.\nDavid: Some of it will never get called.\nBen: Right. The breakage. There’s this benefit of, it’s a reasonably predictable amount of cash that comes in that you get to use for your advantage. In terms of velocity, about $14 billion a year gets loaded onto gift cards. It’s unbelievable.\nIf you actually look at all of the banks in America, if Starbucks were a bank and you treated the gift cards as deposits, it would be in the top 10% by deposits of banks in the United States. It’s this unbelievable business model that happens to exist inside of this experiential business that powers this experiential business. But to your point, you have to keep it from eating the core.\nHoward: Let’s just go back, not to the economics but the idea itself, and I think whether we talked about bottled Frappuccino, the cup, you just thread all these things. There is a common through line, and that is we took a commodity business and we transformed it into a premium product brand and experience. But when you are disrupting the market, there has to be some governor on the disruptive innovation to monitor how it is being used, how it is being abused, and the era of judgment in the period where this was really where we really took hold this five year period between 2018 and 2022, is the government didn’t exist.\nBen: You feel like it wasn’t really taking hold in that whole before.\nHoward: It was taking hold. I’m not criticizing anyone because everyone’s trying to do a good job. But the result is the runner, the unbelievable success disrupted the experience.\nBen: And now you have stores that are entirely built to just pick up mobile orders.\nHoward: Yeah. My view is we should not succumb to the mobile app.\nDavid: Looking back now, and not when you’re in the moment and you and others in the management team things happened, but knowing what now, are there a couple of key design decisions or things that you would re-architect differently about the mobile app experience?\nHoward: I don’t think I would’ve allowed the mobile app to be on demand 24 hours a day. I would’ve slowed-rolled the availability of it, then understood how it was being used, and whether or not it was going to disrupt the experience. But now it’s on-demand whatever you want it. And now you shut it off from [...].\nBen: The expectations have been set. Whenever I get that message, mobile order ahead is not available at this time, I’m like, ugh. But it’s available 99% of the time. It’s not available now?\nDavid: I won’t even go to a store if it doesn’t happen.\nHoward: The store’s overrun. You wouldn’t go. That breaks my heart. I hate to hear that.\nDavid: I went to the Presidio store yesterday in San Francisco, and I would go there no matter what.\nBen: I only agree with you in airports. In airports, I’m so time-constrained that if mobile order isn’t working, the line’s too long…\nDavid: But I’ve had plenty of times where I’m looking at stores in the radius, I’m traveling, I’m in a new city, and it’s like, well, I’m only going to go the one that’s open for mobile order and pay. I’m not even going to try.\nBen: Fascinating. I got to hit one other—Howard, I know you hate it—amazing business model benefit of mobile order and pay. If I’m buying $6 lattes over and over again with my Visa card, and Starbucks is getting hit with 30 cents every time, instead if I’m buying $25 gift cards, well that’s now three out of four times I’m going and buying my coffee, and Starbucks doesn’t have to pay Visa 30 cents or the bank 30 cents. That’s a pretty amazing business unlock. I’m aware it degrades the experience, so you have to find ways to deal with that.\nHoward: I’d be more than willing to sacrifice economics to go back to ways to enhance the experience myself, but I’m not in charge.\nDavid: Moving on from technology and mobile order and pay, there’s one more to my mind, key pillar of the Starbucks tapestry—and that’s real estate. Maybe this is a good time because I feel like around this era is when people started looking at Starbucks and scratching their heads and being like, there’s two Starbucks across the corner from one another. These guys must be insane. Talk to us about real estate.\nHoward: The basic idea early on, given the beverage’s velocity in the AM, was to find a corner location in an urban setting where we could physically see pedestrian traffic in a significant way. We would go to cities and just physically count how many people were walking by, what hours they were walking by. Once we had a model of success, it became clear to us what we needed.\nAlso once we became aware of co-tenancy of certain tenants that would be interesting to us, we also were very intrigued with being next to a grocery store early on because of the frequency of it, people were buying food. Anytime we were in an office building where there was 3000–4000 people in a building, that was a home run.\nBut then it became very clear that there were locations that we never imagined we could be in, that became wildly successful and just opened up an aperture to us, that basically we had opportunities to do things that were not traditional for a retailer.\nNow the other thing which we haven’t talked about is a decision I made early on, not the franchise, which surprised you haven’t mentioned that.\nBen: There were franchises.\nHoward: Let me explain that if I can, which is all part of the real estate strategy. I never believed that we could build, maintain, and elevate the culture of the company, which I viewed as the thing in a franchise system, where we had individual franchisees who had their own subculture. Even though there was pressure early on because of the cost of capital, and we didn’t have a lot of money to franchise because we’d have no CapEx. I said, no, we resisted that. I don’t think we’d be having this conversation if Starbucks was a franchise system, because McDonald’s and extraordinary company, but they’re a commodity-based product.\nDavid: Was even saying from the beginning it was about elevating. McDonald’s great company, but nobody would ever accuse them of elevating, I don’t think.\nHoward: And that’s why I don’t want Starbucks to become transactional. Coffee is personal. The biggest magic and the lightning in the bottle is when you go to Japan or Shanghai or Malaysia and you see the culture in a way that you just can’t believe. Like how did it happen that we were able to transfer this to another country, different language, different culture, different [...]. How’d we do it?\nBen: That’s actually quite befuddling to me because so many food and beverage concepts do not transfer geographies.\nHoward: I think it transferred because young people around the world all want the same thing. They want opportunity, they want to be respected, they want dignity, they want to make their parents proud, they want to work for a company that they believe in. When I see what we’ve done around the world, I’m moved emotionally because the humanity I speak of is universal.\nThat’s why when I came back from China, what I said was, I just want to say something about China and the US. I know all the rhetoric and the propaganda about our two countries, but what I see is that we have so much more in common than we have differences. And that should be the theme of the world right now.\nBen: I want to pick up the thread on China now that we’re into the 2010s. This decade saw huge ridiculous growth in China store openings. There were 500 stores in 2011 when you’re coming out of the rut. By 2017, there were 3000. Today, there’s almost 7,000. There was a stat that was reported that a new store opened in China every 15 hours in 2017.\nHoward: True.\nBen: Now, bring us to that seed that you planted earlier with Belinda being the single most important employee.\nHoward: China presented the enormity of opportunity with the significant challenge of pioneering.\nBen: It’s a tea drinking culture.\nHoward: Tea drinking culture. No morning business. People eating rice in the morning. We got real estate wrong, we got breakfast wrong, but it was all coming from the control of Seattle.\nDavid: Did you go in with essentially the Starbucks concept?\nHoward: It was exactly what you see right now. There’s no different. But the Chinese people hardly knew what coffee was, there was no morning traffic, and the early days of our partner we didn’t see eye to eye, so we got them out.\nWhen Belinda came along, we had a world-class operator who had succeeded in Singapore and Hong Kong. She’s a strong person who believed that Seattle, the way we were organized, was not a formula for success. You can’t have people in Starbucks in Seattle designing the breakfast menu, who have never been to China, who think they’re going to eat blueberry muffins.\nWhen she said to me, I will do it if I’m in control of everything, I want to decentralize China. I report to you. It’s you, me, and John Culver who runs international. Take Seattle out of the equation. We were failing. What choice did I have? She turned it. She single-handedly built the China business.\nBen: Today 18% of Starbucks’s revenue is China.\nHoward: She deserves all the credit. John and I have been to China almost every quarter during the building years of turning it with her, and all the government meetings to tell the Starbucks story. Then we did things in China disruptively.\nBelinda decided that she could go to the government, go to an insurance company, come back to Starbucks, and get government approval for Starbucks to do something had never been done before, and provide health insurance to the parents and grandparents of our partners.\nThe Chinese government was so intrigued sitting down with them saying, can you explain why do you want to do this?\nBen: You don’t have to.\nHoward: Yeah. Because it’s the culture of our company. We want to do everything we can to benefit our people. Humanity, and it’s universal. But it’s so (I think) important to just create some guardrails.\nOne day in the early stages of Starbucks, Howard Behar comes in my office one day—remember, we’re small at this stage—and he says, we got a terrible situation. He said, the manager of the Seattle Trust store on Second and Madison, Seattle, Tom Carrigan, has AIDS.\nNow, AIDS at that time was like leprosy. Tom comes in and he says, I need to resign from Starbucks. He’s crying. Do you have any health insurance? No. We covered Tom Carrigan from that point on, but it was those imprinting moments and there were many like that.\nBen: I think it’s funny. I have heard that story probably five times because I’ve consumed an incredible amount of Starbucks content over the last couple of months. I’ve heard a story about Starbucks employees wanting to buy a cow for a farmer in Africa, stories about Flint, Michigan, and stories about the initiative to bring the company together to try to bring the country together when the government was shut down in 2013, whenever that was.\nI was getting frustrated watching all these stories because I kept thinking, this is not the answer to why Starbucks worked. These are one-off anecdotes that are sure they’re emblematic of some broader theme, but at the end of the day, the answer to why Starbucks works has to be something about the business model. Every time you walk into the store, XYZ happens and here’s the economics.\nBut it turns out there are thousands of these stories, and it’s the humanity seeping through. It’s hard for the company to tell the story because everyone just feels like a random one-off example. But they’re happening in every community and every part of the country. I think for me as a business historian, that’s been the thing that jumps out is there’s no other company that we’ve studied that has this obsession with people in humanity the way that Starbucks does.\nHoward: And we’re not perfect. We do make mistakes. When the brand is being shined so brightly—\nBen: It’s a high standard to be held to.\nHoward: We live in an environment where if you do make a mistake—and we are human and we’re going to make mistakes—unfortunately that becomes the thing. And it’s tough to fight that.\nBen: I’d love to flash forward. You were CEO through 2017. Kevin Johnson took over 2017–2022. You came back for one year as interim CEO. Now, Laxman is the CEO and has been in the seat for about a year. You came in after a tumultuous COVID era, tried to basically figure out who the successor was going to be and patch the ship in the meantime.\nA lot of stuff has happened in that last five years, notably with labor unions. I don’t want to make this podcast about labor unions, but I do want to ask you what have you learned from the experience of having to do a deep dive into how we got here?\nHoward: That’s a very tough, complex question. I think my personal relationship with the company and how personal it is to me, and the things that we, not I, but we have tried to do to build a different company when the country started moving in a post-COVID era to a direction that I didn’t recognize, very, very hard to understand why Starbucks would be under assault or just being challenged this way.\nBen: Particularly when you had built a reputation on a very [...] pattern in a history of being unbelievably…\nDavid: Kind to your people.\nBen: Yes.\nHoward: I entered Starbucks as the interim CEO when this was already going on. I think the company made some early mistakes, some of which were COVID-related. Again, no textbook had to deal with COVID issues, health issues, safety issues. Then I underestimated the groundswell of public sentiment for this movement in America.\nI then became vilified for trying to defend the company in a way that I thought was appropriate. I think what’s lost in all this is the percentage of stores that have been petitioned, and the number of people is very small in relationship to the whole. Then all of the people in Starbucks who were depending on me to defend the company, trying to do that in a world of disinformation is very difficult.\nAt the time when I was trying to restore the company back to health, clearly mistakes were made. This story is still unfolding, and my heart’s with the company. The thing that I think was lost in the story is the shareholder is not the primary person. It’s the Starbucks partner in the green apron, which is the cloth of the company. If we exceed the expectations of the cloth of the company and our people, shareholders and customers are going to win. That’s been my whole life story.\nBen: And that’s basically worked for decades and decades. It also seems like Starbucks has become such an institution in our society, that leading a small disruptive organization, everyone gives you the credit for all the positives and all the exciting things you’re doing, and you get a pass on anything that didn’t work.\nDavid: Move fast or break things.\nBen: When you’re at this scale, everyone expects you to be wildly successful all the time because you always have been. But anything that’s misaligned, that is where 100% of the focus is.\nHoward: Well, I think if you take a step back, not from Starbucks, but if you say to yourself, what company has gotten big in the food business and stayed true to its core purpose and reason for being, and then stayed positively inclined to its customers, what are you going to name? The odds on getting this big and still being revered for who you once were is very, very difficult.\nI would argue in so many ways, we are better today than we were when we were smaller. That is expected of us, but I don’t think we get much credit. Maybe we shouldn’t. Maybe this is our responsibility.\nThe elements to characteristics that build the Starbucks business, the culture is compassion, empathy, and love. Those are not just words. It’s like real things that are not being taught in business schools. People on the outside view it as not true.\nI’m telling you the reason we’ve succeeded is because the underpinning of the company’s purpose has been just that. It’s much harder today to execute that because you’re dealing with cynicism as the first order of defense that you have to overcome. But the responsibility as leaders is to do just that.\nBen: All right. I’m going to take us to Starbucks today. I’ll map that out and give you the stats. Then we’re going to go into playbook where we basically try to take all the lessons we just learned over the last few hours and figure out why did Starbucks work at such a grand scale that it did.\nTo catch listeners up on the business today, Starbucks does $36 billion in revenue, $4.1 billion in net income. There are 380,000 employees.\nHoward: I think over 450,000 globally.\nBen: I must be using an old number. Over the lifetime, the company has employed over five million?\nHoward: Yes, five million alum.\nBen: At a scale right there. Thirty-nine thousand stores globally in 86 countries, almost half of which are in North America, 18% in China. About half of those are licensed franchises and half are company-operated. You mentioned we don’t franchise in the traditional McDonald’s sense. You do these joint ventures and you do this this way of entering countries where you don’t need to own and operate the entire store yourself.\nHoward: They’re not franchises in the typical sense. I think we should talk about that.\nBen: Tell us about that.\nHoward: The joint venture relationships that we’ve established—and some goes back almost 30 years—in the Middle East, in Latin and Central America, now in Italy, in the EU, in India.\nBen: And what does it mean to be your partner?\nHoward: Every country is different depending on the economics of that country, the political issues. Some countries have been an 80/20—Starbucks owns 80%, they own 20%—some are 50/50. Some of the 80/20 started out as 80% for us and they bought it in over the way. It depends.\nThe key thing is whether it’s Alberto, Toronto, Latin and Central America, Muhammad Alai in the Middle East, the Tata group in India, the Percassi family in Italy, they understand the culture and values of Starbucks.\nBen: So tactically, you said it’s not a franchise in the traditional way. What are Starbucks responsible for and what is the partner responsible for?\nHoward: Starbucks is responsible for roasting the coffee for all the recipes which are consistent with Starbucks worldwide, a co-design of the store where we’re designing the store with the JV or the licensed partner, and they control all the operations.\nBen: So all of Starbucks’s franchise or license stores are done in this way where there’s a partner in a country.\nHoward: Yes, there are no individual licensed franchises of any kind, unless it’s certain real estate that we can’t get that we want access to, like a roadway on a highway in Switzerland or something odd.\nBen: I see. Airports are this way, right?\nHoward: Airports are master license with the master licensee, whoever has it like Marriott or whoever has it.\nBen: I got it.\nHoward: Or Target that has 2000 Starbucks stores.\nBen: And those are Target-operated.\nHoward: Yes.\nBen: I see.\nHoward: And great partner, and Brian Cornell, great guy.\nBen: It’s interesting. Basically, half of Starbucks stores look like the platonic ideal of coming out of the Starbucks HQ. Here is how we imagine this store to be. Half of them are, there’s some reason why we alone can’t do this and need a partner.\nHoward: Ideally, you want the customer experience to be the same worldwide, regardless of the shape and size of the store where it’s located.\nBen: Makes sense.\nHoward: Which is not always the case. I admit that.\nBen: One market that we haven’t talked about that I want to ask you about while we’re in this, and then we’ll get to playbook, is Italy. The whole thing came out of Milan, and yet for decades…\nHoward: Fifty years.\nBen: Fifty years no Starbucks in Italy. The belief, at least as I see it, is they’ve perfected the coffee house concept. Don’t bring an imitation here. But it’s worked. It’s working phenomenally well. Why is Starbucks being so well-received in Italy?\nHoward: I know I’m going to be chastised for what I’m about to say, but it’s true. By and large, coffee in Italy is not as good as it once was. There are certain coffee companies that have maintained the standard, but by and large, the coffee is not as good. I’m going to be killed for that, but that’s my truth.\nDavid: If you don’t believe you have a better product, who does?\nHoward: Yeah. But I didn’t think we earned the right to go to Italy until we were really ready to present ourselves in the best possible way because I knew the knives would be out for us in ways that we couldn’t even possibly imagine, given the history and the cultural relevance of espresso in the coffee bar. We waited and waited and waited until the roastery. Before we get to Italy, I have to explain the roastery for you.\nBen: Please. The first time I went in there, candy store wide eyes.\nHoward: There are six roasteries starting in Seattle, Chicago, New York, Tokyo, Shanghai, and Milan. The roastery itself is probably the most entrepreneurial, creative project that I could recall in my history of Starbucks. What is the experience we could create that just absolutely blows people away? What did I do?\nAs a kid, I’ve loved this movie. I invited the most creative people in the company to my house. I said, we’re going to watch a movie. Of course, they thought I was nuts. I turned on Willy Wonka.\nDavid: I was going to say it’s got to to be\nHoward: I turn on Willie Wonka with Gene Wilder. We went to work starting to design a space. Now we realized early on…\nBen: And this was what? 2013–2014?\nHoward: Eight years ago. Now, we realized economically this is a tough business model. What are we trying to do? We’re trying to create an experience that is accretive to the brand and significantly elevate Starbucks, which is fighting ubiquity all the time, every day. We created this 30,000 square foot space in Seattle, which we opened seven years ago, which is the most dynamic, entertaining vehicle of theater, romance, seduction, and we open it to rave reviews. Like Willie Wonka did, we’re manufacturing and roasting coffee in the space.\nBen: Which makes the smell of the… which is amazing.\nHoward: We open it up, and then over time we start opening a couple more. We get approval from the Chinese government to manufacture in the center of Shanghai. We open up a 40,000 square foot in Shanghai. We open up an incredible space in Tokyo. We open up in the old Creighton Barrel space in North Michigan Avenue in Chicago. We open up in the meatpacking business in New York. But the shrine has to be Milan.\nDavid: This is the way to go back.\nHoward: This is the way we open on Italy. Now, our partner in Italy is the Percassi family, fantastic people who are in the real estate business. They are showing me, I’m going back and forth to Milan all the time because they’ve got real estate. I got to see it, I got to touch it, I got to smell it. I keep going back and back and back. No, not the right site. Not the right site.\nI’m standing on the corner of Cordusio Square, I look at this space and I say, what about that? He says, that’s the post office. You can’t get the post office. I said, well, it’s empty. It’s empty. You can’t get it. I said, can I meet the landlord? Howard, it’s the government. I said, well, who’s responsible for it?\nThey arrange a meeting for me, and I meet the broker who’s involved in this, but it’s empty space. I find out the story is that these government buildings during the financial crisis were sold to private equity. So I said, who’s the landlord? I can’t tell you. I said, you have to tell me the landlord.\nBen: Private equity that’s letting real estate sit empty?\nHoward: It’s empty.\nDavid: I know where this is going.\nHoward: I know I’m going to get killed for this story. You’re going to have to fix this. Turns out the owner of the space is Blackstone.\nDavid: I knew it. Of course.\nHoward: I said, why am I in Italy? I called Jon Gray up, friend of mine. I said, Jon, I’m in Milan. Do you realize you own this space in Cordusio Square, it used to be a post office? He said, I don’t know. Let me check. I said, Jon, I’m coming to see you tomorrow.\nDavid: You’re on the next flight.\nHoward: We do the deal with John Gray.\nDavid: Amazing.\nBen: Unbelievable.\nDavid: John Gray, of course, being the number two person at Blackstone.\nHoward: And John’s a big fan of Starbucks. He had previously been in Seattle for a wedding or bar mitzvah or something, and saw the roastery, so he knew exactly what I was talking about. That is how we entered in Milan. Now, we have 30 traditional stores in Italy.\nDavid: Did they already exist before the roastery?\nHoward: No, Milan opened first.\nDavid: First the roastery.\nHoward: Then 30 stores. We’re in Milan, we’re in Rome, we’re in Florence. Two, three years later, what do you think the number one beverage is? It’s espresso for Starbucks. Straight espresso. Espresso is the number one beverage.\nDavid: Wow.\nHoward: I don’t take the success in Italy for granted, we’ve got to continue to earn it, but what I’m most proud of is that we’ve respected the Italian people and coffee culture for 50 years. And they embraced us.\nBen: So the implication of espresso being the number one beverage is it’s not tourists. It’s the Italians coming to Starbucks.\nHoward: Yes. There’s a lot of tourists coming into the roastery, but yes.\nDavid: And that they’re choosing to get their espresso at Starbucks, not at…\nHoward: Yeah. I’m going to Italy I think next week. For me, the gratification, the satisfaction of complete full circle from 1983 is just beyond belief for me.\nDavid: I’m wondering another backdrop to the roastery, and really throughout all the 2010s must have been Third Wave Coffee. I’m sure it was on your radar screen. At the same time, it doesn’t seem like it’s ever made a dent in Starbucks.\nHoward: There has always been stories that all these competitors were going to steal business from Starbucks. But from 1983 to all the way today, the consumption of specialty coffee is still a small amount relative to the macro opportunity. So all those people have expanded the market with and for Starbucks. Now we created an industry that didn’t exist, and they have followed us and done really good things, but we’re not threatened by that.\nDavid: Interesting. So you think Third Wave Coffee brought consumers into the coffee culture market that have then also become Starbucks consumers, and maybe they wouldn’t have been coffee culture consumers at all.\nHoward: Yes.\nBen: How do you define Third Wave Coffee? Actually, Howard’s probably the best person to ask.\nHoward: It’s a very intentional independent coffee store that is small enough that they’re roasting their own coffee or getting coffee from a small proprietary roaster, and creating a very unique handcrafted experience that in many ways Starbucks can’t do in scale. I tip my hat to them, but there’s no coffee experience in the world that comes close to the roastery, any of them.\nBen: Do those roasteries break even or are they marketing showpieces?\nHoward: Some are making money and some aren’t, but I’ve never viewed it that way. You couldn’t put a price on the hundreds of thousands of people that come into this roastery and have an experience of a lifetime. I took Mr. Arnault to the roastery.\nBen: In Milan?\nHoward: In Seattle. He and his son. I spent a good amount of time with him. I’ve taken a lot of retail CEOs and iconic business people through the roastery who want to see it.\nBen: What was Bernard doing in Seattle?\nHoward: I don’t know what he was doing in Seattle, but I spent a fair amount of time with him and his son. His son now runs Tiffany.\nBen: Oh, great.\nDavid: Wow.\nHoward: His level of curiosity was very high. I remember he kept looking at the leather railing and the stitching. I just said, you’re spending a lot of time on the leather\nBen: I bet he was.\nDavid: Maybe there’s a partnership to be done.\nBen: Okay. So now the question becomes, what are the set of circumstances that had to be true in order for Starbucks today to exist? The one thing we haven’t talked about, or one of the things is how much of what Starbucks has accomplished could have happened if it wasn’t an addictive substance?\nIt’s this incredible thing that it’s a legal drug that all the research anyone’s ever done into caffeine is by and large it’s neutral to helpful. Every other drug that at some point people have enjoyed, whether it’s smoking or drinking, as research comes out over time, we find out, shoot, that wasn’t good for us.\nThat’s not the case for coffee. What an amazing thing to get to build a business on this delightful thing we have to consume every day because we’re addicted and it’s pretty good for us.\nDavid: And it gives you superpowers.\nHoward: I’d like to believe it’s not based on what you are characterizing as an addictive beverage. I’d like to believe it’s the experience that has been created around the enjoyment of the coffee and the experience that happens.\nI also think, and we haven’t really spoke that much about it, is I can’t state enough over the last two decades what customization meant to the company, and how customers created a personal beverage well beyond what the menu was. I don’t know any other business in which the incrementality of the price has been dictated by the consumer. The base price is X, but most people are doing something in—\nDavid: X plus Y.\nBen: I have a very specific drink that I like. When I go to coffee shops that are not Starbucks, I can’t get it because it feels taboo to order. I like an iced almond milk latte with whipped cream. When I go to most coffee houses, I can’t ask for whipped cream on top of that, but Starbucks, they’re like, of course. That’s what we do here.\nDavid: This is something that I think has translated incredibly well to the mobile app, that no other food company has really the level of customization.\nHoward: And I think the mobile app actually added velocity to customization. It powered customization. I think the Starbucks barista deserves so much credit because they are dealing with so many different variations of beverages, some of which they’re making for the first time on the fly. Hard to do. It’s hard work.\nBen: It has to be a good number because there are—I haven’t done the math—billions, trillions of combinations of possible drinks. Every single day, as a barista, you were making something for the first time.\nHoward: The number that people use inside the company is 100,000 different variations of beverages that are being made consistently. A hundred thousand different beverages.\nDavid: This is actually a really interesting way to lead into playbook, because on the surface, it’s an obvious question. Yes, it’s an addictive substance. Caffeine, of course. On the other hand, you’re in a highly competitive market.\nBen: Selling a commodity.\nDavid: And the market actually is not just coffee. It’s—let’s stick with this theme—caffeine broadly, of which, there’s Coca-Cola, there’s you know.\nHoward: Well, not only that, but every food company, every retail food business from McDonald’s on, took a page out of Starbucks, went to school on us. Put espresso machines in their stores and started doing coffee beverages. That also expanded the market.\nDavid: And I think the real question is for us here, nobody has built Starbucks despite decades in a highly competitive market,whether it’s Third Wave, or competitors in other geographies, or domestic competitors, or McDonald’s getting into the business, or Forgers and Maxwell House. There is a unique tapestry that we’ve been weaving throughout this episode that in Hamilton Helmer’s terms has power here.\nBen: Yes. Here’s my second one in addition to it’s addictive but delightful. It is perceived to be virtuous to be a barista, where it is not perceived to be virtuous to flip burgers. I don’t know if that’s something Starbucks created, I don’t know if that’s something inherent to the product, I don’t know if that’s because it has this Italian lineage, but there’s all these incredible benefits that Starbucks and any other coffee house chains get to enjoy because it’s respected to do that work. I’m curious, why do you think that’s respected when similar ways of spending your hours in restaurant work isn’t?\nHoward: First of all, I’ve never heard it quite like that, and I think that’s a very interesting insight. There is craft and art to the expression of making the beverage.\nI also think the intimacy of the relationship with the customer is so different. Baristas know the names of their customers. They know their dog’s name. We have a drive through. I saw a video where the barista knows the name of the dog. The whole thing is just a magical dance that happens when the cars pull in and all of a sudden it’s not a transaction.\nOne of the beauties that we have been able to do is elevate the experience of the drive-through not all the time. I think your question is steeped in one is a commoditized environment, and the other clearly is not. The challenge for Starbucks is continuing to innovate for the barista.\nBen: In this category, to extend that point you start from a place of this a good job, and you can improve the experience for that employee so they can improve the experience for your customers. Whereas in other things that are commoditized, they start from a position of, I have to do this job. it’s a really tough uphill battle to invest in your people, whereas Starbucks has a tailwind.\nHoward: But it is a hard job.\nBen: Certainly.\nHoward: And we have to honor the people who are doing it more so today than ever before.\nBen: Another one that I have is funny. It flies in the face of some of the pitfalls of ubiquity that we were discussing before. The fact that it is everywhere almost cheapens the experience.\nTo me, Starbucks’ ubiquity is a massive feature. The fact that I can go anywhere in the world and get basically my same order, or certainly anywhere in America, I can get my same order, I can even do it from the mobile app in a way that I’m very familiar with ordering. It’s reliable, it’s predictable.\nIt’s the same reason I bank with Chase and I buy Apple products. It’s this thing that I just know works everywhere, and I never have to take any risk on. Starbucks didn’t have that when it was starting, but it really feels like it’s reached this scale that no one else can really compete with the level of ubiquity.\nHoward: Earlier on in our conversation, I said ubiquity is an enemy of Starbucks. It’s an enemy because we can’t be defined by our ubiquity. We have to be defined by the one store you come into, not based on the thousands, but that experience you have in the store. If the ubiquity is driving trust and driving convenience, we have to ensure the fact that we are providing that intimacy in the store and not allowing ubiquity to commoditize the experience. That is the framework of the daily challenge of the company.\nBen: Frustratingly for those of us who are trying to analytically put this puzzle together, the humanity is actually the answer. Scaling humanity is actually the answer, along with this obsessive quality of product, the fact that product isn’t just product, but experience is the product. It’s everything you experience around consuming the beverage itself.\nIt’s a bunch of the things we’ve already talked about. You invest in your employees, they take care of the customers, who takes care of the shareholders, but the shareholders are last. We talked about the store cash flow dynamics that you can scale in a really cash-efficient way when you’re paying the stores back in less than two years every time.\nEvery store is a billboard, so you’re intentionally picking real estate in these places where you’re building familiarity with people. They’re walking by over and over and over. You’re extending the brand by doing United Airlines, by going to grocery stores.\nDavid: Everything is a billboard.\nBen: Everything is a billboard, yeah. Why pay for customer acquisition when you can get product in people’s hands.\nThe third place, very novel idea at first, turned out that was something basically the entire country and then the world wanted to participate in. Not obvious at first. It’s so easy to think about these things that now we take completely for granted. Starbucks is infrastructure in our society. It is assumed. When I go to an airport or a city and there’s not an easy way to get to a Starbucks, I’m like, what?\nDavid: What is this place?\nBen: What backwoods place am I in? Like it’s expected. When you live with something most of your life, you forget that it was once a crazy idea.\nDavid: I think the other piece that you didn’t just list off there that we’ve covered in depth is the Costco investment in your employees, the people, and the reduction of turnover. In Costco’s case, I think it’s probably much more so the reduction of turnover. In Starbucks’ case, it really is like that’s the key element to building the humanity. I don’t know the employees at my Costco store.\nBen: What’s the stat that you have on, I’ve heard you say it a number of times on employee tenure at Starbucks versus others in the category?\nHoward: It’s a 2X is what I believe.\nBen: That employee tenure is 2X longer or turnover is half of what it is. industrywide. It makes a huge difference.\nHoward: You’ve talked about Beans Stock, you’ve talked about comprehensive health insurance. When I think about the most important thing we probably have done in the last 20 years, it’s been the unique relationship that we established with Arizona State University and its President Michael Crow.\nCould we create free college tuition, a four year free college tuition through our other own estate for every single partner at Starbucks? And we did it. Thousands of Starbucks partners are engaged and going to school, and thousands have graduated. The college achievement plan demonstrates going back to the early years of the speeches I was giving about what is the responsibility for a for-profit company in the world we’re living in? And it’s not just to make money.\nBen: Here’s one that we haven’t talked as much about. You were part of this secular trend of gourmet coffee. I’m curious if you view that to be a true statement or if you’re saying, no, we created this entire wave. It wasn’t going to happen.\nHoward: I don’t want to sound arrogant at all, but I think it’s so clear that Starbucks created an industry that did not exist. As a result, tens of thousands of stores have followed in our wake, and we created an employment industry that did not exist. Not to mention that 5 million is 5 million alum.\nBen: That’s a lot of people who have gone on to do other things after.\nHoward: I think one thing that’s always been missed is that Starbucks has always been a great first job.\nBen: In your mind then, let’s say there’s a parallel universe where Howard Schultz doesn’t exist. The year is 1995. Is there a nationwide chain, not called Starbucks, with gourmet coffee taking off in the United States because the conditions were perfect for it?\nHoward: I would assume that there would’ve been a national franchised business that would’ve occupied the coffee space. But would’ve been more commoditized.\nDavid: A Dunkin Donuts for instance.\nHoward: I don’t think anything would’ve been executed like Starbucks. But I think someone would have showed up. The opportunity was just too much white space.\nBen: There was clearly demand there. We were coming off this horrible Folgers and Maxwell House era, and there was this growing demand. But that doesn’t mean that a company like Starbucks would’ve been created. It means just in some way that consumer demand would’ve been satisfied.\nHoward: Well, just remember, our intent was not to build a global business. The first business plan—I’ve said this many times—when I was raising money was 100 stores. I wasn’t raising the money. I couldn’t afford to reprint the whole document, whatever that was at the time. I whited it out. No one’s even know what that means. I whited out 175.\nDavid: When was the last time you used a whiteout?\nBen: It’s been a while. Wait, really? So you—\nHoward: Yeah, whited it out, 75, because I couldn’t—\nBen: Did it feel too ambitious?\nHoward: Yeah, people didn’t believe.\nDavid: Think you were crazy.\nHoward: Japan was the turning point of thinking we could build an international business, but we didn’t. None of us had any international experience. No one in the whole entire company. In many ways you could say this shouldn’t have happened.\nBen: This brings us to the absolute magic of founder-led businesses. When you have a founder at the helm, you get all this leeway from shareholders, from employees, you can take crazy risks, and people know it’s because you’re you, but for you it wouldn’t exist at all, so run with it. What are the biggest innovations that have happened at Starbucks not under Howard Schultz?\nHoward: What a question. I’m pausing not because there hasn’t been any because I’m sure there has been, but I’m hard pressed to think about what it was.\nBen: I don’t think you were running the show when the pumpkin spice latte came out.\nHoward: Yes, I was.\nBen: You were. I thought I had one.\nHoward: I didn’t like it.\nBen: Oh.\nHoward: Yeah.\nBen: It does feel like you were obsessed with the purity of the Italian coffee bar for a long time. Then at some point you were like, actually what I’m obsessed with is serving customers in whatever they want from us.\nHoward: Well, the Il Giornale store only played Italian opera and had no chairs.\nDavid: I wouldn’t have scaled as well.\nBen: I’m recalling my time from Rome two years ago. That’s literally, I’m walking around Rome and that’s everywhere. It’s completely different than…\nHoward: No, I think I had a see the light. I had to understand we were not in business to please me, but please the customers.\nBen: What is it, 70% of drinks are now iced beverages, and it was when you started 0%.\nHoward: Didn’t have a cold beverage.\nBen: For the first decade it was zero. To me, there’s this thread of at some point shaking off your own opinions and saying, we’re going to do what the customer wants us to do.\nHoward: To a degree.\nBen: But I was clearly leading. There was a leading question around innovations not under…\nHoward: So what’s the point? It’s not that there hasn’t been innovation. I think there’s a burden that the organization has and a reliance on the founder that over time can become unhealthy. Not that I didn’t want succession. It wasn’t really on my mind.\nThe marketing and the merchant mentality of Starbucks was always with me and probably did not allow others who were well-intended and could have done good things were following and leaning on me, which is not the healthiest thing over the longevity of the company. I think that has covered up mistakes that covered up things, then it was revealed when I left.\nBen: It’s the very things that make the business successful the founder bets, that then at some point in the company’s second act, hold it back. You have all this muscle memory as a company of relying on founder maverick acts, and at some point you need to figure out how as a company to not.\nHoward: Well, the other thing about that is most founder-led companies are entrepreneurially driven. It’s not that they’re not following the rules. They’re making the rules, especially if you’re creating an industry that did not exist.\nFounder leaves, I’m not talking about me historically, and companies lose not only the extent of the entrepreneurial DNA, but they lose the ability to be on offense. The worst thing that a company can do like a sports team, is start playing defense because you’re afraid to fail. That is a disease, not unlike another disease which has happened to Starbucks, which is hubris.\nThe worst thing that could happen to a company is believing that you are incapable of doing anything but succeeding, and you deserve the success. But if you start playing defense and don’t have the offensive mind, it’s not going to go well. I think over time that has happened at Starbucks.\nBen: You’ve transitioned from being the CEO to someone else three different times. If you could go back, let’s even just say the first time, if you could go back years 1999 or 1997 so you can start working on some talent development, what would you do differently to make sure that succession?\nHoward: I would’ve believed Oren when he said, I only want to do this for a couple of years. I convinced myself I could just get Oren to do this for 5 years, maybe 10 years. When he kept saying I don’t want to do this anymore, I was stuck because I was not prepared to look around the room and say, God, I think he could do it. If I would’ve spent maybe a year or two, but I didn’t. I believe that I could convince Oren to stay longer.\nAlso Jim Donald’s a great guy, but I think the immersion of an outsider at that time, given we were moving into a crisis, not a Starbucks crisis, but the financial crisis, very difficult. It’s on me (I think) when I look back and I just did not do a very good job of recognizing the internal talent and cultivating it.\nI want to say one more thing about Starbucks, and it’s the complexity of it. We’re in multiple businesses. We’re in the agricultural business. We are buying coffee from 30 producing countries around the world. We are subject to weather and the agricultural issues, many of which are not in our control. Political, all kinds of stuff.\nSecond, we are manufacturing a commodity that is very, very challenging because it’s coming from 30 producing countries. Each coffee from every country has its own proprietary taste profile that has to be roasted differently. When you’re blending it like a winery, it’s art.\nWe’re an agricultural buyer. We are a manufacturer. We are a retailer. We are a wholesaler. We are managing JV relationships in 80 countries. We have JVs with two behemoth companies—Nestle and Pepsi Cola. Above all else, we are in the people business managing the behavior, the motivation, and the opportunity creation for almost 500,000 people. And we’re a public company in which the expectations based on our success have been higher than most.\nDavid: Not to mention you’re a quasi-financial institution too.\nHoward: Yeah, all of that, and lastly, I think the personal responsibility of a founder in my case, who loves this company as much as I love my family. It’s a challenging, fragile thing on a very personal level. You can’t escape it. You’ve made your point. You want to go somewhere, you can’t escape it, so it’s always around you.\nDavid: I’m so glad you’re bringing this up. It really resonates to us hearing you say that. It’s the way we feel about Acquired in our show, and to imagine that’s easy for us. We have no stakeholders. We never would expect that this would scale to 500,000 people. If it did, I can’t even imagine the complexity of that.\nHoward: Now that you’ve achieved this level of success, you have an expectation that you’ve got to keep not reinventing but you’ve got to make sure that you’re as good as you’ve been.\nBen: Better.\nHoward: You got to be better. Again, your success is not an entitlement, kike Starbucks just isn’t. When you have success, it gets harder because the bar keeps getting higher.\nBen: Yeah. That’s just human expectations. I’m going into this thinking I had some funny thing occur to me, which was at some point, why does Starbucks need to grow anymore? It’s already everywhere. Of course, it’s a public company, so it literally just has to keep growing. But it’s just human expectation that things keep getting better than they were last year. They should. People should just figure it out and make it better. We all think that about every product and experience that we have.\nDavid: Indeed.\nBen: Well, listeners, we were thinking about how to land this episode. In our normal episodes, we land the plane in some way or come up with the one thing you really can’t leave the episode without thinking about. I feel like we covered a lot of those in playbook. Rather than drilling into that again, we were talking with Howard and he threw out this idea. I really do have one more thing to say.\nDavid: Given this moment that Starbucks is in right now here in summer of 2024, this felt like the right way to address that.\nBen: Back to the interview. Well, Howard, we’re at the end here, and I think listeners may be wondering, okay, but what about Starbucks today? The last few years have seen you come back as interim CEO for a year, transition to a new CEO; it’s been about a year after that.\nIt’s been a rough couple of years. Part of it’s coming out of the pandemic, but I think anybody who tuned into the last earnings call is wondering what’s up with the future of this company. Can you give us a little bit of narration on what brought you back the things you did and where the company is today?\nHoward: Let me try and go back to when I returned as an interim CEO in April of 2022. I was asked by the board to come back to the company and I said, no. My life has changed. I have no desire to come back. I have no intent to come back. But it was clear to me as the weeks were going on that the company was heading into an existential crisis.\nIf your listeners take anything away from what we’ve talked about is my love of the company is so significant that I changed my life and I came back to the company. I want to be fair. I don’t want to criticize anyone. But when I came back, I saw things that really surprised me about the lack of investment over a 4–5 year period. Also I didn’t like the way the stock buybacks were being used to basically increase CPS. It’s no way to run a company.\nThe first day I came back, and I knew what the market would do, is I announced that we were suspending the stock buybacks and stock went down. I expected it. I announced that we were going to take basically the money we were using to stock buybacks for the year—I think it was north of $2 billion—and invest back into the people of Starbucks, the partners, which I did.\nThe most important thing I did, though, because I’m not a messiah, but I have an instinct about the company, and I know the inner workings of the company better than anyone else. I know the people. In a year’s time, despite the underinvestment and the challenges, we brought the company back to a much healthier place operationally. Certainly, the stock price was significantly higher when I left. When I started, it was in the 70s when I left, it was…\nBen: But that’s an output. That’s investors voting on the performance.\nHoward: Yeah. We don’t have to talk about the stock price if you don’t want to. Nevertheless, again, succession. The board led a succession process. You have to remember, I wasn’t on the board for 4–5 years. I resigned when I decided to leave the company after a year, despite the board asking me to stay another year. I just said, I’ve done my duty. We have to find a new CEO.\nBen: They wanted you to be interim CEO for a second year.\nHoward: It was up to me. The board led a search. There were a number of candidates. Laxman was chosen. I met him, I approved his hiring, but the search committee was driving the process.\nNow we’re a year later. This is fast forward. It hasn’t been a great year for Starbucks. In fairness to Laxman, there’s a lot of external issues that have contributed to the pressure, like on every company. But the company has not executed the way that I think it should have.\nI go into the stores. I know the company. And I think we’re not at our best right now. Why’d I write the letter? I didn’t write the letter because he had a bad interview on Kramer.\nBen: This is on LinkedIn?\nHoward: Yeah. I wrote the letter because I had written a couple of other letters. Probably the iconic letter I wrote was entitled The Soul of the Brand. I was writing that letter because I don’t get financial information, so I don’t have any understanding whether the company’s making the quarter or not. I was as surprised as anyone else to see the dramatic drop in revenue and in profit.\nBut I wrote the soul of the brand because I could smell instinctively that there were things going on that just did not feel right to me. That the shine was off the brand. That partners were maybe not as inspired as they had been. The first thing I want to say is I’ve made it clear to the Starbucks board, Howard Schultz, and I’ve made it clear to Laxman, Howard Schultz has no desire or intent to return as CEO of Starbucks. If you want, I’ll say it again, but I don’t.\nBut I can’t ignore what we’ve just discussed for the last few hours. If the company is doing a drift towards mediocrity, and I hold leadership, and the board responsible for that. My letter was not accusatory. My letter was not predatory. My letter was steeped in counsel and advice based on 40+ years of experience in building this company.\nThat’s the advice and counsel I’m giving you. If you want to take the advice, it’s up to you. If you don’t, you’re responsible for the outcome. I have no operational role. I’m not on the board. I’m watching from afar and rooting and cheering for Starbucks. I wrote the letter in hope that it would be a catalyst for a positive interpretation.\nBen: What were your recommendations in the letter?\nHoward: The one thing is we’re not a beverage company serving coffee. We are a coffee company serving people. We need to be much more coffee-forward. And we cannot continue to allow the mobile app to be a runaway train that is going to consistently dilute the integrity of the experience of Starbucks.\nWe’re not in the transaction business. We have to execute transactions, but that has to go through the lens of being an experience business, an experience place. People are longing for human connection. Even if they’re on a mobile app, let’s provide it. But I also recognize this is a complex time. It’s difficult. But that’s your job.\nBen: Makes sense. Well, to finish the episode, I can definitely say as an unabashed fan, the same way I opened the episode, rooting for everyone over a few miles away to pull it off.\nHoward: Thank you very much. I think Starbucks is so resilient. Starbucks has had many, many challenges. I have great faith in the company the equity of the brand, and the people who wear the cloth of the company, the green apron.\nBen: Thanks Howard.\nDavid: Thanks Howard.\nHoward: Thank you. Great. Really enjoyed it.\nBen: All right, well listeners, thank you for being on the journey with us. That was super fun to do with Howard. Remember, the huge announcement from the top of the show, San Francisco in September.\nClick the link in the show notes to stay fully in the loop on what that is. When we are able to share more details, our good friends at J.P. Morgan Payments are cooking up something very cool with us. So stay tuned for more, acquired.fm/sf or click the link in the show notes to stay in the loop. Of course, we’ll be sharing this on Twitter and probably talking about it on the podcast again, but find out more acquired.fm/sf.\nIf you want to talk about this episode, come to the Slack, acquired.fm/slack. If you want to keep going with Acquired, you’re out of episodes, you’ve decided that I’ve listened to the entire back catalog and I really wish they had a second show, good news, we have one, so check out ACQ2. Lots more interviews there. I know the backlog and it’s only getting better from here.\nYou can imagine that having a great piece in the Wall Street Journal and hitting number one on Apple and Spotify, which we will reflect on at some point. A totally surreal few weeks here. Certainly prime the pump for a whole bunch of great interviews that we’ve got coming on ACQ2.\nDavid: We’ll see you next time."
}