{
  "url": "https://www.acquired.fm/episodes/the-space-industry-in-2024-and-how-to-build-a-satellite-company",
  "title": "The Space Industry in 2024, and How to Build a Satellite Company",
  "heading": "ACQ2 Episode",
  "date": "May 24, 2024",
  "description": "The space industry is one of the most fascinating areas of technology in 2024. The reduction in launch costs and proliferation of satellites make all kinds of new businesses possible. Today we are joined by Austin Link, the co-founder and CEO of Starfish Space (where Ben and PSL Ventures are investors!). Austin lays out the state of the space industry today, particularly as it pertains to startups. He and Ben explore what it takes to build a space company, then gets into the specifics of what Starfish Space is building.\nStarfish Space has created a spacecraft to dock with and reposition satellites. This \"space servicing\" technology enables their customers to extend the usable lifetime of satellites (unlocking tens of millions of dollars in revenue), or safely dispose of aging satellites to avoid space debris. Starfish's product, the \"Otter\", uses autonomous navigation software and electric propulsion to move through space and dock with customers' satellites.\nIf you're into physics, outer space, or any sort of \"hard tech\", tune in!\nLinks:",
  "transcript": "Ben: Hello, ACQ2 listeners. You’re one and only co-host Ben Gilbert here today. My co-host is on podcaster paternity leave, which gives me the opportunity to try this solo, and I think it’s going to be a lot of fun.\nI was trying to think what ACQ2 episode would I want to do where I could really nerd out without David keeping me in line. The answer is the space ecosystem. I’m already seeing Austin, who’s with us here today, chuckling on the other end.\nThis is an area that we’ve covered on Acquired. It’s been a while. We did the SpaceX episode, and then we interviewed Rob Myerson for the history of Blue Origin a few years back. But we really haven’t gotten an update on the space industry. It’s an area where I personally spend a huge amount of my outside-of-Acquired time, especially with the company that Austin is the co-founder of, Starfish Space.\nWe are joined today by Austin Link, who has generously volunteered to give us a primer on the state of the space ecosystem today. That is where we are. Austin Link, welcome to ACQ2.\nAustin: I’m excited to be here. When you need to nerd out on something, call the space folks. We’re ready.\nBen: People ask me what I like about Starfish, and my first answer is usually that board meetings are about 40% physics lessons and then we have to do a bunch of approvals. At least I get to take a college physics class again.\nAustin: The physics is where all the fun comes from. I find the same thing. I wish I could do a little more of the physics now, but as you grow, that’s how it goes.\nBen: We’ll get into Starfish later and all the cool stuff you guys are doing. If I asked you the very hard-to-answer generic broad question of what economically happens in outer space today, how does that whole world break down?\nAustin: There are a lot of different values and reasons to go to space today. Some of them are purely economic, like you count the dollars and cents and it is a value providing service, some in a commercial sense, some in support of government folks, and then there are a few reasons to go to space that can be a little harder to quantify.\nStarting at just the most basic end, there are services that are provided from space that make money as companies today. Many of those we’re familiar with satellite TV, satellite radio, satellite internet—in particular with the rise of Starlink over the last couple of years—is incredibly exciting as an emerging market.\nThere’s a lot of observation that’s done from space. Sometimes it’s done as commercial companies, sometimes it’s done through the government. Oftentimes it’s pointed down at Earth, sometimes it’s pointed out, and you can get into a number of government projects that are in fulfillment of scientific goals. Things like the James Webb Telescope that went up recently that are incredible value that you can get from space and uniquely from space.\nSome of the scientific missions are a little harder to track. Here are the dollars that you make. I would maybe broadly as we think is the value we can get into or that you can get from space, there is both commercial value and that’s something that folks are increasingly exploring today with the commercial space industry.\nThen there is value in support of government groups, whether that’s NASA, whether that’s Space Force, which is still relatively new as an organization still. And some of those can be supported by folks in a commercial new space world as we call it in the industry. Some of that is through a traditional space approach that is something that humans have been doing for 70 years now.\nBen: One question I want to start off with is give me the baseball card on the space industry right now. What numbers get thrown around in terms of market size? How many satellites are out there today? What’s in GEO versus LEO versus what is MEO? We’re going to do a lot of acronyms today. What are all these things?\nAustin: There are a series of projections that say space is a trillion-dollar marketplace at some point in the 2030s. What does it translate into and what’s going on today? There are two realms where satellites are most commonly used by humans. There’s geostationary orbit, which is an orbit that is unique because the orbit rotates at the same rate that Earth rotates below it. In effect, a satellite is hovering over a given point in the sky.\nBen: And those are really far away, right? GEO is, if you were to look at it relative to…\nAustin: The distance to a geostationary satellite is about six times Earth’s radius, so dramatically farther out than the radius of Earth. You contrast that with a low Earth orbit satellite. The distance to a low Earth orbit satellite is a lot of times 500-, 600-, 700 kilometers above Earth’s surface, which is really just about 10% of Earth’s radius away. Those are two distinctly different realms that have distinctly different values, but they can be of different uses for communication satellites, for observation satellites.\nThere are also uses for space that are very popular outside of those orbits. In between those two in mid-Earth orbit you have a lot of position navigation and timing constellations like GPS, like Galileo over in Europe. Those are used throughout a series of industries and are really a staple and a backbone of modern life in the US.\nThen there are a series of missions that go beyond geostationary orbit from the farthest reaches of the solar system. If you look at the old Voyager missions, to the James Webb telescope which is at a LaGrange point, looking at the universe around us, to the Artemis mission which is aiming to put humans on the moon again for the first time in over 50 years.\nBen: What are some other things that people are trying to do in space over the next 20–30 years but are not a part of the space economy today?\nAustin: There are a lot of exciting things that people are aspiring to do in space. I’ll tell you a few of the ones that get me most excited.\nThere is recently talk about space-based power generation. You can generate power in space and then send it to Earth for usage on Earth. That can be more mobile than a power station based on Earth because you can send the power to different areas. You can generate solar power 24 hours a day rather than 10 hours a day. I think that’s really exciting.\nThere’s a lot of on-orbit manufacturing that’s being discussed. There are folks exploring, can you make drugs in zero gravity? Can you make optical fibers and zero gravity? Can we make those and then bring them back to Earth, whether that’s through a space station or through its own dedicated satellite?\nThen there’s a lot of exploration that people are looking to do in space. There are people doing exploration activities in space. Right now there are rovers on the surface of Mars. There are humans in the International Space Station.\nThere’s a lot of talk about, especially as we look into the 2030s, can humans explore even more? Can we make it back to the surface of the moon? Can we do things on the moon? Can we establish a permanent presence there, and someday can we do more as we head out into other areas of the solar system?\nAs we do all of this, I think fundamentally underpinning that is a change in how we develop infrastructure into space. I think part of that is something that folks are very used to today, which is a change in how we launch satellites, and launching satellites in a more regular and more affordable manner to allow us to get more into space.\nI think a part of that is the type of activities that we do at Starfish Space, which is taking the material and the objects that we have in space and figuring out how we do more with that. That can start with extending the life of satellites to get a little bit more from them or managing space debris so that you don’t have hazardous risks and collisions that could tear up your infrastructure from the inside out.\nEventually, it extends to a world where we are trying to send things into space to take advantage of it, and it’s really expensive to leave the gravity well. Let’s do more with the things that we put up there. Let’s recycle the materials, let’s reuse the materials, let’s take advantage of materials that are already in space.\nGetting things into space more affordably and faster and doing more with the things that we have in space is a key infrastructure to allow us over the next 20–30 years to build significant new capabilities for humans as we go out into the universe.\nBen: Continuing with the primer baseball card questions, how many satellites are in low Earth orbit versus in geosynchronous today?\nAustin: Geosynchronous orbit is an orbit for exquisite satellites. There are on the order of 500–600 satellites in geostationary orbit. A lot of times these are satellites that cost hundreds of millions of dollars to build and launch, and are providing a lot of value for the folks that they serve.\nBen: Hundreds of millions for one satellite.\nAustin: For a single satellite, yeah.\nBen: Wow.\nAustin: A lot of times government level ones can reach into the billions of dollars. In low Earth orbit, there has recently been a rise of large constellations of satellites. You provide services with a network of a hundred or a thousand satellites. You can see folks like SpaceX, Starlink, or OneWeb who’ve really pioneered this.\nIn low Earth orbit, there are now thousands of satellites. I think it’s on the order of 6000 or 7000 satellites in low Earth orbit right now that tend to be a little bit smaller, a little bit more affordable, although they’re not as small as they used to be as they would’ve been projected to be 5–10 years ago.\nBen: That’s right. There was that rise of this notion of a CubeSat, these tiny little ones that we could put up there. That doesn’t seem to be much of the conversation today.\nAustin: CubeSats are amazing. You can have a satellite the size of a basketball, send it into space, and you can have a university lab with students build a satellite and send it to space. We have interns that join Starfish Space that have launched satellites before, which is amazing.\nIt turns out that’s a form factor that it’s difficult to do much useful in a satellite that is that small. Folks like us at Starfish tend to settle on satellites that are the size of maybe a dishwasher or a microwave. Various kitchen appliances which I get mocked for using to describe the size of satellites.\nBen: I love it. Then one more level-setting question on satellite numbers. You said 6000 or 7000 today in low Earth orbit. Most of those 6000 or 7000 have come in the last five years, and that we’re continuing to see thousands per year launched, right?\nAustin: Yeah. Most of the 6000 or 7000 have probably come in the last 2 years even. It’s really been a dramatic change in the rate at which satellites are launched. That’s something that we have more of ahead of us as new launch vehicles like New Glenn from Blue Origin or Vulcan from ULA or in particular Starship from SpaceX come online, and make it easier and easier to get satellites into space. It opens up new value propositions in the commercial world, new business cases.\nBen: What does launch capacity look like today globally? How does one get to space? Is it the way most people are imagining where 90% of launches come from SpaceX and then there’s everyone else.\nAustin: If you want to launch to space today, especially if you are in the position of a company like Starfish Space, you go on SpaceX. It’s really incredible what they have done over the last 20 years in the industry.\nThere are other folks that launch rockets—Rocket Lab, Firefly—there are foreign governments like the Indian Space Agency, and there are new launch vehicles coming online, but SpaceX has made it more affordable. They’ve made it on a more regular time cadence, and it means that every four months there’s a bus going to space. They call them the transporter missions.\nIf you want to send up a demonstration satellite or if you want to send up a prototype satellite, you hop on one of these transporter missions and they’ll send you to orbit. Once you’ve proved your technology out and you’re ready to send up more, then you can buy a full launch vehicle from SpaceX.\nIt’s very slick. I bought a SpaceX launch slot within the last several months. They sent me a link to go to this website to buy a slot and I said, are you telling me buying a rocket slot is going to be like buying a plane ticket? Ben, it was easier than buying a plane ticket. We had a 15-minute meeting to buy a slot for our satellite to go on a rocket, and the last 10 minutes were just us looking at each other. Was it really this easy? This is all we have to do?\nBen: Do you just put your wire details into a web form?\nAustin: Yeah. You just type in, this is our satellite, this is its name. I would like these two settings and not these other two settings for what size my satellite is going to be. Then you sign the contract, you send the money, and you’re done. It was amazing. It was so fast.\nBen: These transporter missions—I just looked it up—SpaceX did 96 launches last year, which is nuts. They’re doing [...] now. Once every four months is a rocket that is not exclusively sold to one customer. It’s sold to how many different customers are on a transporter mission.\nAustin: There are sometimes 100+ satellites on a transporter mission. Some of them will come from a given customer, but that means there are several dozen customers on any given transporter mission.\nBen: So for anyone who’s following all the developments of the space industry and is looking at Starfish, Varda, and a lot of these satellite companies, it’s very fun when one of these transporter mission goes up because you see 10 names of companies you recognize and it’s a big milestone day for all of those companies. They’re all putting something into space that over the next 1, 2, 6, 12 months is going to accomplish something that meaningfully moves their company forward.\nAustin: It’s almost an industry-wide celebration on those days. When we went up with our Otter Pup satellite last summer, it was the same rocket that Varda sent their first satellite up on. I’m calling friends from grad school who are at Varda and a bunch of other companies. We all sent our satellites to space on the same rocket and we all got to celebrate together.\nBen: It’s very cool. Maybe contextualize this question for me and for listeners. When you look at the way the space industry—like private, commercial—operated 10 or 15 years ago versus today, what are the biggest differences?\nAustin: I think the biggest differences we look back 10 or 15 years is the rise of what in the industry we often call new space. We contrast new space versus old space. That’s probably unfair to the old space side to call it that. If you look at 15 years ago, if you wanted to get a job in the space industry, you looked to NASA, you looked to large prime contractors like Lockheed Martin or Boeing or Northrop Grumman.\nI started my career coming out of grad school working at Lockheed. At the time there were a couple of small up and coming new space companies—SpaceX, Blue Origin—that we’re starting to think about space a little differently and starting to move with a different set of incentives.\nThose have become the new space companies that move a little faster, that operate as more traditional commercial businesses have become a lot more popular over the last 10–15 years. There are a lot of awesome success stories to look to, like Planet or Rocket Lab or Spire or Black Sky here in the Seattle area. Those companies are really exciting.\nI think if you step back and look at the space industry though, it’s important to remember how much is still done by the traditional large players in the space industry. Some of the biggest things going on in space right now include the space launch system run through NASA with a generally very traditional set of prime and subcontractors building that rocket.\nBen: The SLS is the rocket that is the platform for the Artemis mission to the moon, right?\nAustin: Exactly. It’s a very traditional, non-reusable, large, expensive rocket. By some metrics, it’s the most powerful that has ever flown to orbit. It takes a lot of money and a lot of time to develop.\nOther programs that are ongoing include other facets of the Artemis program such as the Orion capsule. There’s a lot that is going on in the defense side, and the organization of the Space Force in the last few years has really highlighted the scale of satellites and the scale of activities that US and Allied Defense are doing in space. That’s still the dominant portion of the space industry, and it is still a space industry that we can get really excited about the things that are going on today.\nI still think the pace at which the space industry is moving pales in comparison to the things that happened in the 1950s, 60s, and early 70s when humans went from having nothing ever reached orbit to having humans on the moon in 12 years. That’s an insanely fast timeline and that’s incredibly rapid movement. We don’t always move in quite that same way now.\nI think that that’s where the role of new space companies and commercial companies come in. We can take some of the technology and incredible capability that’s been developed, but by building business cases around them, we can do it at a price point where the value proposition actually works for customers to use the services, whether that is communication services or GPS services or Earth observation or in our case satellite servicing. You want to do something if the benefits outweigh the costs, and a big part of our role in the commercial space industry is to make the costs make sense.\nBen: That’s a great tee up. you and your co-founder Trevor, were at Blue Origin working on New Glenn, which is the big, big rocket, the latest and greatest from Blue Origin. You decide it’s time to leave and start a company. How did you pick what to start and what are the technical underpinnings on what became Starfish?\nAustin: There are multiple factors that go into starting a company. There is both, what is the idea that we’re going to pursue and maybe it’s best said is what is the idea that we’re going to pursue initially? Because anytime that you are building a business, you learn and things evolve over time.\nOur idea back in 2019 when we started Starfish is very similar to what we’re developing now, which is basically a satellite that can grab and move other satellites in space. That initial idea is something that Trevor and I, as we thought about problems and looked broadly at the space industry, said this is a capability that will be useful in the extended future as humans build out new structures and satellites and telescopes at a larger and grander scale than we’ve ever done before.\nIt’s also going to be something that’s useful today if you need to move a satellite around, to extend its life or to dispose of it as space debris. There’s a part of you that is going, okay, is there a useful value proposition here in the services that we provide?\nThere’s also a part of you that is just deciding about starting a company in general. It’s a great call to call your parents and say, you guys remember all of the things that you’ve done for me and how relieved you are that I am now an adult that can take care of myself and you don’t have to worry about on an hour to hour basis anymore? What if I didn’t make any money because I was starting my own company and you worried about me every hour again?\nI think what gave Trevor and I confidence to go out into the space industry and start a company was that we looked at a lot of other founders that were starting companies, whether that is Rocket Lab, Planet, Relativity, or Made in Space. People went out and built business cases, raised capital, won contracts, and delivered solutions for customers. That was amazing. It was amazing to see the potential impact that that gave them on changing the way that humans can go out into the universe. We said we wanted to be a part of that.\nBen: All right, just so we don’t bury the lead here because I think this is insane, Starfish Space’s product is a spacecraft that looks like a mini fridge. It’s about the size of a mini fridge. It is an autonomous little satellite that goes up and uses electric propulsion to approach another satellite, and then use electrostatic docking. It doesn’t need to be specially custom designed to dock.\nIt can dock with a variety of materials to reel lightly, nudge up to that other satellite, grab it, and then either push or pull it to change its position and either extend its life, which can be worth tens of millions of dollars if your satellite runs 5 or 10 years longer than you expected it to, or safely deorbit it. Oh and it does all this at one-tenth the cost that it used to take the old way of docking with and maneuvering satellites. Did I get the general gist right?\nAustin: Yeah. If you watch a science fiction movie, you will see two ships come together in space and interact in one way or another. It’s such a staple of how people envision in the far future that it will happen in any sci-fi movie that you watch.\nIn reality that’s a much more difficult problem than it appears on the surface, because two satellites in space are moving several kilometers per second faster than a speeding bullet. Our challenge in doing our mission is to have one satellite, one speeding bullet come up to another speeding bullet, and have them come together in a way that is so gentle that both of them can continue to safely operate afterwards. The physics is also nonlinear because you’re not moving in a straight line. You’re orbiting around the Earth at the same time.\nBen: So just in case you thought you could use X and Y and Z coordinates, it’s…\nAustin: Yeah, you thought, oh this is just two normal speeding bullets coming together, but there’s a little extra trick to it too. It’s a problem that we’re not the first one to solve satellites seems if docked objects in space for 60 years. It’s just taken really large and complex systems to do that.\nAt Starfish we are using, as you mentioned, autonomous software using electric propulsion to bring satellites together with a much more software capable but a much less hardware complex vehicle. It allows us to do missions that generate unique value for customers.\nThe core mission that I’ll highlight here is what I’ve referred to a little bit as life extension. It turns out for a number of large satellites, they run out of propellant at the end of their lifetime and you have to retire a functioning satellite because you don’t have any propellant on board anymore.\nBen: And these could be satellites that while operating enable a business to charge customers for telecommunications or for satellite TV.\nAustin: Yeah, several of them are making several tens of millions of dollars of revenue a year. The life extension mission is not one that we invented. Northrop Grumman began doing a life extension mission in 2020 and it’s amazing. It’s an incredible credit to them that they are successfully doing this mission. They’re getting paid $65 million to extend the life of a single satellite for five years, which is representative of the incredible value that you can do if you perform this mission for satellites that are in space.\nThat’s why we’ve gone out to build a business around this mission and other similar missions, and why this space industry can be a really interesting industry as we develop capabilities because one asset in space, one piece of infrastructure in space is providing so much value, that tens of millions per dollars a year revenue are coming in.\nBen: Many space companies that I talk to, their pitch is, oh well because of technology advancements and cool things we’ve figured out and the price of launch coming down, we can do this for a tenth the cost of traditional defense primes would’ve been charging 20 years ago when they first figured this mission out or 60 years ago when they first did a mission like this. What are some of the step change cost reductions that enable Starfish to do what it does?\nAustin: At the end of the day, we solve problems with software instead of hardware. I think this is a trend that folks see across a variety of different industries right now that things that used to be really complex hardware can now be software-enabled hardware, and that adds extra capabilities into a system.\nFor us as an example, our software is capable of docking a satellite with a single thruster on board. Previously, docking would’ve taken dozens of thrusters sticking in every direction off of a satellite. By not having dozens of thrusters, by having a single thruster, we can save incredible amounts of mass.\nOur fundamental problem in the space industry is that we’re in a gigantic gravity well and we have to get things to orbit for it to be the space industry. Saving lots of mass by removing a bunch of thrusters from the satellites allows us to build a satellite that is much more economical to go to space, or can fit on a broader set of rockets to go to space. There’s a lot of value that we can then provide because we solve our problems with software instead of hardware.\nBen: All right, so let me play devil’s advocate. Sounds great to just use one thruster, but if I had 10 it would give me a lot more flexibility to make sure I really nailed being in the right place at the right time, at the right orientation, going the right speed. It sounds impossible to only have one thruster and be able to do that right. Why is that not impossible?\nAustin: If you had 10 thrusters, you probably could do this better. But you can do it with one thruster, and it’s tricky. A lot of times, your thruster which is moving the satellite by throwing mass out the back really fast.\nBen: In the case of electric propulsion, what is it throwing?\nAustin: It is throwing xenon, which is a noble gas out the back.\nBen: This is different, like when I watch a space movie and I see like it spray chemicals out everywhere.\nAustin: Yes. A traditional thruster that people are looked to have chemical thrusters in a large plume, and that pushes hard on a satellite but it’s not very good gas mileage.\nIf you use electric propulsion—which people use pretty widely throughout the space industry; this is nothing unique to Starfish—rather than making a fire that expels gas out the back, you are ionizing individual particles of xenon or krypton or some other noble gas. As you ionize individual particles of xenon, you then pass them through a really powerful electric field and you accelerate them to high velocities. When you accelerate them to really high velocities, that’s a lot of gas mileage. You’re getting a lot of momentum exchange for small pieces of mass.\nWith an electric propulsion thruster, you can only do that with a finite number of particles at any given time, which means the force that you are using to push on your satellite is the same force as a house fly sitting on your hand. It’s really an incredibly small amount of force. To make a change, it takes a long period of continuous force to change your orbit. That’s difficult to dock a satellite with.\nBen: Okay, so if you can just drip xenon out the back real slow, it puts a large onus on you to do your route planning very well, sort of be a good navigator. That’s (I assume) why when you say the efficiencies are done through software, that’s what you’re talking about?\nAustin: Yes. For us, this aerospace industry, we call that guidance navigation control. It’s really a set of mathematics that are controlling your satellite and allowing it to operate autonomously. To get to a point where you’re comfortable with these algorithms and this software running your satellite, you have to run it thousands and thousands of times on the ground against real physics.\nIf you look at the way that we develop at Starfish—this is not unique to the way that we develop at Starfish; this is something that if you’re doing a good job developing this type of software, you’re doing it throughout the industry—we will build a series of physics models with ever increasing fidelity. We will run our algorithms through those physics models a thousand different times with a thousand different slight variations in what you call a Monte Carlo simulation.\nYou come out of it and say, look, this is 95% of the time it worked perfectly. Out of these other 5%, 4% of the time it detected, all right, something’s going on. Let’s abort and get out of here safely. Then 1% of the time it didn’t detect and it had an error that we would definitely not want to see in flight. Let’s go dive in and figure out what’s going on there.\nAt the same time that you are progressing the algorithms to make sure that they can handle all the physics, you have to also get your physics to a point where you can trust the physics.\nWe have a satellite in orbit right now. The Otter Pup satellite is designed to demonstrate a bunch of technologies and gather a bunch of data for us to use as we go forward as a company.\nOne piece of data that is really interesting and really tricky to just calculate on the ground is the effect of drag on your satellite. You don’t think your satellite should experience drag. It’s in space. There’s no air in space, but it does experience just a little bit of drag because you’re going at incredibly high velocities, and there are a few particles of gas that are still in the very extended regions of Earth’s atmosphere at 500 or 600 kilometers off of the surface of Earth.\nYour drag depends upon how many gas particles are in that region of space on that day at that time of day, how exactly is your satellite oriented, how is the other satellite that you’re operating around oriented, and what is the difference between your two satellites' drag profiles. If you’re going to go dock with a single thruster, you have to fold all of that into your calculations that are all happening autonomously on board because you’re never quite sure when you’re going to get a pass with the ground station so that you can talk to your satellite.\nWe gathered a bunch of data on this with our Otter Pup satellite that’s on orbit. We folded it into our physics simulations, and it gives us a better physics model so that as we go run our 10,000 cases, you have increased confidence that your algorithms are being tested as close to real life physics as possible or as close to real life physics as necessary. You have increased confidence that your algorithms are going to work when you deploy them to space to go dock another satellite.\nBen: What are the list of things, what are the reasons why everything you’re doing at Starfish at the cost that you’re doing them could not have been done 20 years ago?\nAustin: There are a lot of things that we at Starfish use that are unique to the last 20 years. Some of them are fundamental to the space industry, affordable launch, the decreased size of satellites. Some of them are fundamental to the way that technology is developed nowadays.\nWhen we simulate 10,000 Monte Carlo cases, we do it on cloud infrastructure, and we have to do it in a particular way because some of our data is export controlled. But it allows you to simulate 10,000 cases by (in theory) spreading them to 10,000 different computers, which we could never have set up on our own here.\nBen: Do you have meaningful costs around simulation?\nAustin: We have actually pretty substantial costs around simulation, and that’s because you have to play out the physics with enough fidelity to be confident the algorithms work. You have to play it out over a time horizon so that you can see your satellite transitioning between the various things that it is supposed to do. You want to play it out as fast as possible because that’s your development cycle, is you go and implement a new algorithm, then you go run a test case on that algorithm, and you get feedback on whether or not that algorithm is working the way that you want it to.\nThat level of compute capability, and also the level of software infrastructure that we’re developing on because we write a lot of our algorithms in Python. We use capabilities that are developed in Python, and it would be very difficult to do using the languages and tools that we would’ve had 20 years ago to work with.\nAll of that enables us as a relatively small team to develop faster, more accurately, and more powerful capabilities that are true across technology stacks in many industries. Then at the same time, we can use the things that are maybe unique to our industry, such as reduced launch costs, such as smaller satellites.\nBen: What is the team size? Just to give people a sense.\nAustin: We have about 50 folks here at Starfish Space overall working on the flight algorithms team, which is really focused on the guidance navigation control software to safely operate around other satellites. It’s about 20 people, which in many ways that’s a lot of people to be working on any given project.\nBut if you compare that with the scale of traditional government programs, there are 10,000 people working on the space launch system one way or another indirectly in any given year. To do something interesting and notable in space with a team of 50 people is a totally unique capability to the last decade.\nBen: And 50 is even generous. I mean, how many people did it take to actually work on the Otter Pup program?\nAustin: When we started the Otter Pup program, we ran around the entire company to pick a key supplier, and there were nine of us. That’s all there was to vote on who this supplier was. This was 18 months before Otter Pup went to space.\nBen: That to me is the soundbite. A nine-person team can do everything from the software to vendor selection to getting on a rocket and then 18 months later have a spacecraft in orbit. That is so fundamentally different than anything that’s ever existed before in the history of this industry.\nAustin: It really is, and it’s really powerful to allow you to go experiment, try things, learn what works and what doesn’t, and use that to build products and services that provide value to people, whether that is as a business or you could do the same thing in a government organization if you had a really powerful small team at the Jet Propulsion Laboratory working for NASA. You could do a lot with just 10 people today. That’s amazing.\nBen: Just to finish on the Otter question, are there things on the spacecraft itself that are just so much more powerful than what we had 10, 15, 20 years ago that enable this technology to happen today at the cost it does?\nAustin: We take advantage of advances in compute hardware on the ground, but also on the spacecraft itself. It can sometimes be tricky to take advantage of the leading edge of capabilities in space because there’s a set of environmental challenges that are unique to space that aren’t always designed for on the ground—operating in a vacuum, operating without gravity, operating without air to take heat out of your system, operating in environments that have additional radiation or a broader range of thermal conditions that it might be subject to.\nBen: So you’re not just grabbing the latest and greatest Snapdragon that’s going in the new Samsung phones and using that to power your spacecraft.\nAustin: You can try, but a lot of times you will be unsuccessful in doing it. One of the key challenges that say we study for the Otter as we send the Otter up is what level of CPU/GPU capability can we have on board. We need both. We have to go do dedicated radiation testing. We have to go do dedicated vibration testing to be confident that whatever we send up is going to function in the way that we need it to in an on-orbit environment.\nIf you don’t do that, you can have things that just shake apart during the vibration that is inherent to going up on a rocket to space. You can have objects that are constantly resetting because they’re being exposed to high energy particles in space. Those are real hiccups that have caused satellites to fail.\nBen: We keep coming back to this question of if you want to do a new idea in space, what does it actually look like as a small team to do that? You obviously don’t make every single component. You put together things from vendors. I’ve been in your office. There’s a vacuum chamber. There are a lot of things that look like a lab that you are subjecting physical materials to. What are the set of things that you feel you need to do as a small team yourself and what could you work with vendors for?\nAustin: We felt as a small team that we have to do things ourselves if they don’t already exist out in the industry. I’m sure we could find someone and tell them we need a piece of hardware that can grab onto another satellite, try to specify it and co-design it, and ask them to do the work for us. But that adds a lot of layers and overhead. We would rather control that in-house, know that we have the best folks working on it, know that they have all of the best information available to them to work on it.\nBen: And in part, the grabbing mechanism was Trevor’s PhD thesis. I don’t know who you would outsource that to.\nAustin: There are pieces of that. There are key technologies, though, that we do in-house because of that. Some of that is on the software side, a lot of the guidance, navigation, and control. Some of that is on the hardware side, the mechanism to grab onto another satellite. There’s a robotic arm and effects that we develop in-house because it’s unique to our mission.\nEven the high level satellite design, the way that it is optimized and the vendor selection are all things that are really unique to our mission and we have to do in-house. There are a lot of things, especially in the modern day space industry, that you don’t have to do in-house. You can go buy reaction wheels from other people, and reaction wheels are big spinning heavy wheels that are onboard your satellite that you can—\nBen: It’s like a literal flywheel, right?\nAustin: Yes.\nBen: The business community has co-opted this term, but this is a flywheel to stabilize your…\nAustin: Yes. As you adjust the rate of rotation on that wheel, you can adjust the rate of rotation on your satellite because of conservation of angular momentum, and you can point your satellite in different directions.\nA lot of satellites have reaction wheels or something like them, and you can go and buy reaction wheels off-the-shelf and plug them into your satellite. That means that we don’t have to develop reaction wheels at Starfish Space. You can go and buy cameras off-the-shelf. That means that we don’t have to develop space-grade cameras here at Starfish Space.\nThe infrastructure that is around us in the space industry is infrastructure that is still in some ways being set up. To be frank, that’s where we have faced a couple of challenges on our Otter Pup mission is that the infrastructure around us maybe wasn’t quite ready for the use cases in which we were using it.\nBut the development that the infrastructure around us has had is what makes it possible for us as a nine-person team to begin working on a satellite mission, because we can call up somebody and say, listen, we want to buy one of your satellites. We’re going to have some things that we’re going to screw onto it and a lot of software that we’re going to load up to it, and we’re going to prescribe a camera and a thruster for you.\nHaving them already able to make satellites means that we can move faster by taking advantage of the development that they’re doing, and also take advantage of the heritage that Astro Digital, who is our partner for the Otter Pup I mission, has flown 50+ satellites in space before. So they know a lot of things that work for their satellites, and that’s a huge boon for us to remove certain risks from our development effort.\nBen: So zooming out from Starfish a little bit and looking around at the rest of the industry, there was a lot of excitement and investment in space starting six, seven, eight years ago. What are some of the things that people were excited about that have proven to be really valuable? Like there’s just clear customer demand and customer dollars changing hands here. What are the set of things that turned out to be too speculative or bubbly or use cases like that?\nAustin: I’ll start off by turning the question back on you, Ben. As you started to get interested in the space industry several years ago, what were the things that got you interested in the space industry?\nBen: Oh, the biggest unlock for me was when we did the SpaceX episode and realizing that the price of launch has come down 10X. I think between the initial cost per kilogram to get to orbit from the early days of the shuttle to the Falcon nine today, it’s literally a 90% reduction.\nTo me that is just this ding, ding, ding, ding, ding of there might be things that were non-economic before that actually have business models around them now. Now I don’t think I’m smart enough to know exactly what those things are, but that makes a potential investment category light up.\nAustin: That’s what in many ways we are exploring here as an industry. You can see today how that already is lighting up that SpaceX had almost 100 launches with the Falcon nine last year. Launch rates are reaching a cadence that they haven’t hit worldwide since the Cold War. That’s because of what SpaceX is doing with the Falcon nine. Even though launch rates are hitting that cadence. I have a hard time buying a launch. The waiting list is really long because there are so many people signing up to launch their satellites to space.\nIn a weird way, one of the things that continues to really be an area where there is a lot of value in the space industry is launch itself. Even though SpaceX is a leader, there is a big need. I have a big need for more rockets to be on the market, and I want to see people succeeding in doing that. It’s a little funny to reflect on because I remember several years ago I would chuckle at the number of launch companies that were out there worldwide in the space industry, but now I need them. Now I need more launch companies, so I’m rooting for everybody.\nBen: I think it’s important to point out, too, all launch companies are not created equal. I looked at several launch providers when I was considering investing in the category and everyone’s got a little bit of a different thesis. There’s the, oh, SpaceX is going to have the big heavy thing with Starship, but you really need a super, super reusable first and second stage rocket. That’s your workhorse 737-style that can go up and down all the time.\nOr someone else saying, well, it’s actually more energy-efficient if we have a tiny little rocket. that rocket can go up and down very often and it’s not a big deal if it blows up. That runs counter to the great Jeff Bezosism that rockets are all about economies of scale, like rockets love being really big. I at least felt like I was getting every pitch under the sun in terms of different rockets for different specialized use cases.\nAustin: There were a lot of explorations on, okay, well what are we going to do with rockets to provide unique value here? And I think that some folks have had success with that and are continuing to grow and provide really exciting futures with rockets today.\nBen: But you’re just saying there’s a capacity problem period. Like okay, great. Go make the same thing as SpaceX. I’ll buy it.\nAustin: I chuckle because sometimes at early stages of startup you have to have your differentiator that sets you apart. But really if somebody else was making exactly the same thing at SpaceX, even if they were making exactly the same thing as SpaceX, just slightly worse in a couple of ways, they would have a full book of business right now because we just need more rockets. We need more rockets in part because so many other things are hitting and are really exciting in the industry. Position, navigation, and timing like GPS only gets more popular. Communications…\nBen: I went golfing for the first time in a decade last week. My golf cart had a GPS. I would drive closer to the hole and it would tell me how many yards to the green. It was the craziest. I was like, this has GPS now.\nAustin: It’s everywhere and it’s a staple. Even just the timing from GPS allows you to synchronize things around the world. On the communications front, as much as we talk about SpaceX doing an incredible job with launch, they’re also putting up the Starlink Constellation, which has several thousand satellites in orbit, and they use that to provide internet to people around the world.\nThere was an independent report that came out last week that projected that they would have $6 billion in revenue in 2024 from the Starlink Constellation, from what was three or four years ago zero because it didn’t exist yet. That’s amazing growth and amazing value that people are only just scratching the surface of.\nBen: Starlink is turning out to be one of these things that a lot of people were speculating, oh, do people actually want this? Will they pay for it? Will the quality be good enough? Will there be enough bandwidth to go around for the number of people that want it? And basically the answer has just been, yes. It is an absolute gangbuster success of a business, at least from everything we can tell from the outside so far.\nFull disclosure for everyone, I’m a small investor in SpaceX, just like I’m a small investor in Starfish, but I don’t have any privileged information on SpaceX. I’m just reading the same independent reports you are Austin, and it sure seems like it’s going very well.\nAustin: It absolutely does. There are a lot of other things that are exciting in the space industry. Earth observation is useful for a variety of different reasons. Earth observation data from satellites has been key over the last two years in helping Ukraine defend itself as it gets invaded. That’s incredibly powerful and saves many lives.\nI was talking with somebody very recently who helped develop the capability to make SOS calls from your phone through a satellite from anywhere in the world. They told me that they had phone recordings of some people who had been caught in wildfires and were stuck in a place that wouldn’t have had cell phone service. They used the SOS system on their phone to call for help, and their lives were saved because help could get to them because they could route the cell phone traffic through satellites.\nI was marveling with the engineer who had helped develop this system, at just how rewarding that must feel to know here’s the voice recording of the person whose life my work saved in that instant.\nNow, we’re exploring a lot of new value propositions in space. I think what Varda has done in manufacturing some materials in space and returning them to Earth is really interesting. I think what Inter Loon here in the Seattle area is doing by exploring how we can use materials from the moon to provide value here on Earth is really interesting.\nObviously, I’m biased. I think what we’re doing at Starfish Space is really interesting. How can we protect and extend satellites in orbit so that we can get more value from them, and someday that’s the same autonomy in robotics that helps us have an ever-growing infrastructure and space that builds upon itself.\nWe’re going to see over the next 5–10 years how a lot of these business models play out. There’s clearly a lot of economic interest. Also the engineer in me always has to remind myself we have to go deliver on this. We have a lot of potential. There is funding that is moving into development of a lot of technologies, but we have to take the funding and the opportunities that are available, and build systems that really provide value to folks. You’ve seen as people are able to do that so far, it’s led to some really successful businesses.\nBen: Zooming back out to the industry again, you touched a little bit on the defense use case there. What is the size of spend in the space industry on defense versus (say) civilian government? So comparing NASA to DoD in the space budgets.\nAustin: I believe that the NASA budget and the Space Force budget are very similar scales, that they’re both tens of billions of dollars a year. We talk about NASA and we highlight a lot of the things that go on at NASA and it’s really incredible.\nThere are a lot of really incredible things going on through the Space Force or other areas of the government that also use space to provide value, and they don’t have quite the public attention, which is quite a reasonable and sometimes necessary thing. But it’s also a really important thing that is being done in space.\nWe were fortunate earlier this year to be selected for something called the STRATFI contracting program with the Air Force. It is going to mean that we send a satellite to space. We send an Otter to space in a couple of years to do missions for the Space Force in geostationary orbit. It means a lot of dollars into Starfish Space in a couple of different ways to deliver on the potential that we’ve been developing the technology to be able to do.\nI think something that’s been really exciting is to see the way in which the US government and maybe the Space Force and the Air Force deserve particular credit here, to see the way in which they want to lead innovation forward.\nOur contract with the Space Force, which is tens of millions of dollars in revenue, started with a $50,000 revenue contract. There was a series of multiple contracts that we did over what’s now a few years to build up the confidence for the Space Force, to want to go forward with Starfish Space, to want to use our services, and for us to build up our ability to deliver services for the government. Having the US government as a customer and allied governments as a customer is really key in the space industry. It’s an essential part to the space industry.\nBen: What is that process? I know you have a large commercial contract and this large STRATFI contract with the government. How does the process of landing a commercial customer compare with the process of a government customer over the last few years?\nAustin: The government customer’s unique customer with a unique set of constraints.\nBen: I can’t tell if that’s very diplomatic of you or what.\nAustin: Sometimes the government can be a great customer, especially when you get to work with different technology development labs inside of the government. They have been a customer that also allows us to use really advanced testing facilities that they have, or also provides a series of engineering perspectives that’s really valuable to us.\nBut the folks that are controlling the purse strings of the US government are not always the same people that are making the decisions about which companies or which technologies do we want to bet on. That means that your sales process into the government involves multiple different channels with multiple different stakeholders.\nWe sell complex services that are high value for individual contracts and we work with large organizations that are dealing with complex technology. There is no easy sales process here, but at least when you’re selling to a commercial company, most of the people can see the email addresses of the other people that you’re talking to in the organization. When you’re working with a large government, that is very much not true, and a lot of times you have to bring stakeholders to each other to get a decision to move forward.\nBen: Fascinating. You may not realize this, but I happen to know that this person’s going to be a roadblock in the approval pathway for this. I’d like you to get together and talk about our product and our company and this contract because I know further down the line it could be something that comes up.\nAustin: Absolutely. Which can be a challenge.\nBen: What advice would you have for other entrepreneurs who are considering a government customer?\nAustin: First, you want to pick when is the right time to go engage with a government customer. If it’s going to be 2% of your business, then it might not be the best first customer to target. You might want to stand up on the commercial side and then go support the government customer. If you decide, you know what? Either this is a substantial portion of my business, or my commercial business is up and running and now I want to go expand into government markets.\nOne thing that different folks in the government have done very well is they have tried to create, and sometimes they’ll even use the term ‘front doors’ into the government. They designate organizations and entry points for you to go engage with that organization, and then that organization is tasked on the backend with connecting the dots and making sure that you reach the right customers at the end of the day.\nA couple of programs that are examples of this. One is AFWERX. That’s how we first started engaging with the US government is through AFWERX. AFWERX is a program that is designed to find early stage startups, help fund little bits of their development, and help connect to people in the Air Force. The Space Force here is a subpart of the Air Force, but to help you connect with folks in the Air Force to move forward your relationships if what you’re doing is valuable.\nDefense Innovation Unit is another group that deserves to be called out, which really does a great job trying to find the latest technology and the most exciting entrepreneurs to be able to work with, and help their technology provide value to the US government.\nThere are things that go on like the NASA side also. NASA has a whole SBIR (Small Business Innovative Research) program, which ideally they want to use to springboard folks into working with NASA and into providing value to NASA.\nThere’s been a lot of effort because there’s now a track record of innovative startups and technology companies providing value to the US government in a unique manner. There are a lot of people who helped Earth observation companies like Black Sky or Capella or Planet begin working with the US government 5–10 years ago. Then data from those companies is being used on a regular basis around the world to support US interests.\nNow, you can look at those companies and go, that’s been a really good program to get them involved in supporting the US government. Let’s put more Reese horses into making sure that we get companies on the forefront into and supporting us and allied government activities.\nBen: Makes sense. All right, while we’re on the advice train, I also want to ask you. For anyone who is thinking about, I was going to ask you a hardware company, but it’s broader than that. It’s a hardware company that’s bumping up against the edges of physics. Someone doing hard tech, as I think it’s coming to be called, what advice do you have for people who are looking to build those types of companies and how that might be different than say a SaaS founder?\nAustin: I’ll be curious about your answer here also. You’ve seen us develop. You probably have advice. Hopefully, you tell me that advice rather than just put it on a podcast. I think that from my perspective, one of the things that is challenging about a hard tech or a deep tech company is that a lot of your risk can take a long time and a lot of dollars to buy down.\nAt Starfish Space, we’re five years into the company. We’ve had a very successful five years. Despite having a very successful five years and having a demonstration satellite in orbit right now that we’re learning a ton from, there is still work ahead of us to have a full satellite that’s providing the services that we want to provide as a business.\nThat is just inherent to the type of business that we formed, that it takes long time spans and it takes a lot of capital to fully de-risk things. You have to find ways to de-risk along the journey to that endpoint.\nYou have to do things like send up a demonstration satellite, like take the hardware you’ve developed, go down and test it at an Air Force lab. You have to engage deeply with customers early on. Those are the things that are going to tell you whether or not you’re on the right path and whether it’s worth continuing to pursue.\nIt’s a lot of times harder to sort through the noise and find the signal when it takes a lot to de-risk things. Sometimes it can be easier if you build your product in three months, you go put it on the market, and you see whether or not people buy it.\nBut you can de-risk things as a deep tech company. As much as you can test your ideas early and test them often, it really helps you move quickly towards the end point that you want to be. I think that’s true for startups like us. I think that’s also true for companies like (say) SpaceX that have reached a later stage.\nYou see the way in which they tried to fly a bunch of starships and land a bunch of starships early on. Many of them didn’t work, but the testing that they did in trying to fly those has been huge in having them develop Starship in the way that they want to, which appears to be an incredibly successful path.\nThat same lesson, yes it applies for SpaceX at scale, but it applies at a much smaller scale. For somebody who is out on the very first day of their company, they can still call a customer and say, listen, I don’t even totally know what I’m going to build, but can we talk through. If I were to build something in this area or if I were to build something that did this, would that be helpful for you? Would you want to pay for that someday?\nBen: I’ll say from my perspective, there are so many things that are different but you’re touching on this interesting one, which is that relationships matter more. Because when you get an LOI in the space industry or you bring on what SaaS companies often would call a design partner, I think in the space industry it really means you’re taking a bet on each other.\nWhereas I think in SaaS land it’s like, sure, yeah, I’ll play with your thing. I might give it 3–5 minutes and then write you a little email telling you if I would use it or not. But it is crazy how much when you are one of only 3 companies in the entire sector doing something rather than 30 or 50. Once someone selects you as the horse that they’re betting on, it’s a really big commitment. That’s one big thing.\nThe other one is the lumpiness of milestones. In traditional software companies, little things happen every day and you barely notice. In the space industry it seems like there are these monumental days that are trajectory-changing for companies. They happen 1–3 times a year and you’re holding your breath until those moments happen, which is wild as an investor. I can’t imagine what it’s like as someone running a company, building a culture, leading teams, and looking for that consistency every day of everybody showing up and maintaining some level of excitement.\nAustin: The lumpiness is really unique. I have spent my whole career in the space industry, so maybe I’m used to the lumpiness and don’t appreciate how unique it can be. But our process to get to this STRATFI contract with the Space Force recently was really a years-long process to build up to that point.\nIt meant that the moment that we were selected for that contract was an incredible inflection point in our overall business, and it was one moment where we were selected for that contract. It doesn’t mean that your business can hinge on large individual events, and you have to make sure that you build a business in a way that is robust, to there are enough potential individual events that some of them will go your way.\nBen: You got me thinking now on other ones. The government as a customer is pretty amazing because it’s a recession-proof customer. When the government says they’re good for some money, they’re good for that money, they’re going to do the thing. The budget is set. It is very different from when the world was falling apart a couple of years ago. I felt Starfish was unaffected.\nAustin: In many ways that’s true, and I think that’s true even for other areas of the space industry because even our commercial customers are looking at buying services right now. It’s because they think that in five years there’s going to be a market for them.\nThey’re not making that decision of what is worth it five years from now based on what the market is up or down today. It is still a long-term decision where they take into account the average of expectation of the market. The US government is maybe uniquely resilient as a customer from either other aspects of economic ups or downs. In general many of our customers at least are very steady.\nBen: I think the key thing to de-risk is also super different in your case. In most B2B SaaS companies, the big question is can you price, package, and build something in such a way that people will pay you money for the value you’re providing? Can you create enough value such that it’s worth it to go sell that to other enterprises? Or in consumer software it’s, can you create something that people can’t stop using? Like people just can’t get enough of a social network or whatever it is.\nIn space, the key thing to de-risk is can you do it? Can you actually make this thing? The technical risk is the thing to de-risk. How many engineers work at your company?\nAustin: Out of 50 people, over 40 are engineers.\nBen: It’s crazy. I mean it’s just a completely different set of unknowns and de-risking that you have to do.\nAustin: I think that’s true. I do think for new space to be successful, a factor in your engineering is the business case. When we are making selections about who our key suppliers are, we look back very directly at our business case and say, choosing between these two components causes a difference in how much revenue we’re going to generate for the mission. How does that affect which of these two components we select?\nThere are folks in the space industry, even if you look at our world of satellite servicing where people have done satellite servicing missions but just didn’t do so in a way that quite made sense economically for them to continue to scale and do it for lots of companies, do it for lots of customers.\nSo yes, you have to figure out can we even do this at all technologically, but that’s maybe hidden behind, we’ve built an architecture that is based upon the dollars and cents, and making sure that the benefits that we provide outweigh the cost to provide those benefits.\nYes, we have to see if the technology works, but we have to see if the technology works inside the architecture that makes the business work, which I think is a really good and healthy incentive structure to make sure that we have focus, to make sure that we prioritize really well.\nI think at times where you can be led astray with large government contracts is if your organization is getting all of your costs paid for in a cost-plus contract, and the amount of profit that you make is independent of how much effort you put in, then you’re not really incentivized to be efficient in the way that you operate. If you’re not incentivized to be efficient in the way you operate, then you won’t be efficient in the way that you operate.\nI think it is a really valuable thing that we and others like us have economic incentives to develop the future of space as humans go off our planet, but do so in a way that is efficient with the resources we’re putting in.\nBen: What bottlenecks exist for this industry other than there’s just not enough launch capacity? When you think about going from ore in mines, pure raw material, to customers deriving value from objects in space, what else needs more bandwidth?\nAustin: I think so much of what we’re limited with is time. There are a lot of things that take a long time in our industry. One is you have to schedule your launches a long time out. But two is there are a lot of components that we order that have 12-month lead times to ordering those components.\nThat means that we sign a contract to launch a satellite in two years for a customer and two years feels like forever. But we have to go sign the contracts with our suppliers as fast as possible on the heels of that, so that they can get going on their 12 month lead time parts, so that we can get them in-house with a few months to assemble it into a satellite, so that it can get to the launch vehicle ahead of launch.\nThere’s a little bit of margin in case something goes wrong along the way. It took you a long time to get that contract in place because as much as the government is putting a lot of effort into moving quickly and trying to move at the speed of startups, it just doesn’t always yet. The other organizations you’re selling to are large businesses that you can move fast but don’t always inherently move fast. All of that slows you down.\nOne of the things that I think is really exciting and helpful is that as space provides value in a bunch of different facets and as the industry grows, there are more and more things that become available off-the-shelf or close to off-the-shelf.\nBen: That seems like it has to be essential. Every component provider needs to feel like there is a deep liquid market for their stuff at all times to produce enough inventory so that you don’t have to wait a year for them to make it for you.\nAustin: Yes, and already 12 months is fast compared to what would’ve happened 20 years ago when it was, oh, if you want to order that, I could design it and build it over the next few years.\nWhat I’m excited for is five years from now when somebody just has a production line of thrusters, you pick the latest and greatest off and maybe you have to wait a couple of months, but you’re talking about waiting a couple of months.\nI’m excited for customers to get used to working with companies like ours and to scale up how they work with companies like ours. I’m excited for the licensing process to allow your satellite to get to launch to space to be moving faster.\nBen: You mean regulatorily?\nAustin: Yes, to make sure that the FCC is okay with satellites, which are basically just radios going into space and communicating back to Earth here. There are a lot of things that mean right now if you want to start launching a satellite, it usually takes at least 12 months, sometimes multiples of that to get your satellite into space. That’s a much faster timeline than it would’ve been, and I am so excited for how fast that timeline is going to be five years in the future as more and more capabilities emerge in the space industry.\nBen: All right, so time, deep liquid markets of supplier manufacturers. Let’s throw out this hypothetical. What if we wanted the space economy to be providing five times as much value to customers and thus five times more revenue to space companies? What else would’ve to happen? Talent, bandwidth.\nAustin: That’s what I was going to say. One of the other things that jumps right to my mind is we need more people in this space industry. I hope that folks that are listening to this take a moment to reflect on whether or not that’s interesting to them.\nAt Starfish Space, we’re hiring lots of folks. There are lots of companies in the space industry that are hiring a lot of people. There are thousands of jobs in the Seattle area at any given time that are open in the space industry.\nYou don’t have to have been in the space industry before. You could be an electrical engineer that worked on consumer products, and you’re going to have a really interesting unique perspective to bring into the space industry. That’s true from a software perspective. That’s true from a marketing perspective. That’s true from a business development perspective.\nWhat we offer uniquely as an industry is an industry that everybody’s incredibly passionate about. Basically, everyone in the space industry got into this industry because it’s something that we’ve dreamed about, because we’ve read books or watched movies or followed as Mars rovers have landed on Mars or as humans have landed on the moon, and it’s become a dream.\nWorking in an industry where everybody is still pursuing the same dream that they had as a nine-year-old, means that there’s a unique connection with others in the industry. There’s a unique meaning to every little accomplishment that you get to achieve. Every milestone that your company hits can be uniquely rewarding.\nI think that it means that a lot of people that come to the space industry stick in the space industry. But we need more people in the space industry to be able to fill the potential and the promise that we have.\nBen: All right. My closing question for you. It’s 20 years from now. How will you know if Starfish became as successful as you want it to be? What would that look like\nAustin: Twenty years from now, Starfish Space is doing a lot more than just life extension and satellite disposal. Twenty years from now, the same autonomy and robotics that allows you to go up to and interact with another satellite, to grab onto it, to help it operate for longer.\nThat same autonomy in robotics allows you to build a space telescope that is bigger than and more robust than the James Webb Space telescope. You can point that telescope at another planet and decide, you know what? Those look like continents with green things on them. Or that’s oxygen in the atmosphere.\nTwenty years from now, if Starfish Space is successful in the things that we want to do, then humans are in a position where we can go discover life on other planets.\nTwenty years from now, humans can visit other objects in the solar system. find resources that are uncommon here on Earth, and use it to provide increasing value on Earth, whether that’s rare earth elements, or Helium-3 if you’re on the moon, or a variety of different resources that are unique in the solar system and more common in other places than they are here on Earth.\nBen: And to connect the dots, you’re talking about space dock. If we’re successful, we’re going to be able to have robots in space that build other space-faring things.\nAustin: Exactly. Whether it’s build them or upgrade them or recycle them or extract resources from them, that’s the core capability that begins today with going up to another satellite and grabbing onto it, so that you can extend its lifetime or dispose of it.\nBen: Awesome. Well, Austin, thank you for the time, the brief dipping into some physics. Anything else that you want to say here before we call it with listeners?\nAustin: I’m just hopeful that more people get drawn to this space industry. I think it’s really an incredible industry to get to work in. We have lots of potential in front of us as an industry. We have a lot of passion in the industry. Here at Starfish, we’re starting to deliver in little bits for folks. That’s incredible.\nWe see the next opportunities opening up in front of us, and we’re not unique in that. I think that’s happening for companies and organizations throughout the industry. I’m excited for what the future holds. I hope that other folks are excited for what the future holds, too, and consider in their own way getting involved.\nBen: Awesome. Well listeners, we’ll see you next time."
}