{
  "url": "https://www.acquired.fm/episodes/the-mark-zuckerberg-interview",
  "title": "The Mark Zuckerberg Interview",
  "heading": "Fall 2024 - Special",
  "date": "September 18, 2024",
  "description": "Mark is the iconic founder CEO of our time. At Chase Center on September 10, 2024, he did an unprecedented thing: a live conversation in front of 6,000 people on Meta’s company strategy, sharing stories from early Facebook history, and his thoughts on the future of AI, VR, and AR. Mark was remarkably candid in our discussion, and gave us a window into his real and intense daily demeanor leading Meta. (And his other life endeavors!)\nWe can't wait to release the complete video of the whole night, including our surprise conversations with Daniel Ek, Emily Chang, and cameo appearances from Jensen Huang and Mike Taylor (the incredible singer of “Who Got the Truth?”). That’s coming in a couple weeks, but for now: enjoy this conversation with Mark Zuckerberg.\nPhoto Credit: Mark Zuckerberg by Jeff Sainlar / Meta",
  "transcript": "David: So how many interviews with Mark do you think you watched before tonight?\nBen: Oh to prepare?\nDavid: Yeah.\nBen: 30 to 40. The best ones are the '04 to ‘06 vintage, but they're all so different it's almost like every three to four years is a new era that is markedly different from all the previous eras.\nDavid: Totally, and I think we might have witnessed the beginning of a new era right in front of us on stage.\nBen: Oh, yes absolutely.\nDavid: All right. Should we do this?\nBen: Let's do it. Welcome to the Fall 2024 season of Acquired, the podcast about great companies and the stories and playbooks behind them. I'm Ben Gilbert.\nDavid: I'm David Rosenthal.\nBen: And we are your hosts. Listeners, we have something very special for you today. Our interview with Mark Zuckerberg from Acquired Live at Chase Center. Mark is the iconic founder-CEO of our time, and this conversation was just too good to hold on to any longer, so we are getting it out quickly before we release the full video of the entire show.\nDavid: Which, speaking of the full show, was utterly amazing. We had surprise appearances from Jensen Huang, Daniel Ek, Emily Chang and of course, we had the one and only Mike Taylor, the artist who sings ‘who got the truth’ performing live. It was incredible. We've got basically a whole film production that's now happening behind the scenes, with another 90 minutes of content beyond just this Mark interview. We should have that out in the next couple of weeks, so stay tuned for that.\nBen: First though, a huge thank you to our partners this season. You know our presenting partner, JP Morgan Payments.\nDavid: And we are also pumped to have two more great returning sponsors this season. Statsig, the world's first product acceleration platform that thousands of companies from OpenAI to Series A startups rely on to ship fast, learn more, and make smart decisions. You can find out more about them at statsig.com/acquired.\nBen: Sounds a lot like Meta, and Crusoe, which is the world's best climate-aligned AI cloud and data center operator that is leading the industrial buildout of AI. Find out more about them at crusoe.ai/acquired.\nAs always, come discuss this afterwards with us in the Slack, acquired.fm/slack. And if you want to be notified when every new episode drops, sign up at acquired.fm/email.\nDavid: All right, one more thing before the interview. We need to say a huge, huge thank you to the entire JP Morgan Payments team for securing the Chase Center for this, for orchestrating the entire evening. Our partnership this year has been absolutely incredible and gone way beyond what either of us ever could have imagined.\nBen: For those who don't know about JP Morgan Payments, they empower businesses to accept money, hold money, send money, protect money from fraud, and gain unique insights from money flows to help your company grow.\nDavid: And the payments business specifically, like most things at JP Morgan, is the largest and most trusted payments provider in the entire world. They move $10 trillion a day. That's almost 25% of all US dollar payment flows in the global economy. Pretty much every single company that we cover on Acquired works with JP Morgan payments in some way. You can never outgrow them. They partner with startups and small companies like us, like you would be, Ben, all the way up to the largest enterprises in the Fortune 500.\nBen: We've got more to share about their new payments products and technology this season, like the pay-by-face biometric payments that we saw live at Chase Center.\nDavid: That was super cool.\nBen: So that you can learn which may be the right fit to solve your payments challenges and grow your business.\nDavid: The other thing we got to say is Ben and I really worked side-by-side all year with their incredible team to make this evening happen, and we really got to know them—Max, Umar, Dustin, Hannah, Vinny, Nick, Amy, Carly and so many others. It's like we were one team. You guys rock.\nBen: For the first time, we actually got to experience what it would be like if Acquired was a large, world-class organization and not just our little team. What happened at Chase Center is really the physical embodiment of that.\nDavid: Thank you guys for being the best partners we could ever imagine, and a very special shout out to Dustin Sedgwick, JP Morgan Payments CMO, who's a longtime listener of the show and a good friend of ours, and he's just been the driving force behind all of this. Without him, Chase Center wouldn't have happened. We’re so grateful for an incredible relationship with you and all of JP Morgan.\nBen: Yup, so please enjoy our conversation with Mark Zuckerberg. To take us in, the chairman and CEO of JP Morgan Chase, Jamie Dimon.\nJamie: Hello Acquired listeners. Welcome to the Chase Center and to Acquired Live. I'm Jamie Dimon, chairman and CEO of JP Morgan Chase.  I'm happy to kick off the show tonight and welcome all of you to one of my favorite arenas.\nIt's been a great partnership all year between JP Morgan Payments and Acquired,  storytelling and educating about some of the greatest companies in the world. For many of them, just like many of you in the crowd, we're thrilled to call you friends and partners of the firm. Sorry I couldn't be there in person tonight, but I hope everyone enjoys the show. Ben and David, over to you.\nDavid: Mark, it's great to have you here.\nMark: It's great to be here. I was watching Jensen's video correcting the record, and I was thinking to myself we might need to book the next one of these for all the things I'm going to have to apologize for I'm going to say tonight. Nah, just kidding. I don't apologize anymore.\nBen: We've noticed.\nDavid: Well, okay. Wait. Here's the question. If you knew what you know today, would you have started Facebook?\nMark: Oh God, I mean, look. I think… yeah. No, I mean, he started it.\nDavid: Literally.\nMark: I think there's something to Jensen's original sentiment, which is that the entrepreneurial journey is very challenging, especially the early days when you're running a startup and there's the sense that what you're doing could just die at any moment and the volatility everything is just getting thrashed so much. You obviously look back and you have all these fond memories, but it was not the most fun part of the journey or the part of my life that I wish I could go back and relive.\nI do think that there's something to what Jensen was saying that I thought was very honest. When I heard him say it the first time I was like yeah, I get that. I think there are a lot of people for whom, if you knew how painful it would be along the way, you wouldn't get started. But then I think that that's one of the things that's good about human nature, is you can underestimate how painful things are going to be, so that way you can go and do good things.\nDavid: Well, on that topic, we have a lot to talk about. I think this is actually very appropriate. First, we have to ask you about your shirt and what you're wearing.\nMark: I started working with people to design some of my own clothes. So I figured we're going to design eyewear, we're going to design other stuff that people wear. Let's get good at this.\nThis one I actually worked with this great fashion designer, Mike Amiri, and he's got a great story, so I wouldn't be surprised if you're doing one of these with him one day. I've started working on this series of shirts with some of my favorite classical sayings on them. So this one is 'pathemathos,' learning through suffering. It's a little family saying, and also Aeschylus...\nDavid: Was that your family saying growing up or is that your family now?\nMark: No, its just something my sister said.\nBen: Well, no. Let's pull that thread. No pun intended, I promise. What does learning through suffering mean to you?\nMark: I think you learn what matters to you, what's important, and your place in the world through repeatedly hitting your head against different challenges. I think that that is the journey. That's the entrepreneurial journey. It's also, I think, part of the beauty of building things.\nBut this is something that Jensen talks a lot about too. I feel like when you go to start a company, everyone writes down what they would like their values to be. But values are not what you write down on the wall. It's like your lived behaviors. You only really learn what you care about when you have to make hard trade-offs and face challenges. So, yeah, you learn the most important things through facing challenges.\nDavid: Well, speaking of facing challenges, we want to talk about a number of those. We counted. By our count, I think you have faced more existential challenges than any meaningful company in history through your first 20 years.\nMark: It's a dubious distinction.\nBen: We will make our case to you of why and enumerate them.\nMark: I kind of think like that old Nike Michael Jordan ad where he's talking about how he's failed over and over and over again and that's how he succeeds. That one really resonates with me, too.\nDavid: Thanks to you guys, I got a pair of these this summer and I genuinely love them. Tell us the story of how these came to be.\nMark: Thanks, I'm excited about them, too. At Meta, we've been building social experiences for 20 years now. Originally, it took the form of a website, then mobile apps. But the thing is, I never thought about us as a social media company. We're not a social app company, we are a social connection company. We talk about what we're doing is building the future of human connection, and that's not only going to be constrained over time to what you can do on a phone, on a small screen.\nWhen we got started, we were like a handful of kids. We weren't able—we didn't have the resources at the time—to go define whatever the next computing platform is. Also, Facebook originally got started around the same time as a bunch of the early smartphones and those platforms got started. So we didn't really get to play any role in developing that platform.\nOne of the big themes for the next chapter of what we do is I want to be able to build what I think are the ideal experiences, not just what you're allowed to build on some platform that someone else built, but what is actually, if you can think from first principles, what is the ideal social experience. What you would like to have is not a phone that you look down at, that takes your attention away from the things and the people around you, not just a small screen.\nI think what you ideally have is glasses and through the glasses there's one part of it where the glasses can see what you see and they can hear what you hear, and in doing so they can be kind of the perfect AI assistant for you because they have context on what you're doing.\nBut then part of that is also that the glasses can project images, basically like holograms, out into the world, and that way your social experiences with other people aren't constrained to these little interactions you can have on a phone screen.\nIn the not-so-distant future, you can imagine because you guys have demo'd some of the stuff that we've done, a version of this where we're having a conversation like this, but maybe one of us isn't even here. They're just like a hologram and we have glasses. There's the question of delivering a realistic sense of presence.\nThere's something magical in the realm of building social experiences around the feeling of human presence and being there with another person and this physical perception where we're very physical beings.\nPeople like to intellectualize everything, but a lot of our experience is very physical. This physical sense of presence that you are with another person doing things in the physical world is something that you're going to be able to do through holograms, through glasses, without being taken away from whatever else you're doing. Just kind of have that mixed in with the rest of the world.\nIt's going to be, I think, the ultimate digital social experience. I think it's also going to be the ultimate incarnation of AI, because you're going to have conversations where it's like there are some people. Maybe I'm physically here, there's a person, you're a hologram there, there's an AI that is embodied as someone is there, and the glasses will enable this.\nHow are we going after this, building this? This is some huge project, we've been working on it for 10 years, and there are a lot of different challenges to solve to get there. You have to build a novel display stack.\nThese aren't just screens like the kind that are in phones. There's this long lineage. They're connected to the screens that have been in TVs and monitors and things for a long time. There's been this massive optimization of the supply chain. There's a brand new display stack around holographic displays that basically need to get created.\nThen they need to be put into glasses, they need to be miniaturized, and in the glasses, need to fit chips, microphones, speakers, cameras, eye tracking to be able to understand what you're doing, batteries to make it last all day.\nBen: Operate on new novel RF protocols.\nMark: Yeah, it's a pretty big challenge, so let's go try to go for the big thing. We've been working on that for a while, and we're pretty close to being able to show off the first prototype that we have of that, and I'm really excited about that.\nAt the same time, we also came at it from this lens of, all right. That's a lot of new technology that needs to get developed, a lot to pack into a form factor, because the glasses have to be good-looking too. What if we just constrain ourselves, like we're going to work with a great partner, EssilorLuxottica? They make Ray-Ban, they make a lot of the iconic glasses. Let's see what we can fit into glasses today and make them as useful as possible.\nActually, I thought when we were getting started with those that it was almost like a practice project for the ultimate AR.\nBen: Which, let's be clear, that's what you thought Facebook was.\nMark: That's true. Yeah, it did.\nBen: Like for your real startup someday.\nMark: Let's go on a tangent there for a second. I started Facebook in school, came out to Silicon Valley with Dustin and a handful of people working on it at the time, and we did that because Silicon Valley is where all the startups came from.\nI remember we got off the plane, we were driving down 101, we're like wow, eBay, Yahoo, this is amazing. There are all these great companies. One day, maybe we'll build a company like this. I'd already started Facebook and I was like surely the project that we're working on now is not a company.\nBen: And Facebook had some scale at this point.\nMark: Oh no, no. It was a great project. I just didn't have the ambition to turn it into a company at the time. That just kind of happened. But anyway, a lot of hard work obviously, but just at the time I don't think this is it.\nDavid: Well, that's your answer of would you have started? You actually didn't try to start Facebook.\nMark: I didn't know. The glasses, though, we thought we want to get working with EssilorLuxottica so we can start building more and more advanced glasses. They're really good. They look good. And then the massive transformation in AI.\nBen: For listeners, let's just be really clear. You guys shipped this product that I'm holding before LLMs, or at least before the public consciousness was aware of the ChatGPT moment, and these were not manufactured and shipped as an AI device. That came later when they were already in market.\nMark: A few years ago, I would have predicted that AR holograms would have been available before full-scale AI. Now, I think it's probably going to be the other order. Now it's like all right, great. Well, this is actually a great product because it's got the cameras so it can see what you see. It's got the microphone. It's got the speakers. You can talk to it.\nI remember calling Alex Himel, the guy who runs the product group, running into him and I'm like, hey, I think we should probably pivot this and make it so that Meta AI is the primary feature of it. Then I remember I came in the next week and they built a prototype of it on Tuesday. It was like all right, good, yeah, this is good, this is going to be a very successful product.\nDavid: He told us a much more high-stakes version of that story.\nBen: I was on the highway with my kids. I get this call on a Saturday from Mark and he's like, those glasses, could we put Meta AI in them running on device, and ship that soon so we can see if that's a good idea or not?\nMark: Yeah, that tracks. That's what I just said. Sounds right.\nBen: Okay, so thank you for opening up with a story. The question that I would like to try to answer tonight is why has Meta worked as spectacularly well as it has? One of the most valuable companies in the world through multiple iterations, multiple technology waves fighting off, maybe let's name all the waves in which people said, oh, Facebook and Meta are so screwed, and yet that is not the way it looks today.\nDavid: MySpace, Twitter Gen 1, Instagram, Snapchat, WhatsApp, TikTok.\nBen: Apple app tracking transparency.\nDavid: ATT, you could put in its own whole category, and now ChatGPT. That's nine.\nBen: There is a widely held public narrative every single time—Snapchat discover stories. There's something where people are like, oh, the cool thing that Facebook (the company) did is just obsolete now, and they're going to go away. You very much haven't gone away. What do you think is the through line of the DNA of the company that allows you to keep winning?\nMark: I think it's that we're a technology company that is focused on human connection, not a specific type of app. We never thought about ourselves as a website or a social network or anything like that. For me, building this kind of glasses to enable the future of people being able to feel present with another person no matter where they actually physically are, is the natural continuation of the kind of apps that we build today. But it depends on how you define what you are.\nThen you need to figure out well, how do you give yourself the competence to actually go do that? That's where I think being a strong technology company comes in, because a lot of companies think about themselves too narrowly in terms of, okay, well, we're this one thing, and the reason why we can build all these things is because we have a really strong technology foundation.\nSome of that is just me and how I think about stuff. I was an engineer before I got started. I mostly took systems engineering–type classes when I was in college. You talk about Friendster and MySpace and all the scaling challenges they had, doing the graph calculations of like all right. Do you know this person? Should you show them your page?\nBen: Friends of friends of friends.\nMark: Yeah.\nDavid: Actually, can you take us back and we want to ask you the story of that time. It seems quaint now, Friendster, Myspace, but you studied computer science, graph networking, social graphs. That is a very, very difficult computational calculation.\nMark: I think it's a combination of a product question and a technology question. I think you can define the product in such a general way that the technology becomes basically impossible to solve. You want to have a smart product definition, but then you want to be competent and better than everyone else at the technology.\nI think that that's something that we've held ourselves to and built a good organization around, and it's one of the things that I observed as soon as I came out to the Valley, that all these companies that called themselves technology companies were not really set up that way. The companies I was talking about, it's like the CEO wasn't technical, the board of directors had no one technical on it. They had one dude on the management team who was the head of engineering, who was technical, and everyone else wasn't. All right, if that's your team, then you're not a technology company.\nI think one of the things that I've always been pretty careful about is I actually want a lot of the people on our management team, it's like split mostly people running either these big product groups who come up through different technical pathways of the company, and I think that there's like a balance. You don't want everyone to be an engineer because there's other things that matter too. But if you don't have enough of your share of the company as engineers, then you're not a technology company.\nI think that that also is important to the board. I think just like in terms of how you weigh decisions and culturally, things inside the company matters a lot. But I think that's one of the things that has been really fundamental. We're able to go from platform to platform and do these different things because we've invested and cared about the underlying technology.\nThe product experiences that we build on top of that are an implementation and they matter. For that, I think we also are a pretty curious and learning-focused organization where I view the product strategy less as any one specific thing and more as how do we iterate and learn as quickly as possible how to make each thing better for the people we're trying to serve. I define our strategies. We can learn faster than every other company. We're going to win.\nWe're going to build a better product than everyone else because we're going to get it out first or early. We're going to have a good feedback loop. We're going to get a bunch of feedback. We're going to learn what people like better than other people. By the time you get to whether it's version three or four or five—they're not even discrete versions because you ship so frequently—you just learn faster.\nI think that's basically the formula. Be a technology company, build good foundation, learn from what people are focused on in the world, and just iterate as quickly as you can.\nBen: In one of my research calls to prep for this, someone described you as a master strategist, which we all acknowledge at this point.\nMark: Except for all the stuff that I just thought was not going to be that important, that ended up actually being the most important. Part of it is like okay, you want to set up the game so that way you optimize, you create your luck.\nDavid: This is what Jensen told us. The apple's going to fall from the tree in some direction, and if you just set up the game that you have a hand close enough to catch it.\nBen: The comment that someone made to me was the reason Mark is such a good strategist is because he plays the company as if it's a turn-based strategy gam. He just makes sure he gets more turns than anybody else, and he makes sure that he learns more from each turn than the next player does. Do you feel like that encapsulates Meta's product development?\nMark: I do like turn-based strategy.\nBen: But it does feel like the way that you make bets is like if we have great engineering, then that can take care of the speed part. That's many iterations or multiple at-bats and then the—\nMark: Well, great engineering and speed and iteration are actually two different values. They're not necessarily at odds, but I think there are a lot of great engineering organizations that try to build things that are super high quality and have good competence around that. But there's a certain personality that goes with taking your stuff and putting it out there before it's fully polished.\nI'm not saying that our strategy or approach on this is the only one that works. I think in a lot of ways we're the opposite of Apple and clearly their stuff has worked really well too. They take this approach, we're going to take a long time, we're going to polish it, we're going to put it out, and maybe for the stuff that they're doing that works, maybe that just fits with their culture.\nFor us, I think that there are a lot of conversations that we have internally where you're almost at the line of being embarrassed about what you put out, because you want to put stuff out early enough so you can get good feedback. You obviously want to test things that are reasonable hypotheses, so if it's so ineffective, then you're not testing a good hypothesis. That doesn't work.\nBut I do think a lot of the conversations that we have are like okay, well, we can get this to be a lot better if we work on it for another couple of months or whatever. I do just think that you want to really have a culture that values shipping, getting things out, and getting feedback more than needing always to get great positive accolades from people when you put stuff out. I think if you want to wait until you get praised all the time, you're missing a bunch of the time when you could have learned a bunch of useful stuff and then incorporated that into the next version you were going to ship.\nBen: And it's just about making sure what the thing that the company is known for or its brand can withstand all the little damage that you do to it by shipping stuff that's not quite ready.\nMark: I would like to hope that it's not damaging to the brand, but…\nBen: Innately, it is. When you're like oh, I feel bad because I shipped a product that wasn't good enough. you're sort of—\nMark: I don't want to overstate it. We don't ship things that we think are bad, but we also want to make sure that we're shipping things that are early enough that we can get good feedback to see what they're going to be most used for. Like I think a lot of the AI stuff that we're building now, for example, it's pretty clear that AI is going to be transformative for a lot of different things. It is actually less clear what are going to be the initial use cases for a lot of these things that are super valuable.\nPart of it is like okay, you put something out. You want to collect feedback and where it's resonating. Now, if what you put out is bad, then you're not going to collect good data because people aren't going to use it for anything because it sucks. But I do think that you have hypotheses for what people might really want to use it for, and they're not all going to be right and you want to go early enough on that as more.\nBen: I'm building to this question of, to you is product creation an act of invention or discovery? Like is David always inside that marble? And you just need the very best tooling and ability to get things in market and get feedback, to discover the statue of David:? Or do you conceive of David in your head and I'm like I'm going to make this and put it in the world?\nMark: Does it have to be one or the other? I think it's a combination. I think you're basically taking some kind of values, either values that you have or a value for something that you believe should exist in the world, and trying to build something that's aligned with that, while trying to match it up with what is going to resonate the most with people.\nI think if you just do the latter, then I think you just don't have enough conviction to see through hard things, and if you just do the former, then you probably don't get to product/market fit or optimize what you do because you're not focused enough on your customers. I think both probably matter. Yeah.\nBen: As I pour through all these historical examples, there's the market discovers. Some other participant in the market discovers the stories format, and suddenly the whole world is like oh my God, that's the social interaction mechanism. And that's like a pretty pure discovery where you have products that have stories. They perform very well. That's been discovered.\nBut there's other times it feels like everything you're trying to do in Reality Labs, all $50-plus billion that you've put into it, is like we're going to freaking will this thing into existence because I have an idea of the way that I want the world to be. I'm not really asking for that much feedback. I'm putting it in the world.\nMark: Well it's a combination. I mean, I think that there's certainly a lot of things that we've invented or created for the first time, I mean like in 2006, when we built the first version of News Feed. Before that, social networks were basically profiles and then we were like, hey, people actually kind of want to get the updates and let's show them that, and if we rank them, then we can. You know, there's so many updates that this can help people parse through that quickly, and today it's like hard to imagine any social product without a feed. So I think that that's obviously, there's some of these things are sort of seminal I don't want to call it an invention, but like patterns that we, that we basically established first, and then some of them are ones that other people did where we take pride in learning from what is working in the world.\nYou know, we're not embarrassed about learning from things that other people discovered that were good first, and then we build a better version of it and, um, I mean, I think that that's...you know, no one company is going to invent everything, right? I think if you don't invent anything, then it's hard to to kind of be a successful company.\nBut I do think that there's a mix of this. There are more smart people outside of your company than inside your company. If you're not learning from what's going on in the market, then you're missing a lot of opportunities to get valuable signal from people in the community and customers about what they want you to be doing.\nDavid: Which speaks to the thesis of Facebook as a technology company.\nBen: Meta.\nDavid: Meta is a technology company. We'll get to that later. Ben and I have been having a conversation. I want to take this to open source and open source technology and its importance to you, and Ben posited first to me and then to many other people in our calls over the last couple of weeks that Meta has been the largest 'Ben:eficiary' of open source technology in the modern world and I'm curious if you would agree with that and if you would comment on your relationship to open source.\nMark: I think almost all of the major technology companies at this point are primarily using open source stacks. So yeah, I mean, I don't know, we wouldn't have been able to get built without open source. I think probably that's true for any new company that's been created since, like I don't know, the late 1990s or something. For us, open source has been important and valuable.\nDavid: I mean, you were the first big company built on the LAMP stack.\nMark: Yeah, yeah, no, and it's great. It makes it super easy to develop stuff quickly and iterate quickly. But we've also had an interesting relationship with this because sequentially, as a company, we came after Google. Google was the first of the great companies that built this distributed computing infrastructure. So they came first. They were like, all right, let's keep this proprietary because it's a big advantage for us. And then we're like all right, we need that too, but we built it. And then we're like, ok, not an advantage for us because Google already has that, so we might as well just make it open. And by making it open, then you basically get this whole community of people building around it.\nSo it wasn't going to help us compete with Google for any of the stuff that we were doing to have that technology, but what we were able to do with things like Open Compute were, get it to become the industry standard. Now you have like all these other you know, cloud service platforms that you know basically use Open Compute and because of that, the supply chain is standard around, standardized around our designs, which means that it's way more supply, way cheaper to produce.\nWe've saved billions of dollars and the quality of the stuff that we get to use goes up. So all right, that's like a win-win. But I think, in order for this to work, we do a lot of open source stuff. We do a lot of closed source stuff. I'm not like a zealot on this. I think open source is very valuable, but I also think it sort of makes sense for us because of our position in the market, and the same for AI. I mean around Llama.\nDavid: Okay, this is where we were going with this.\nMark: Yeah, it's a similar deal. We want to make sure that we have access to a leading AI model, right, I think, just like we want to build the hardware so that we can build the best social experiences for the next 20 years. I don't think that for us, it's like we've just been through too much stuff with the other platforms to fully depend on anyone else, and we're a big enough company at this point that we don't have to.\nWe can build our own core technology platforms, whether that's going to be AR glasses or mixed reality or AI, so I think that's somewhat of an imperative for us to go do that. But these things are not like pieces of software that are monolithic. They're ecosystems. They get better when other people use them. For us, there's a huge amount of good and it philosophically lines up with where we are. We're like mean look, I definitely, firsthand have a lot of experiences. We were like trying to build stuff on mobile platforms. The platforms are just like no, you can't build that okay, uh that's frustrating.\nDavid: Can we take a real quick detour?\nMark: What's that? We can, we can, take a detour.\nDavid: Okay, you took a detour. We're going to take a detour. Help us with our research here, the eve of the IPO...\nMark: Yeah, this is quite a detour.\nBen: Wait, Did you just stop?\nDavid: I'm really grabbing the wheel here.\nBen: Is this connected, or did you just decide that it was your turn to talk?\nDavid: I'm sorry, I was really wound up.\nBen:  I know Open source and AI, we'll get back.\nDavid: I think it's related. I do, I really genuinely do Facebook on mobile is HTML5.\nBen: In 2012.\nDavid: Yeah, May 2012.\nMark: Yeah.\nDavid: Yeah, I want to ask you what you were thinking going into the IPO with Facebook on mobile being HTML5, and what happened to IPO at $100 billion market cap over the next three months. You have a 50% drawdown, probably because of that, but I guess the related question to what we're talking about now is how much is that informing your approach here with AI?\nMark: I think it was a pretty different technical issue. I mean, our legacy was building on web for websites and we were very used to building one thing and being able to continuously deploy it and it fits with our iteration style and all that. Now, all of a sudden, this app model comes along and it's like we have to build like different ones for each phone and like you have to go through approval to get it shipped and we have to wait like weeks before it can ship.\nIt's like this sucks. We're like, all right, we have an idea, let's build this platform where we can get a web-based platform. You basically build a native shell and you build this web-based platform in it and we'll be able to just update our apps every day and we'll ship one thing once and we'll update our apps across android and iPhone and Blackberry and Windows mobile and all the stuff that existed at the time because it hadn't gotten consolidated yet and, um, we're that's going to be that's. We're like, basically, whatever downside we are going to have from not having the most native thing, we're going to make up for in velocity and by having way more of our energy focused on one platform.\nWell, we were wrong. It turned out that you know, having the native integration was actually critical for having the interactions feel good and that so we basically went through this period where we had to go rewrite our apps from scratch. That coincided with mobile growing dramatically, and mobile we didn't have any revenue, because it may seem like it's pretty similar, but there's a very big difference. On desktop you basically have the app and you have a column on the side that we could put ads, and on mobile we needed to figure out what does it mean to put ads into the experience?\nBen: Let's be clear the 'feed ad' had not been invented yet.\nMark: Yeah, that was the thing that the team did. Yeah, and advertisers have specific formats that they like working with, and the idea that we were just going to be like, all right, now your ad is going to look like a feed story was a big challenge for advertisers.\nAnd the idea that now for people, you were going to have this organic feed that was the most important part of the product and now we're just going to start putting ads in it was a challenge for the people using the product. We needed to figure that out and we need to get the apps to be better, and we basically took I think it must have been like a year or something where we were just like look, we're going to pause feature development of the company because it's hard enough to do a rewrite.\nIf you look at the history of the tech industry, there are all these examples like Netscape and all these things that they tried to do a rewrite. They needed to reestablish their technical platform and they also tried to add features. They basically just never terminated. That's a real risk when you're completely changing your underlying platform, that you're going to miss it.\nIt's like, all right, we've got to minimize the chance that that happens. We’re not going to ship any new features, we're just going to rewrite it, make it faster. But while we're doing this, basically mobile's growing, so the percent of our traffic that is monetizable is shrinking, because web is basically shrinking and mobile's growing\nDavid: And that's your only business model.\nMark: Yeah, and I was like all right, like okay,\nBen: And you're now recently quarterly reporting, you know.\nMark: But the thing is, it was actually pretty clear what we needed to do. You know, I think strategically, a lot of the time it's somewhat harder to know what to do when you're winning. When stuff is going well, it's like what is the next move to go from winning to winning more. But when you're losing, it's usually pretty clear what you have to do and I think a lot of it is just do you have the pain tolerance to go do it?\nA lot of this was like all right, the team was like okay, well, we're going public and investors really aren't going to like this if we are not making money for a year and a half. And it's like, well, a year and a half is short in the grand scheme of things. Let's do this and we did it, and it was a painful year and a half. And then we came out of that and we were in great shape.\nI think people inside the company had felt a lot better sooner, because it was pretty clear to people that we were doing the right thing and they knew that we were executing in a responsible way and basically focused and we're doing the right thing. But I think it's actually when you have something that's working well and you're on one local hill and you need to jump to another hill, that's the stuff that's really culturally hard.\nBut this one, I think, was it was not fun. There have been a series of periods throughout the company that were not, I don't know, not the most fun periods, although that one in retrospect looks pretty good. In retrospect. It's not that bad. Your market cap only got cut in half for a year and a half. I'm like great, great, yeah, I'll take that. Anyway, where were we?\nBen: Maybe can I so, can I connect? So David asked hey, can you help with our research? Can I follow that thread that you just said? Hey, that one wasn't so bad. There's been a lot of amazing things the company has done. There's also been a lot of criticism. If you were to be self-critical, of your own company, of your own creation, of all the criticisms that have happened over the years, which do you believe is the most legitimate, and why?\nMark: I mean, there's so many things that we've messed up that there are many criticisms that are legitimate, but if that was a year and a half mistake, I think, you know, one of the things I reflect on over the last like 10 years or so was, you know, the political environment just changed dramatically, right? It's like before 2016, there was not a month that went by, except for maybe this IPO period, where the sentiment about the company was anything but positive.\nAnd then after 2016, after the election, basically there was not a month for a while where the sentiment about the company was positive. And I think so much of this stuff is correctly understanding your place in the world and in history, and I think we talked about before how it's like. I think we understood that we are a technology company and that you have to be a technology company to build this kind of thing. I think we understood that we're not a social network company, we're a human connection company and that will take different forms over time.\nThe political environment I think I didn't have much sophistication around and I think I just fundamentally misdiagnosed the problem. That there was this basic challenge and there were a lot of things I don't want to simplify this too much. I mean, there were a lot of things that we did wrong. There were some things that we did right, but I think one of the things that I look back on regret is, we accepted other people's view of some of the things that they were asserting that we were doing wrong or were responsible for.\nI don't actually think we were, and there were a lot of things we did mess up and we needed to fix up and we needed to fix. But that there's this view where, when you're a company and someone says that there's an issue, I think the right instinct is to take ownership for it, say okay, maybe it's not all our thing, but we're going to fully own this problem, we're going to take responsibility for it, we're going to fix it.\nBut when it's a political problem, I actually think, a lot of the time sometimes there are people who are operating in good faith, who are identifying a problem that wants something to be fixed, and there are people who are just looking for someone to blame. And I think, to some degree, if you take responsibility for things because you think it's a corporate crisis, not a political crisis, and your view is like, okay, I'm going to take responsibility for all this stuff. People are basically blaming social media and the tech industry for all these different things in society.\nIf we're saying, okay, we're going to really do our part to go fix this stuff, I know there were a bunch of people who just took that and were like, oh, you're taking responsibility for that, let me kick you for more stuff. And honestly,  we should have been firmer and clearer about which of the things we actually felt like we had a part in and which ones we didn't.\nAnd my guess is, if the IPO was a year and a half mistake, I think that the political miscalculation was a 20-year mistake and it started in 2016. And that we have been working super hard to fix a lot of issues and to figure out, kind of what the right tone is for navigating what is a very kind of fraught political dynamic across both the country and multiplied across all these places around the world.\nI think we've sort of found our footing on what the principles are, where we think we need to improve stuff, but where people make allegations about the impact of the tech industry or our company which are just not founded in any fact that I think we should push back on harder. I think it's going to take another 10 years or so for us to fully work through that cycle before our brand and all of that is back to the place that it maybe could have been if I hadn't messed that up in the first place.\nBut look, in the grand scheme of things, 20 years isn't that bad either and we'll get through it and we'll come out stronger. But I do think that is one of the kind of more interesting critiques that I think people get, and we get critiques on both sides on that. There are people who don't think we've taken enough responsibility, but certainly there's one line of critique, which is, you know, you kind of bought into too much of the stuff that you shouldn't have and, yeah, it's going to take us a long time to dig out of that.\nBen: Do you have a reasonable framework at this point for like okay, here's the stuff where I feel like we actually do want to take responsibility for it and here's the stuff where like, no, that's not our fault.\nMark: Yeah, I mean, at this point, I think a lot of this stuff has been studied. I mean, I think a lot of this stuff has been studied. I don't want to go rehash all the different things, but I think at this point, there's been years of academic research on a lot of these things. Part of the thing that's challenging, and one of the things that we've learned, is we actually should be trying to support more academics and doing more of this research ahead of time.\nBecause when you get to a point where you're being accused of something, you're not super credible, just standing up yourself and being like I don't think we did this one. You know it's like so, but what has worked over time is you know you do the research in advance and you get kind of third party academics, respected folks, who get to debate all these different issues, and then it's like oh no, actually like the evidence just does not show that social media is correlated with this kind of harm at all. So I think that it kind of cuts both ways.\nDavid: To me, this brings up another topic we wanted to talk about with you and you, just you know, 20 years isn't that long.\nMark: I'm young.\nDavid: You're young, we all are.\nBen: This is the advantage of being a college dropout founder with one company.\nMark: Yeah, it is. When you start, when you're 19, it's like, hopefully we have more than 20 years left to do this\nBen: And hopefully you have like 'Buffett' duration.\nMark: Yeah, I don't know, Maybe, hopefully.\nDavid: You set up the company in a, especially at the time, truly unique way where you can operate the company and take that approach.\nBen: Do you mean super voting shares?\nDavid: Super voting shares is like the technical aspect. I think there are a bunch of technical aspects to it that we're not going to get into in this conversation, but effectively you can take that perspective in a way that if you are a CEO, non-founder, without a structure that you've set up, you just can't.\nAnd I think you know in doing all the research for this, a thesis we've developed is that, like that, is just one of the core fundamental advantages that Meta has. So as you were setting up the company, you know when you were so young, even when you went public, you were so young, why was that so important to you?\nMark: In 2006, Yahoo wanted to buy the company for a billion dollars and everyone on our management team wanted to sell it and the board tried to fire me and basically in the next year, everyone else on the management team left because I hadn't done a good job communicating. I don't want to blame them. I hadn't done a good job communicating the long-term vision because I didn't, I wasn't thinking about that at the time.\nI, like, wasn't thinking in terms of this as a company. I was like this is a great project, it's awesome, like a lot of people, like what we're doing. I think this will probably continue for a while. I think it's going to be pretty important in the world. But I didn't know how to think in terms of long-term financial plans\nBen: Or make the case to them why it would be worth more than a billion.\nMark: Yeah, or just look, we're doing this for the long term. We're not planning on selling the company. So it's like, without having made that case, it was understandable that basically, Yahoo comes around, a lot of people. It's like this is like all their startup dreams come true. You've got to take this offer, because I just wasn't in a place where I had the sophistication to basically articulate a lot of the stuff around where we were going longer term.\nIt probably wasn't super confidence-inspiring to them when I was like, \"hey, I think we should turn this down because we're going to do this”. After that I was like, all right, well, I don't want to get fired from my own company for wanting to build it, so let's uh, try to set up a governance structure that makes it somewhat harder to do that. Um, so wow - \"learning through suffering!\"\nBen: Wow, and being very cash-generative very early, such that you had a very real-going concern on your hands and you just didn't need to cut off your arm and sell it to someone in order to build your business.\nMark: Yeah,\nBen: I think this is a fundamentally misunderstood thing about 'Facebook the startup' - it is the prototypical startup.\nDavid: You are the iconic startup founder\nBen: Of this century, there's a lot of people that want to start a startup for a lot of the glamorous reasons of starting a startup. You hated being a startup and wanted to stop being a startup as fast as possible and be a like going concern\nMark: Yeah, I mean I think we're having a lot more fun now. I get to work on all the stuff? It's awesome!\nBen:  But what is your advice to all these founders who sort of romanticize the idea of starting a company and kind of.\nMark: I don't know, obviously starting a company is not bad, right? I mean, I think that there's different schools of thought on how to do it. I think some people think, okay, I want to go start a company, so I'm going to like go dive into this idea, and I just think that that's a little bit dangerous.\nBecause there's this issue which is you have to be able to be nimble and pivot around until you can figure out what works right. I mean, part of the reason why I didn't think Facebook was going to be the company early on was because when I was in school, I built 12 different things that were just things that I wanted to exist. I was like, all right, this is fun. Okay, let's build another thing. It's like, okay, this one's fun, people are still using that. I'll help upkeep this one.\nBut I had a bunch of other ideas for stuff I was going to build too, I didn't know how to think about what a company was going to be. I think there's something about maintaining flexibility that's helpful. Once you hire a bunch of people, it's a lot easier when you can just have meetings in your own head about what direction you want to go in, and there's a lot less pride and people dug in when you're just like, okay, I'm going to change direction.\nPeople haven't invested their ego in like no, we were going in this direction and now I must be convinced it's like nah. I do think that that's a thing where you want to keep things lean and be able to do that, and that's one of the reasons why we tried to get the company back to being whatever.\nThe leanest version of a large company is that we can be. But I do think that there's something to that where it's like it's obviously it's not super fun not having the resources to do what you want to do. But I think it also is problematic to have more people working on something than you should have for the stage that it's at, because then the people who are working on it don't have the agency to actually make the changes and do the things that they need to, which is less fun, and then you can't attract the best people to go work on those things because it's less fun, and so I do think you just have to dial it right.\nBen: You're spending a gajillion dollars on Reality Labs.\nMark: It's a technical term...\nBen: It's not making that much money. I'm gonna play Mark back to you, sure of it's not appropriate to have all these people and resources working on things for more than the stage warrants. I'm being a little facetious here, but I'm curious how you, why you categorize it differently?\nMark: I mean, well, I think some of the stuff, by the time you're at the scale that we're at, is also just about like, what do you want to do over the next 10 to 20 years and what do you think are going to be important? And you know we were talking about making your own luck and all that and how you know it's like I think there are some broad strokes that we can have a sense of where things are going.\nI'm pretty sure glasses and holographic presence and AR is going to be a completely ubiquitous product, right, it's just like everyone who had a phone before replaced it with a smartphone and then a lot of more people got smartphones. If all we get is all the people in the world who already have glasses upgrading to glasses that have AI in them, then this is already going to be one of the most successful products in the history of the world, and I think it's going to go a lot further than that. So I know there's that.\nThere is the thing about controlling our own destiny. It's strategically valuable. You know we did this calculation or estimate at some point where it's like how much money do we lose from our core family of apps to the various taxes that the platforms have to like, when they tell us we can't run the ad business the way that we think we should be able to.\nWhen they tell us we can't ship certain products, that way people use the things less or like them less, and it's hard to exactly estimate it. But I think we might be twice as profitable if we own the platform or something. I think from that perspective that's worth a lot, just from a pure dollars perspective, which is not primarily how I come at this stuff. But even now I've learned a thing actually since the Yahoo days. So now I at least am able to.\nI might not be able to convince all the investors that we should be investing to the extent that we are in Reality Labs if I didn't control the company, but at least I can sort of articulate a case for why I am confident that it's going to be good over time.\nBut for me it's always been way more about the product experience and what you can enable and build. And you know, one of the shifts and this is sort of like a values shift over time is, you know, one of the things that some of the early Oculus guys used to say to me that 'there's a difference between building good things and awesome things'. And good is good, right, it's helpful. It's useful.\nIt's things that people use on a day-to-day basis because it adds something to their lives. But 'awesome' is different. Awesome is uplifting and inspiring and just leads you to just be way more optimistic about the future, and it's just like this uplifting thing about humanity. And so I think a lot of what we've done with social media so far is very good. We've built these products. More than 3 billion people use them on a near daily basis.\nBen: It's like 3.3 billion on a daily basis.\nMark: Yeah, and they use it because it is useful in their life and in all these different ways. I mean obviously people vary, people use it for different things, but it is useful in their life, right, and in all these different ways. I mean obviously people vary, people use it for different things, but it's useful and it helps people.\nAnd it helps people stay connected, helps people build businesses, it helps people form communities. It's good there aren't that many people on a day-to-day basis who get out of bed and are like, fuck yeah, social media, like it's like that's right, right I mean that's not like.\nSo I kind of think for the next, for my next stage, right for the next stage of the company, the next like 15 years, I want us to build more things that are awesome in addition to things that are good, and I think that they both matter. But to me, this is like a little bit of a kind of the next stage of what I want our company to stand for and be, and so I think a lot of the Reality Lab stuff that we're doing is going to be in that bucket.\nA lot of the AI stuff that we're doing, I think, is going to be in that bucket. There are a bunch of things in the apps that are going to be in that bucket too, new apps too, but I don't know. I think that there's just something that's fundamentally pretty good about that, and maybe it's also just where I am in my life. I like to think I'm young, I'm a little older, but I do think that at this point it's.\nBut it's like I. I do think that at this point, you know, it's not just a Meta thing. Also, you know, in my personal life, a lot of what I personally value is doing things that are inspiring with people who I find inspiring. All right, and you know. So there's the personal version of this. It's like I get to work on, you know, interesting science problems with Priscilla and my wife and a bunch of awesome people. I get to design shirts with some of the best fashion designers in the world. It's like I am..\nBen: Statues.\nMark: Sculpture of my wife. Bring back the Roman tradition of designing sculptures of people you love.\nBen: I'm not at all being facetious. It's really cool.\nMark: I think Daniel Arsham is a really talented guy. I was like that's a person who I'd love to work with on something. Let's go find a project. One of my side projects is we have this cattle ranch in Kauai and I'm trying to see if we can raise the highest quality beef in the world. And there's like all this stuff it starts with like it's awesome, we got this steer - chonk. He's like he's just the man. He's the man.\nWe're having a hard time keeping him on the ranch because every time we put him in a steel enclosure and he sees a female cow, he busts through the steel enclosure. But I feel like that's the kind of bull that you want to make the highest quality beef in the world. We're just working with you know, trying to do really high-quality, awesome things with awesome people. If that's what I get to do for the next 15 or 20 years, then it's going to be a good 15 or 20 years.\nBen: Was there a moment like what changed? When did this become your priority and why? It feels so radical that how could it have possibly been gradual? Or was this just like Mark all the time and we just couldn't see the real Mark?\nMark: I don't know. I think that there might've been something around the way the company shifted in operations around COVID. I mean, it's like the COVID,  all these tech companies went remote temporarily and it was an interesting period to just get some more time, like a step back. I'm a pretty introverted person and I do think it's ...I need to be careful where, I get a lot of value and energy and ideas from being around other people, but I also need time with myself.\nWith COVID, I kind of got that and it was a time of reflection, where I was able to think about this stuff and we were also going through this very difficult political time in the country and our company was at the center of a lot of those things. So that was a cause of a bunch of reflection. And then I think that a bunch of the things that we'd spun up earlier, but at smaller scale so the Reality Lab stuff that we started in 2014, really the FAIR stuff around, you know, 'Fundamental AI Research'\nBen: yeah 2012, 13?\nMark: 2012, 13, sometime around then. These things they kind of got started and they were growing and it kind of reached this moment which is like are we going to double down on this and do this? Or are we going to kind of do this as a hobby? And I was like no, I think we should do this. I mean, this is going to be a really important part of what we do and we had to make a really important set of decisions.\nWhat we knew was going to be really painful, you know, to go double down on those things and build out the AI infrastructure that we needed to and scale up some of the Reality Lab stuff and I knew that a lot of the investors would hate it, at least in the short term before it's clearly the right thing to do. What I didn't know was that at the time, I thought they were going to not like it, but I thought it was going to be okay because I didn't think there was also going to be a recession at the same time.\nThat really, it's like I mean, look, you learn who you are through challenges. It's like okay, losing half of your market cap is 'quaint' compared to losing 80% of your market cap or whatever it was. I mean these are all intentional decisions. It's like there are a lot of conversations that we had which are like, should we go forward with this?\nThe answer that I came out with is yes. This is what I believe in. I think this is going to be important for the world. I think it's going to work over time. We're no stranger to going through painful periods. In some ways, it makes the company better. Let's do it!\nBen: We're starting to enter, looking at the clock, like 'conclusion lightning round' territory. I've had one lurking in the back of my head. It makes sense to me that you would rebrand the company, something that is not Facebook, given how broad the family of apps was that you've got. Let's imagine you were going to rebrand it today. You've got AI going on, you've got AR going on, you've got VR going on. Would you pick the name Meta if you were going to rename the company today?\nMark: I like Meta. It's a good name, you know, finding good short names...this actually was a thing that we talked about for a while because it was pretty clear that Facebook is continuing to grow in importance in the world, which I think a lot of people don't appreciate and it's kind of mind-boggling at the scale that it's at.\nBut the others, we went through a period where we had Facebook and a handful of small apps and now we have four apps that have a billion people or more using them. You know, hopefully in the next few years, five with Threads, if that continues scaling. And this was a conversation that we had a bunch - where it's like does it make sense for the name of the company to be one of the apps as the other apps, as it's really becoming a family of apps.\nAnd it was important to me this was also coinciding with a lot of the challenges that we were having, the political brand challenges, different things and a lot of people were proposing that from the perspective of running away from the Facebook brand. Right, they were like oh well, like does the Facebook brand have issues? Do we need a new brand? And I was like we don't run away from that, right, it's like it might make sense one day to not have Facebook be the lead brand for the company, because we do so many different things.\nBut I'm only going to do this when we come up with a brand that is going to be evocative of the future that we're trying to build, because we run towards something, we don't run away from things. And when we got to Meta, then I was like all right, we're here. And it was around the time when we were doubling down on the investment and where there was all the controversy and it's like look, if we're doing this, we're going to lean into this and we're going to do it. So let's do it.\nBen: And if I were to make the case to you, I feel the core competency of Meta is you are able to discover products in the world. You have great ideas, you work on them. You discover interesting products and you, Mark, are not someone who wants to define yourself by anything. You want to have your hands on a bunch of great controls and maximize your degrees of freedom, see where the world's going and then have the best freaking spaceship possible to go maneuver your way over there.\nIt seems like I would pick a brand that almost doesn't pigeonhole me into a specific future. I might be looking for something that's more like look, I want to maximize my maneuverability.\nMark: Yeah, I get it, but I don't know. We aligned around a vision and a mission of what we're trying to do and we run towards it. That's always been how we've operated.\nBen: Yeah, and in many ways doing what I just suggested would kind of be running. It's like, well, we don't believe in it that much, and you're like, no, we don't believe in it.\nMark: Yeah, no, I mean, we're a company that puts a flag down around what we're doing and we're going to go do it. It's like put a wall in front of us, there’s going to be a mark-shaped hole.\nDavid: Speaking of lightning rounds and mark-shaped holes, you are accelerating what used to be your annual challenges. I mean when we were all kids and we didn't know each other, I was so inspired you would do your annual challenges, you would post about them and I was like, wow, that's pretty damn cool.\nAnd then we all get a little older and we all have kids on the stage now and we all have companies on the stage now and there's some large, some small, the demands on your time like it. For me especially, I think lots of people that's like that space gets sucked and you have expanded it. How?\nMark: What do you mean?\nDavid: Well, you used to do annual challenges and I feel like you're now doing weekly challenges. You're designing t-shirts. You're making sculptures, you're raising cattle... I feel like you have a weekly challenge.\nMark: I'm trying to do inspiring things. I'm also really competitive.\nDavid: Who's your competition for this?\nMark: What do you mean? I was just thinking about other things that I'm doing. I'm like what have I started doing? I got into all these more extreme sports and fighting and stuff. I mean we face a lot of competition and a lot of different aspects of what we do. I mean there's the social media competitors, there's the platform competitors.\nI think Apple is a bigger competitor than people realize. They kind of think, hey, they're doing a different type of thing, but I don't know. I think over the next 10, 15 years, that kind of battle over, ideological battle over, what should the architecture be of the next set of platforms? Are they going to be the closed, integrated Apple model that Apple has always done, which again I mean like there's multiple, there are multiple good ways to build things.\nIf you look at the different generations of computing, PCs, mobile, they've all had sort of a closed, integrated version and an open version. And the thing that I think there's just a ton of 'recency bias' around is because iPhone basically won. I know that there are more Android phones out there, but iPhone is sort of like the intellectual leader and by far has all the rights.\nDavid: Let's take it as a conceit.\nMark: I think that there's the recency bias, and probably almost everyone here has an iPhone and I think that because of the recency bias, there's sort of this view that's like, oh no, this is just the superior way to do things, but I don't actually think that's a given.\nIn the PC era, windows, with the open ecosystem, was the leader, and part of my goal for the next 10, 15 years the next generation of platforms is to build the next generation of open platforms and have the open platforms win, and I think that that's going to lead to a much more vibrant tech industry. Now there are advantages of doing a closed and integrated model. I think Apple will have a place for sure.\nI expect them to be our primary competitor and I think it will not be just a product competition. I think it's like a in some ways, very deeply values-driven and ideological competition around what the future of the tech industry should be and how open these platforms whether it's things like Llama and AI or the glasses or different things should be for developers, like an individual, someone getting started in their dorm room like me to not have to ask for permission to go build the next set of awesome things.\nBen: I've got a closing question here.\nMark: Please. Thank you.\nBen: We have a lot of builders in the audience tonight, a lot of founders. We're in probably the most interesting technology environment since the early mobile days in terms of opportunity. It's been 20 years. You might have to go back a little bit, but what advice do you have for founders today on something that's different than trying to 'pattern-match' Mark Zuckerberg from 2004, given we live in a different world today?\nMark: I mean just do something that you care about. If you're trying to run our strategy, try to learn as quickly as you can. But I mean if there's like, I think part of what I'm trying to say is, I think there are different ways to build stuff right? It's like our way worked for me and our team. Different things have clearly worked for other companies, I don't know.\nOne day my daughter, we took her to a Taylor Swift concert and she was like you know, Dad, I kind of want to be like Taylor Swift when I grow up. I was like you can't, that's not available to you. She thought about it and she's like all right, when I grow up, I want people to want to be like August Chan Zuckerberg. And I was like hell yeah. Hell yeah. I think it's like look, learn from other people's successes and failures, but do your own thing.\nDavid: I love that. Love that. Well, that is the perfect place to leave things.\nBen: We made you something that you already have a very amazing, well-designed shirt. I hope you have room in your life for more than one.\nMark: I do. I used to only wear one type of shirt. Now I've moved on.\nBen: So, David and I made you a custom one-of-one shirt that represents tonight.\nMark: Thank you.\nBen: It is size Zuck, so no one else can you know. It can never be made again. And we've got these coordinates on the back, the first one.\nDavid: GPS coordinates.\nBen: GPS coordinates. The first one represents Kirkland House, where you wrote the first line of code for Facebook, and the second one is the Chase Center. Awesome, so thank you for joining us here tonight.\nDavid: Thank you for joining us.\nBen: Wow.\nDavid: What a night\nBen: Absolutely crazy. I mean, Mark has done many interviews this year, both with other podcasts and in traditional press, but that felt different If for no other reason than it happened, live in front of a 6,000 person audience in an arena. But I wasn't expecting it to feel that different.\nDavid: Yeah, I mean, it was, I think, the wildest experience of my life being up there. I don't even know what else could compare.\nBen: Pretty insane. Well, listeners, as you may have noticed, thanks to our sponsors, this conversation was uninterrupted and we do want to reflect a little bit and share some of our thoughts and our...you know how we're feeling looking back on this conversation with you. But first we do want to share a word on Statsig and Crusoe.\nDavid: Statsig. Mark's most famous catchphrase is probably 'move fast and break things'. But, like we talked about with him, despite instilling this in Facebook's engineering culture, Facebook doesn't actually break very often. How?\nBen: Certainly not anymore and really, relative to its peers, not even throughout its past. Yeah, Facebook invested hundreds of thousands of engineering hours in a set of internal tools. These tools let any engineer set up new metrics, ship new features and measure performance in real time. That means anyone could just ship a new feature, but they always had metrics to use as guardrails and they could always roll back a feature if anything broke.\nDavid: Oh man, there are legendary stories of engineers shipping features like in their first week at bootcamp as interns or new hires at Facebook and Meta over the years, and you might wish that you could do the same on your team and build products like they build products at Facebook. Ship fast, make database decisions, iterate rapidly, but you need the right tools, so you're stuck right.\nBen: Well enter Statsig. Statsig has built the world's first product acceleration platform, combining tools like feature flags, product analytics, experimentation and observability all in one place, helping you move faster and make smarter decisions.\nDavid: Even better, Statsig was literally founded by an ex-Meta team who wanted to help everyone build like the best and bring these same tools to the market. Today, many of the world's leading tech companies rely on Statsig, including OpenAI, Microsoft Notion, Anthropic, Figma, plus thousands of early stage startups.\nBen: David, every time we work with Statsig, this list gets more and more impressive. Like now it is purely, you know, A-list companies.\nDavid: It's awesome. So if you're ready to accelerate your growth and democratize product building at your company, go to statsig.com/acquired and when you get in touch, just tell them that Ben and David sent you.\nBen: Thanks, Statsig.\nDavid: Now for Crusoe. Crusoe is a climate-aligned cloud platform built specifically for AI workloads and powered by clean energy. They build and operate GPU data centers powered by low-cost stranded energy that otherwise goes to waste or, worse, gets emitted as greenhouse gasses.\nBen: It's crazy. When Acquired first started working with Crusoe, this was a cool idea. Now they're like one of the most important companies in the world, with an AI cloud that's superior to the hyperscalers and a whole bunch of the largest companies in the world trusting their AI infrastructure to them.\nDavid: Yeah, it's easy to think about AI as like oh, that's a bunch of PhDs at Meta or OpenAI or Anthropic or whatever you know, tinkering with model weights in their office and hitting compute. But there's this whole other industrial side of AI. That's everything that happens after you press go on the model training and that's energy, cooling, construction, all the physical infrastructure behind AI.\nBen: And Crusoe is powering that by producing or repurposing huge amounts of power. We are talking gigawatts in their development pipeline, which is 'nuclear reactor' amounts of power for less cost than other providers and with zero or in some cases, actually negative emissions. It's super important. If you listen to Zuck and others talk about what the bottleneck to AI progress is, it's actually not compute, but energy and Crusoe is solving that problem.\nDavid: It's just an awesome company. We are super proud to work with them and to be investors in the company. You can work with Crusoe either through their managed AI cloud, which is great for startups and enterprises who want a complete end-to-end platform for AI, or directly as a data center customer, which several of the largest companies in the world are now doing. So, just going over to crusoe.ai/acquired that's C-R-U-S-O-E dot A-I slash acquired or click the link in the show notes and tell them that Ben and David sent you.\nBen: Okay. David, reflections on this conversation, the biggest thing that I kept thinking going into the night, as we're talking with Mark, as we're talking with his team, you know, people kept saying we don't really do this, Mark doesn't really do this. And I kept thinking, yeah, he kind of does, because he's done all these podcasts this year and...\nDavid: He does Facebook Meta Connect like he's done, big events before, of course.\nBen: Right, and he does a good number of in-person press interviews too. It's not like he doesn't talk to the traditional press, even though that has kind of become a narrative. It's not really true. However, Mark has not done an external several thousand person live thing like this. This is a very unusual format and kind of an uncomfortable one even for you and I, like we're so used to stopping starting being thoughtful in our answers and like this is a show - you're performing. There are no breaks,\nDavid: There's no retakes, yeah\nBen: Right, but Mark and like all the Meta execs really embraced it. A bunch of the executive team came like they took off this whole day and actually some stuff we did the night before too.\nDavid: A bunch of the board members were there. A lot of people important to Mark were there.\nBen: His family came.\nDavid: They made it an event,\nBen: Right. I thought this was a big deal for us. I was kind of shocked to the degree that Mark also thought it was a big deal for him,\nDavid: Which is super cool. Totally agree.\nBen: That's one. I was also surprised and delighted that he was willing to dive into history with us.\nDavid: Yes, we totally did not expect that. He's usually so maniacally focused on the future and in our conversations to prep with him before the event, he was like, I think of you guys as a history podcast, you know, let's talk about the future. I'm like okay, okay, but we want to ground it in history. And he showed up and was totally ready to go back and I think that made the talking about the present and the future even better.\nBen: Totally, because you could create these through lines. I mean, as funny as your interjection on let's go back to the IPO moment, was it opened up the door to have these comparative moments too, is what Meta doing today, is that similar to something that you've done over and over? Should we be watching for a pattern here, or are you very different today than you were historically? The way that he was talking about that stuff on stage felt very authentic, and I just haven't heard him speak in that way before, at least publicly.\nDavid: I think it was also a great way to let us all get a window into his psyche, which kind of brings us to another point, which is like he is still in it. Oh, what other founders of companies like that? I mean there's Jensen, who else? You know, it's the two of them.\nBen: Yeah, I think the casual observer to Meta might observe, like you know, Mark's been running it for 20 years and most of the time these founders kind of like go and do something else. They become executive chairman or they like stepped into a board role or they own 4% of the companies. There's some pattern there and for Mark I think it was plain as day on stage.\nHe is more in it than ever and I don't think he thinks he's like halfway through his journey, like I don't think he's 20 years in. At 40, I'll be done. I don't get that sense either. I think Meta is his vehicle by which he wants to live his entire life and he wants to make things with this group of people that he wants to make, period, and that is kind of the product strategy.\nDavid: I got chills when he said the 20-year mistake, and then I got even more chills when he said but 20 years actually isn't that long.\nBen: Yeah, that's a pretty illustrative comment. Totally, I was appreciative that he engaged with us on the 'be critical of the company', because, honestly, I was asking that as research for when we inevitably do our Meta episode. I think he gave us a regret, not a criticism, but we were live on stage in front of 6,000 people and it's not really the right format for that.\nDavid: Yep totally.\nBen: That said obviously a very interesting answer.\nDavid: I think related though back to the, 'he's still in it' - in some sense Reality Labs you could look at like his blue origin.\nBen: A hundred percent.\nDavid: It's just within Meta.\nBen: I'm glad you caught this too. Other big tech CEO founders have their moment running the company, they take a board role. They go do another thing and oftentimes it's big and important for the world and capital intensive and Mark is doing that -but inside Meta, with Reality Labs.I think it'll be super fascinating 20 to 50 years from now to reflect back and say what were the unintended or perhaps intended outcomes of co-mingling multiple huge swings under one corporate umbrella versus having people who are either CEO of multiple companies concurrently or, you know, step down from one to run the other.\nFor Mark, I kind of feel like, again, Meta is his vehicle for executing the things that he thinks are awesome products, and of course, it's not just awesome products but like things that could let him have more control over his universe. He's clearly a guy who values having a lot of degrees of freedom and doesn't like being boxed in.\nDavid: I loved your turn-based strategy game of get more turns. Learn more on each turn. Oh man, Starcraft Pro Player 101 there.\nBen: Yes, but it'll be interesting to see the knock-on effects of having Reality Labs in the Meta organization versus as a new venture.\nDavid: Totally. All of that brings me to frankly, just my biggest overwhelming takeaway from the whole experience, which is, Ben:, you've developed a really great research interview question that you use on all the sources that we talk to now, which is you ask, \"what is the one thing that is most misunderstood about this company, this organization, etc”.\nAnd everybody at Meta for years always would say Mark and I never totally got it until this evening. He's both a singular individual himself. But it's not just that, it's that a true superpower of the company is that it is architected from top to bottom legally, financially, organizationally,\nBen: Culturally...\nDavid: Culturally to reflect and amplify his immense strength.\nBen: Which I think is probably true of, like Apple, Steve Jobs, Bill Gates, Microsoft, NVIDIA, Jensen. Yes, but we are right up close to the ways in which Meta is a sort of an amplifier, almost like it's a way for you to take the gain on Mark's output and turn it up, you know, 10,000x.\nDavid: Yes, and I think what was so striking about it to me versus you're absolutely right all those other companies. It is generally accepted in the public narrative about Apple under Steve Jobs, about NVIDIA under Jensen, that that is the case. I don't think it is about Meta and Mark. I don't think people understand that. I didn't understand that until this experience.\nBen: Are you saying Meta is still very much a Mark Zuckerberg production? I'll see myself out.\nDavid: Well put, there we go.\nBen: Well listeners, thank you so much for joining us on this journey. Come talk about it with us in the Slack acquired.fm/slack. We'd love to hear all of your thoughts as well. Join our email list acquired.fm/email. That will let you basically know every single time a new episode drops or when we are doing something like Chase Center again, to be the first to know about that. God, if we ever do something like that again.\nWe've got a merch store. Check it out. On acquired.fm. We've got ACQ2, our second show, where we are always interviewing earlier stage companies than Meta, but where we think there are great insightful conversations with founders and CEOs. And, David, I know you've got some thank yous.\nDavid: One last thing, final thank yous. Thank you to Mark, thank you to basically the entire Meta executive team who helped with the evening. Thank you to Hermes for dressing us, which was my favorite Easter egg of the night.\nBen: Yes, so fun. Thank you to Jamie Dimon, JP Morgan Chase, and JP Morgan Payments for making it all possible. It was truly a dream come true, and that is because of our incredible partnership.\nDavid: Indeed, it was. Well listeners, we'll see you next time.\nBen: Yes, in a couple of weeks with the full show, we are pumped to drop it. We'll see you next time."
}